{
    "id": "10-10-10-rule",
    "name": "10-10-10 Rule",
    "summary": "A decision-making framework that evaluates choices by considering how you will feel about them in 10 minutes, 10 months, and 10 years.",
    "explanation": "The 10-10-10 Rule, developed by business writer Suzy Welch, is a decision-making framework that helps overcome short-term emotional reactions by considering three time horizons: 10 minutes, 10 months, and 10 years. When facing a difficult decision, you ask yourself: How will I feel about this decision 10 minutes from now? 10 months from now? 10 years from now? This temporal perspective helps distinguish between decisions that feel uncomfortable in the short term but lead to long-term benefits, versus choices that provide immediate gratification but cause future regret. For example, having a difficult conversation might feel terrible in 10 minutes, but could improve a relationship dramatically over 10 months and be nearly forgotten in 10 years. Conversely, avoiding the conversation might feel fine immediately but lead to festering problems. The framework is particularly useful for decisions involving: interpersonal conflicts, career changes, health choices, and ethical dilemmas. It counteracts our natural tendency toward hyperbolic discounting (overvaluing immediate rewards) and helps align decisions with long-term values and goals.",
    "tags": [
        "decision-making",
        "frameworks",
        "time-perspective",
        "psychology",
        "mental-models",
        "long-term-thinking"
    ],
    "category": "Frameworks",
    "icon": "FaClock",
    "featured": false,
    "aliases": [
        "10/10/10 Rule",
        "Ten Ten Ten Rule",
        "Suzy Welch 10-10-10"
    ],
    "relatedConcepts": [
        "decision-fatigue",
        "delayed-gratification",
        "second-order-effects",
        "time-horizons",
        "stoicism"
    ],
    "relatedNotes": [],
    "articles": [
        {
            "title": "10-10-10 Decision Making - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/10-10-10_(book)",
            "type": "websites"
        }
    ],
    "references": [
        {
            "title": "10-10-10: A Life-Transforming Idea",
            "url": "https://www.amazon.com/10-10-10-Life-Transforming-Suzy-Welch/dp/1416591834",
            "type": "book"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": []
}
