{
    "id": "360-degree-feedback",
    "name": "360-Degree Feedback",
    "summary": "Multi-source assessment gathering perspectives from supervisors, peers, direct reports, and yourself.",
    "explanation": "360-degree feedback (also called multi-rater feedback) is an assessment method that collects performance and behavior feedback from multiple sources: supervisors (above), peers (lateral), direct reports (below), and sometimes clients or customers - plus self-assessment. This creates a comprehensive view of how someone is perceived from all directions, hence '360 degrees.' The method reveals blind spots (things others see that you don't), hidden strengths (capabilities you undervalue), and perception gaps between self-view and others' views. Effective 360 processes include: clear purpose, anonymity for honest feedback, well-designed questions, skilled facilitation of results, and action planning. Potential pitfalls include: treating scores as absolute truth, revenge ratings, and overwhelming recipients with too much feedback. For knowledge workers and leaders, 360 feedback is valuable for self-awareness, but should be combined with reflection and coaching to turn insights into development.",
    "tags": [
        "feedback",
        "self-awareness",
        "leadership",
        "assessment",
        "professional-development"
    ],
    "category": "Tools",
    "icon": "FaCircle",
    "featured": false,
    "aliases": [
        "Multi-rater feedback",
        "360 review"
    ],
    "relatedConcepts": [
        "self-awareness",
        "structured-feedback",
        "blind-spots",
        "personal-development-plan",
        "dunning-kruger-effect",
        "johari-window"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
