{
    "id": "action-triggers",
    "name": "Action Triggers",
    "summary": "Specific cues or situations that prompt desired behaviors automatically.",
    "explanation": "Action triggers are specific cues that prompt desired behaviors. Rather than relying on motivation or memory, you link actions to reliable triggers: times, places, existing habits, or situations. Examples: 'After brushing my teeth, I will meditate' (existing habit trigger), 'At 9 AM, I will start deep work' (time trigger), or 'When I enter my office, I will review my priorities' (location trigger). Action triggers work by: removing the decision of when to act, creating automatic associations, and leveraging existing routines. Effective triggers are: consistent (happen reliably), specific (clear, unambiguous), and immediately actionable (no barriers between trigger and action). Action triggers differ from if-then plans mainly in emphasis - triggers focus on what initiates action, while if-then plans include the full conditional structure. For knowledge workers, setting action triggers helps: build reliable routines, reduce decision fatigue, and ensure important behaviors happen regardless of motivation.",
    "tags": [
        "procrastination",
        "habits",
        "behavior-change",
        "cues",
        "routines"
    ],
    "category": "Techniques",
    "icon": "FaBell",
    "featured": false,
    "aliases": [
        "Behavioral triggers",
        "Habit triggers",
        "Action cues"
    ],
    "relatedConcepts": [
        "if-then-planning",
        "habit-stacking",
        "cue-routine-reward",
        "starting-ritual",
        "environmental-design",
        "automaticity"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Switch by Chip and Dan Heath",
            "url": "https://amzn.to/3Dp09NT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
