{
    "id": "adjacent-possible",
    "name": "Adjacent Possible",
    "summary": "The range of possible next innovations given current knowledge, capabilities, and building blocks.",
    "explanation": "The adjacent possible, a concept from biologist Stuart Kauffman applied to innovation by Steven Johnson, describes the set of possible next steps given what currently exists. At any moment, certain innovations are possible because the building blocks exist, while others are impossible because prerequisites haven't been developed. The adjacent possible expands as new discoveries open new possibilities - each innovation unlocks new adjacent possibilities. This explains simultaneous invention (when conditions are right, multiple people discover the same thing) and premature ideas that fail because supporting infrastructure doesn't exist. The adjacent possible is both constraint and opportunity: you can only innovate within it, but recognizing what's now possible that wasn't before reveals opportunity. For knowledge workers, adjacent possible thinking helps: recognize what innovations are now feasible, avoid ideas that are premature, and look for new possibilities when building blocks change. Innovation often means: connecting existing pieces in new ways, not inventing from scratch.",
    "tags": [
        "innovations",
        "creativity",
        "systems",
        "emergence",
        "possibilities"
    ],
    "category": "Concepts",
    "icon": "FaDoorOpen",
    "featured": false,
    "aliases": [
        "Possibility space",
        "Innovation frontier",
        "Next possible"
    ],
    "relatedConcepts": [
        "combinatorial-creativity",
        "idea-sex",
        "serendipity"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Where Good Ideas Come From by Steven Johnson",
            "url": "https://amzn.to/3Dp09NT"
        }
    ],
    "references": [
        {
            "title": "Stuart Kauffman - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Stuart_Kauffman",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/l/pkm-coaching",
            "type": "other"
        }
    ],
    "tutorials": []
}
