{
    "id": "age-quod-agis",
    "name": "Age Quod Agis",
    "summary": "The Latin phrase meaning 'do what you are doing' - be fully present in your actions.",
    "explanation": "Age quod agis (Latin for 'do what you are doing') is a maxim emphasizing complete presence and engagement in current activity. The concept involves: giving full attention to present tasks, not letting mind wander to past or future, and performing each action with complete awareness. The wisdom addresses: divided attention (being physically present but mentally elsewhere), half-hearted effort (going through motions without engagement), and the quality loss from fragmented focus. The phrase encourages: single-minded engagement, bringing your whole self to each activity, and treating every action as worthy of full attention. It connects to mindfulness but emphasizes: action and engagement rather than observation, doing fully rather than watching, and practical application in work and daily life. The principle applies to: work tasks, conversations, daily activities, and even rest. For knowledge workers, age quod agis means: being fully present in meetings, giving complete attention to deep work, engaging wholly in conversations, and recognizing that presence is the foundation of quality.",
    "tags": [
        "philosophies",
        "wisdom",
        "presence",
        "mindfulness",
        "focus"
    ],
    "category": "Concepts",
    "icon": "FaBullseye",
    "featured": false,
    "aliases": [
        "Do what you are doing",
        "Be present in action",
        "Full engagement"
    ],
    "relatedConcepts": [
        "mindfulness",
        "presence",
        "focus",
        "hic-et-nunc",
        "attention",
        "single-tasking"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
