{
    "id": "akrasia",
    "name": "Akrasia",
    "summary": "Acting against one's better judgment - knowing what's best but doing otherwise.",
    "explanation": "Akrasia, from ancient Greek meaning 'lack of self-control,' describes acting against one's own better judgment - knowing what you should do but doing otherwise. Unlike ignorance (not knowing better) or compulsion (being forced), akrasia is freely choosing the worse option while knowing it's worse. Examples include: eating cake while dieting, scrolling social media instead of working, or staying up late when you know you need sleep. Philosophers from Plato to modern behavioral economists have grappled with how akrasia is even possible - how can we knowingly act against our interests? Explanations include: temporal discounting (present desire overriding future knowledge), emotion overriding reason, and different 'selves' with conflicting goals. Understanding akrasia differs from willpower failure - it's the puzzle of knowing and not doing. For knowledge workers, recognizing akrasia helps: distinguish knowledge problems from action problems, and focus on systems that support action rather than just acquiring more knowledge.",
    "tags": [
        "procrastination",
        "philosophies",
        "psychology",
        "self-control",
        "behaviors"
    ],
    "category": "Concepts",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Weakness of will",
        "Knowing-doing gap",
        "Self-control failure"
    ],
    "relatedConcepts": [
        "intention-action-gap",
        "willpower",
        "self-control",
        "present-bias",
        "rational-irrationality",
        "philosophies"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
