{
    "id": "amor-fati",
    "name": "Amor Fati",
    "summary": "A Stoic and Nietzschean concept meaning 'love of fate' - embracing everything that happens.",
    "explanation": "Amor fati (Latin for 'love of fate') is a concept from Stoic philosophy, later emphasized by Friedrich Nietzsche, meaning not merely accepting but actively loving everything that happens in life. Rather than wishing things were different, amor fati involves: embracing all experiences as necessary, seeing challenges as opportunities for growth, and treating every event as exactly what should happen. The concept is not passive resignation but active affirmation - saying yes to life in its entirety, including suffering and difficulty. Nietzsche described it as his formula for human greatness: wanting nothing different, neither forward nor backward, nor in all eternity. Practicing amor fati involves: reframing setbacks as fuel for growth, finding value in adversity, and approaching life with gratitude rather than resistance. The practice is powerful because resistance to reality creates suffering, while acceptance creates peace. For knowledge workers, amor fati means: embracing failures as teachers, treating obstacles as opportunities, and approaching every situation with 'this is exactly what I needed.'",
    "tags": [
        "philosophies",
        "stoicism",
        "wisdom",
        "acceptance",
        "mindsets"
    ],
    "category": "Concepts",
    "icon": "FaHeart",
    "featured": false,
    "aliases": [
        "Love of fate",
        "Embrace fate",
        "Loving one's fate"
    ],
    "relatedConcepts": [
        "stoicism",
        "the-obstacle-is-the-way",
        "premeditatio-malorum",
        "resilience",
        "eternal-recurrence"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Daily Stoic by Ryan Holiday",
            "url": "https://www.amazon.com/dp/0735211736?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Amor fati - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Amor_fati",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
