{
    "id": "anti-goals",
    "name": "Anti-Goals",
    "summary": "Explicitly defining what you want to avoid - paths, risks, results, and experiences you're not willing to accept.",
    "explanation": "Anti-Goals (also called Non-goals) invert traditional goal-setting by defining what you explicitly want to avoid. While goals set the broad direction to go towards, anti-goals help define the direction more precisely, minimizing waste, avoiding negative results, and maximizing success, happiness, and wellbeing. They're about clearly defining what you don't need or want - the paths you're not willing to walk, the risks you're not willing to take, and the results you're not interested in. Think of anti-goals as constraints or guardrails. They put lines, barriers, and limits. Examples include: life situations you don't want to be in, habits you never want to have, career evolutions you want to avoid, freedom you don't want to lose, and mistakes you don't want to repeat. Anti-goals increase clarity, improve transparency, help with decision-making, enable focus on what matters, boost creativity through constraints, and reduce needless pressure. For each goal you set, consider the associated anti-goals to create fuller guidance.",
    "tags": [
        "goal-setting",
        "planning",
        "decision-making"
    ],
    "category": "Techniques",
    "icon": "FaBan",
    "featured": false,
    "aliases": [
        "Negative goals",
        "What to avoid",
        "Non-goals"
    ],
    "relatedConcepts": [
        "goal-setting",
        "smart-goals",
        "essentialism",
        "personal-manifesto",
        "gravity-problems",
        "ikigai",
        "career-design"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Anti-goals"
    ],
    "articles": [],
    "references": [
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-personal-organization-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-26",
    "dateModified": "2025-12-27"
}
