{
    "id": "appreciation-practice",
    "name": "Appreciation Practice",
    "summary": "Regular activities focused on noticing, valuing, and acknowledging the good in life.",
    "explanation": "Appreciation practice encompasses regular activities focused on noticing, valuing, and acknowledging the good in life, relationships, and experiences. While overlapping with gratitude practice, appreciation emphasizes: recognizing value (seeing worth in things), savoring (extending positive experiences), and acknowledgment (marking what's good). Practice forms include: appreciation journaling, appreciation meditation, appreciation sharing with others, and momentary pausing to appreciate. The practice counters: hedonic adaptation (taking good things for granted), negativity bias (over-focus on problems), and speed (moving too fast to notice positives). Appreciation differs from gratitude in that gratitude often involves a benefactor (thankful to someone) while appreciation can be directed at anything (appreciating a sunset, a skill, a moment). Building appreciation practice involves: creating triggers for appreciation, pausing to savor positive moments, and actively looking for things to value. For knowledge workers, appreciation practice helps: maintain perspective amid challenges, recognize value in everyday work, and develop positive orientation that improves wellbeing and relationships.",
    "tags": [
        "gratitude",
        "appreciation",
        "practice",
        "wellbeing",
        "mindfulness"
    ],
    "category": "Techniques",
    "icon": "FaEye",
    "featured": false,
    "aliases": [
        "Practicing appreciation",
        "Value recognition",
        "Noticing good"
    ],
    "relatedConcepts": [
        "gratitude-practice",
        "savoring",
        "mindfulness",
        "positive-emotions",
        "wellbeing",
        "presence"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
