{
    "id": "aristotelianism",
    "name": "Aristotelianism",
    "summary": "Philosophical tradition based on Aristotle's teachings on ethics, logic, and metaphysics.",
    "explanation": "Aristotelianism is the philosophical tradition based on the teachings of Aristotle (384-322 BCE), one of history's most influential thinkers. His ideas shaped Western thought in ethics, logic, science, politics, and metaphysics. Key Aristotelian concepts: virtue ethics (character virtues lead to flourishing), the golden mean (virtue as balance between extremes), eudaimonia (human flourishing as life's goal), teleology (things have natural purposes), and practical wisdom (phronesis - knowing how to act well). Aristotelian logic: syllogistic reasoning, the law of non-contradiction, and categorization - foundations of formal logic. Aristotelian ethics: focuses on developing virtuous character, happiness comes from living virtuously, and virtue is developed through practice and habit. Legacy: influenced medieval philosophy (via Thomas Aquinas), modern virtue ethics revival, and scientific method foundations (observation and classification). For knowledge workers, Aristotelianism offers: framework for character development, emphasis on practical wisdom, understanding of flourishing as life's aim, and logic as foundation for clear thinking.",
    "tags": [
        "philosophy",
        "ethics",
        "virtue",
        "wisdom",
        "ancient-philosophy"
    ],
    "category": "Concepts",
    "icon": "FaLandmark",
    "featured": false,
    "aliases": [
        "Aristotelian philosophy",
        "Peripatetic philosophy",
        "Aristotle's teachings"
    ],
    "relatedConcepts": [
        "virtue-ethics",
        "eudaimonia",
        "practical-wisdom",
        "golden-mean",
        "philosophy",
        "ethics"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Nicomachean Ethics by Aristotle",
            "url": "https://amzn.to/3Dp09NT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
