{
    "id": "ars-longa-vita-brevis",
    "name": "Ars Longa Vita Brevis",
    "summary": "The Latin phrase meaning 'art is long, life is short' - the contrast between craft and mortality.",
    "explanation": "Ars longa, vita brevis (Latin translation of a Greek aphorism by Hippocrates) means 'art is long, life is short.' The original medical context noted that mastering the healing art takes longer than a single lifetime. The wisdom highlights: the vastness of skill and knowledge versus limited time, the importance of starting despite never completing, and the value of contributing to ongoing endeavors. The phrase inspires: beginning important work now (time is limited), accepting incomplete mastery (perfection is impossible), and contributing to traditions larger than oneself. It also provides perspective: individual life is brief but contributes to something enduring. The concept connects to: craft traditions (passed through generations), cumulative knowledge (building on predecessors), and legacy (contributing beyond one's life). The tension it names is: the desire to master versus time's constraint, and the resolution is purposeful engagement despite incompleteness. For knowledge workers, the phrase suggests: starting important projects now, accepting lifelong learning as unfinishable, and contributing to fields that outlast individuals.",
    "tags": [
        "philosophies",
        "wisdom",
        "time",
        "craft",
        "mortality"
    ],
    "category": "Concepts",
    "icon": "FaPaintBrush",
    "featured": false,
    "aliases": [
        "Art is long life is short",
        "Craft versus mortality",
        "Endless learning"
    ],
    "relatedConcepts": [
        "impermanence"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
