{
    "id": "ataraxia",
    "name": "Ataraxia",
    "summary": "The ancient Greek concept of tranquility - freedom from anxiety and mental disturbance.",
    "explanation": "Ataraxia is an ancient Greek concept meaning tranquility, peace of mind, and freedom from worry and anxiety. Sought by Epicureans and Skeptics as the goal of philosophy, ataraxia is: a state of robust tranquility, untroubled by the vicissitudes of life, freedom from anxiety about things beyond our control. Achieving ataraxia involves: reducing desires (fewer wants, less anxiety), accepting uncertainty (releasing need to know everything), and focusing on present (not past regret or future worry). The Epicureans sought it through: simple pleasures, friendship, and philosophical reflection. The Skeptics through: suspending judgment about uncertain matters. Ataraxia differs from: numbness (it's positive peace, not absence of feeling), escapism (it's engaged with life), and laziness (it requires active practice). The state enables: clear thinking, appropriate action, and genuine enjoyment of life. For knowledge workers, pursuing ataraxia means: not over-worrying about outcomes, reducing unnecessary desires, and cultivating peace amid professional pressures.",
    "tags": [
        "philosophies",
        "wisdom",
        "tranquility",
        "peace",
        "well-being"
    ],
    "category": "Concepts",
    "icon": "FaPeace",
    "featured": false,
    "aliases": [
        "Tranquility",
        "Peace of mind",
        "Freedom from worry"
    ],
    "relatedConcepts": [
        "apatheia",
        "peace",
        "equanimity",
        "contentment",
        "mindfulness",
        "acceptance"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
