{
    "id": "attention-capitalism",
    "name": "Attention Capitalism",
    "summary": "An economic system where capturing and monetizing attention is the primary business model.",
    "explanation": "Attention capitalism describes the economic system where capturing and monetizing human attention is the dominant business model. Unlike industrial capitalism (producing goods) or service capitalism (providing services), attention capitalism treats attention as the primary resource to be extracted. Major tech companies exemplify this: their products are designed not just for utility but for maximum attention capture, because attention translates to advertising revenue and data. Attention capitalism has societal implications: it incentivizes addictive design, sensationalized content, and optimization for engagement over wellbeing. Critics argue it's exploitative - users don't fully consent to or understand the attention extraction. Defenders note it enables free services and content accessibility. For knowledge workers, understanding attention capitalism helps: recognize when you're the product not the customer, evaluate attention costs of 'free' services, and protect attention as a valuable personal resource in a system designed to capture it.",
    "tags": [
        "attention",
        "economics",
        "technologies",
        "societies",
        "criticism"
    ],
    "category": "Concepts",
    "icon": "FaDollarSign",
    "featured": false,
    "aliases": [
        "Surveillance capitalism",
        "Digital capitalism",
        "Platform capitalism"
    ],
    "relatedConcepts": [
        "attention-economy",
        "attention-merchants",
        "surveillance-capitalism",
        "data-extraction",
        "digital-ethics",
        "technology-criticism"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
