{
    "id": "attentional-blink",
    "name": "Attentional Blink",
    "summary": "A brief period after noticing one stimulus during which a second stimulus is likely missed.",
    "explanation": "The attentional blink is a phenomenon where, after perceiving one stimulus in a rapid stream, there's a brief window (about 200-500ms) where a second target is likely to be missed. It's as if attention 'blinks' while processing the first target. The effect demonstrates: attention has temporal limitations, processing one thing temporarily impairs ability to process the next, and conscious awareness requires attention. The blink is reduced by: training, positive emotional states, and meditation practice. It's increased by: negative emotional stimuli (which capture attention longer) and cognitive load. The attentional blink has practical implications: important information shouldn't follow too closely after other attention-grabbing content, and rapid information streams may cause missed elements. For knowledge workers, understanding the attentional blink helps: design better presentations, recognize processing limitations, and appreciate why back-to-back attention demands impair performance.",
    "tags": [
        "attention",
        "cognition",
        "psychology",
        "perceptions",
        "limitations"
    ],
    "category": "Concepts",
    "icon": "FaEyeSlash",
    "featured": false,
    "aliases": [
        "AB",
        "Attention blink",
        "Temporal attention gap"
    ],
    "relatedConcepts": [
        "selective-attention"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Attentional blink - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Attentional_blink",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
