{
    "id": "attention-gym",
    "name": "Attention Gym",
    "summary": "Regular practices for building and maintaining attentional fitness and focus capacity.",
    "explanation": "The attention gym is a metaphor for regular practices that build and maintain attentional fitness, just as physical exercise maintains physical fitness. The concept emphasizes that attention is trainable and requires ongoing practice. An attention gym routine might include: daily meditation sessions, deliberate single-tasking practice, progressive focus challenges (gradually longer focused periods), and attention awareness exercises. Like physical gyms, the attention gym requires: regularity (daily practice beats occasional efforts), progressive challenge (gradually increasing difficulty), and variety (different attention 'exercises' target different aspects). Benefits compound over time - consistent practice builds lasting capacity. The gym metaphor helps frame attention training as: normal maintenance (not remediation), requiring ongoing effort (not one-time fixes), and having cumulative benefits (fitness builds over time). For knowledge workers, building an attention gym practice means: scheduling regular training, tracking progress, and recognizing that attention fitness requires ongoing maintenance.",
    "tags": [
        "attention",
        "training",
        "practices",
        "focus",
        "habits"
    ],
    "category": "Techniques",
    "icon": "FaDumbbell",
    "featured": false,
    "aliases": [
        "Focus gym",
        "Concentration practice",
        "Attention exercises"
    ],
    "relatedConcepts": [
        "attention-training",
        "meditation",
        "deliberate-practice",
        "focus",
        "habit-formation",
        "cognitive-fitness"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
