{
    "id": "attention-merchants",
    "name": "Attention Merchants",
    "summary": "Entities that capture attention and resell it to advertisers and others who want influence.",
    "explanation": "Attention merchants, Tim Wu's term, describes businesses built on capturing human attention and reselling it. From newspapers to social media, the model is: offer something that attracts attention (content, connection, utility), then sell access to that attention (advertising, sponsored content, data). Modern attention merchants are highly sophisticated: using behavioral psychology, data analytics, and addictive design patterns to maximize attention capture. They employ: variable rewards (slot machine psychology), social validation, infinite scroll, personalization, and notification optimization. The bargain is often invisible - 'free' services extract significant attention value. Attention merchants compete intensely because attention is zero-sum - time given to one platform is taken from others. For knowledge workers, recognizing attention merchants helps: understand why platforms behave as they do, evaluate whether the attention exchange is fair, and make conscious choices about which merchants deserve your attention.",
    "tags": [
        "attention",
        "business",
        "technology",
        "media",
        "advertising"
    ],
    "category": "Concepts",
    "icon": "FaStore",
    "featured": false,
    "aliases": [
        "Attention harvesters",
        "Attention extractors",
        "Engagement merchants"
    ],
    "relatedConcepts": [
        "attention-economy",
        "social-media",
        "advertising",
        "addictive-design",
        "digital-distraction",
        "platform-business"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "The Attention Merchants by Tim Wu",
            "url": "https://amzn.to/3Dp08MT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
