{
    "id": "attention-training",
    "name": "Attention Training",
    "summary": "Practices designed to improve attentional capacity, control, and flexibility.",
    "explanation": "Attention training refers to practices that improve attentional capacity, control, and flexibility. Like physical training strengthens muscles, attention training strengthens focus. Methods include: meditation (especially focused attention practices), working memory training, cognitive training games, and deliberate practice of sustained focus. Research shows training can improve: attention span, resistance to distraction, attention switching efficiency, and awareness of attention wandering. Meditation is particularly well-studied - regular practice shows improvements in sustained attention, executive function, and attention regulation. Training effects include: faster return to focus after distraction, earlier detection of mind-wandering, and greater capacity for sustained concentration. Limitations: training effects don't always transfer broadly, and some 'brain training' products lack evidence. For knowledge workers, attention training offers: improved focus capacity, better distraction resistance, and greater awareness of attention patterns. Even modest daily practice (10-20 minutes meditation) shows measurable benefits.",
    "tags": [
        "attention",
        "training",
        "focus",
        "meditation",
        "cognitive-enhancement"
    ],
    "category": "Techniques",
    "icon": "FaDumbbell",
    "featured": false,
    "aliases": [
        "Focus training",
        "Concentration training",
        "Cognitive training"
    ],
    "relatedConcepts": [
        "mindfulness",
        "focus",
        "deliberate-practice",
        "neuroplasticity"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
