{
    "id": "autogenic-training",
    "name": "Autogenic Training",
    "summary": "A self-hypnosis relaxation technique using mental suggestions of heaviness and warmth.",
    "explanation": "Autogenic training, developed by German psychiatrist Johannes Schultz in the 1930s, is a relaxation technique using self-suggestion to induce a state of calm. 'Autogenic' means self-generated - you guide yourself into relaxation through mental repetition of standard formulas. The six core exercises involve silently repeating phrases while focusing on different body parts: heaviness in limbs ('My arms are heavy'), warmth in limbs ('My arms are warm'), calm heartbeat, easy breathing, warmth in abdomen, and cool forehead. These phrases induce the physical states they describe through the power of suggestion and focused attention. Regular practice (10-15 minutes, ideally twice daily) develops the ability to quickly shift into relaxation. Autogenic training is used for stress reduction, sleep improvement, anxiety management, and even athletic performance. It requires initial learning investment but becomes increasingly effective with practice.",
    "tags": [
        "relaxation",
        "stresses",
        "self-hypnosis",
        "techniques",
        "well-being"
    ],
    "category": "Techniques",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "AT",
        "Schultz relaxation",
        "Autogenics"
    ],
    "relatedConcepts": [
        "relaxation-response",
        "progressive-muscle-relaxation",
        "self-regulation",
        "biofeedback"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Autogenic training - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Autogenic_training",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
