{
    "id": "behavioral-contagion",
    "name": "Behavioral Contagion",
    "summary": "The spread of behaviors through social groups, where observing others influences actions.",
    "explanation": "Behavioral contagion is the phenomenon where behaviors spread through social groups - observing others' actions influences our own. This happens through: social proof (if others do it, it must be right), normalization (behaviors become acceptable by being common), and mirror neurons (we unconsciously mimic observed behavior). Research shows contagion effects for: obesity, smoking cessation, happiness, productivity, and charitable giving. Behaviors spread through: direct observation, social networks, and cultural transmission. The strength of contagion depends on: relationship closeness, behavior visibility, and perceived similarity. Contagion can spread: positive behaviors (exercise, healthy eating) and negative ones (procrastination, negativity). Understanding contagion enables: intentional exposure to desired behaviors, avoiding negative behavioral environments, and leveraging social influence for change. For knowledge workers, behavioral contagion suggests: surrounding yourself with productive people, being aware of team behavior patterns, and recognizing that your behaviors affect others in your network.",
    "tags": [
        "psychology",
        "behaviors",
        "social-influence",
        "habits",
        "networks"
    ],
    "category": "Concepts",
    "icon": "FaVirus",
    "featured": false,
    "aliases": [
        "Social contagion",
        "Behavior spread",
        "Mimetic behavior"
    ],
    "relatedConcepts": [
        "social-proof",
        "emotional-contagion",
        "habit-loop"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Connected by Nicholas Christakis",
            "url": "https://amzn.to/3Dp09NT"
        }
    ],
    "references": [
        {
            "title": "Behavioral contagion - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Behavioral_contagion",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
