{
    "id": "better-than-average-effect",
    "name": "Better-Than-Average Effect",
    "summary": "The cognitive bias where people overestimate their own qualities and abilities relative to others, believing themselves to be above average on desirable traits.",
    "explanation": "The Better-Than-Average Effect is a cognitive bias in which individuals consistently rate themselves as above average on positive traits and abilities, despite the statistical impossibility of most people being above average. This widespread phenomenon reflects our tendency toward self-enhancement and has been documented across cultures, ages, and domains of competence.\n\nOne of the most famous demonstrations of this effect comes from a 1981 study by Ola Svenson, who found that 93% of American drivers rated themselves as better than the median driver in terms of safety and skill. Similar patterns emerge across virtually every positive dimension: most people believe they are more intelligent, more ethical, healthier, and better at their jobs than the average person. Conversely, for negative traits, people tend to rate themselves as below average.\n\nThe effect appears strongest in domains that are subjective, ambiguous, or difficult to measure objectively. When performance criteria are clear and feedback is immediate (like standardized test scores), the effect diminishes. It is also more pronounced for traits considered important or socially desirable and in Western individualistic cultures compared to collectivist cultures, though it exists to some degree universally.\n\nSeveral mechanisms contribute to this bias. We have privileged access to our own intentions and mitigating circumstances but judge others primarily on their observable behavior. We also tend to weight criteria where we excel more heavily when making self-assessments. Additionally, the comparison group 'average person' is often a vague abstraction that we implicitly define in ways favorable to ourselves.\n\nThe Better-Than-Average Effect has significant implications for self-assessment and personal development. It can lead to overconfidence in decision-making, inadequate preparation for challenges, and resistance to feedback or training. In organizational contexts, it contributes to unrealistic expectations about promotions and can fuel interpersonal conflicts when people believe their contributions are undervalued. Understanding this bias is essential for cultivating intellectual humility, seeking objective feedback, and making more accurate self-assessments. Counteracting it requires deliberately comparing yourself to specific individuals rather than vague averages and actively soliciting honest external feedback.",
    "tags": [
        "cognitive-biases",
        "psychology",
        "self-perception",
        "decision-making",
        "thinking"
    ],
    "category": "Principles",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Lake Wobegon Effect",
        "Illusory Superiority",
        "Above-Average Effect"
    ],
    "relatedConcepts": [
        "dunning-kruger-effect",
        "self-serving-bias",
        "optimism-bias"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Thinking, Fast and Slow by Daniel Kahneman",
            "url": "https://www.amazon.com/dp/0374533555?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Illusory Superiority - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Illusory_superiority",
            "type": "website"
        },
        {
            "title": "Are We All Less Risky and More Skillful Than Our Fellow Drivers? - Ola Svenson (1981)",
            "url": "https://doi.org/10.1016/0001-6918(81)90005-6",
            "type": "paper"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-30",
    "dateModified": "2025-12-30"
}
