{
    "id": "bottom-up-attention",
    "name": "Bottom-Up Attention",
    "summary": "Attention captured automatically by salient stimuli in the environment.",
    "explanation": "Bottom-up attention (also called exogenous or stimulus-driven attention) is attention captured automatically by salient environmental features - loud noises, sudden movements, bright colors, or novel stimuli. It's involuntary: you don't choose to notice the flash; it grabs your attention. Bottom-up attention evolved for survival - noticing predators, threats, and opportunities without conscious effort. Features that capture bottom-up attention include: sudden onset, movement, contrast, emotional salience, and personal relevance (hearing your name). In modern environments, bottom-up attention is constantly hijacked: notifications, ads, and feeds are designed to trigger it. The challenge is that bottom-up capture interrupts top-down (goal-directed) focus. For knowledge workers, understanding bottom-up attention means: designing environments that minimize unwanted capture, recognizing what's grabbing attention and whether it should, and knowing that fighting bottom-up capture with willpower is difficult.",
    "tags": [
        "attention",
        "cognition",
        "perceptions",
        "psychology",
        "focus"
    ],
    "category": "Concepts",
    "icon": "FaBolt",
    "featured": false,
    "aliases": [
        "Exogenous attention",
        "Stimulus-driven attention",
        "Reflexive attention"
    ],
    "relatedConcepts": [
        "top-down-attention",
        "selective-attention",
        "salience",
        "distraction",
        "attention-capture",
        "environmental-design"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
