{
    "id": "cardinal-virtues",
    "name": "Cardinal Virtues",
    "summary": "The four principal virtues in classical philosophy: prudence, justice, temperance, fortitude.",
    "explanation": "The Cardinal Virtues are four principal virtues recognized in classical philosophy and adopted by Christian thought: Prudence (phronesis) - practical wisdom, knowing what to do in each situation; Justice (dikaiosyne) - giving each their due, fairness in dealings; Temperance (sophrosyne) - moderation, self-control, restraint; Fortitude (andreia) - courage, strength in facing difficulty. They're called 'cardinal' from Latin 'cardo' (hinge) - all other virtues hinge on these foundational four. Prudence is often called the 'charioteer' of virtues - it guides application of the others. The virtues are interconnected: prudence without courage isn't applied, justice without temperance becomes harsh, courage without prudence becomes recklessness. In Plato, they correspond to parts of the soul and classes of the ideal city. The framework offers: comprehensive model of good character, practical guidance for development, and diagnostic tool for self-assessment. For knowledge workers, the cardinal virtues suggest: developing practical judgment, acting fairly toward colleagues, practicing self-discipline, and facing challenges with courage.",
    "tags": [
        "philosophies",
        "virtue",
        "ethics",
        "wisdom",
        "character"
    ],
    "category": "Frameworks",
    "icon": "FaStar",
    "featured": false,
    "aliases": [
        "Four cardinal virtues",
        "Principal virtues",
        "Classical virtues"
    ],
    "relatedConcepts": [
        "phronesis",
        "sophrosyne",
        "theological-virtues"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Cardinal virtues - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Cardinal_virtues",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
