{
    "id": "career-design",
    "name": "Career Design",
    "summary": "The intentional process of designing and shaping your professional path to align with your values, principles, and life goals.",
    "explanation": "Career Design is taking responsibility for your own professional path rather than letting it happen by chance. Your career is under your own responsibility - never let others decide for you. When work isn't aligned with your values, principles, goals, and priorities, it's tough to find motivation and drive. Signs of alignment problems include: uninspiring projects, frustration with work environment, sighing when thinking about going to work, and excessive procrastination. Career Design involves: knowing where you want to go (planning ahead), making conscious decisions (choosing your own path), knowing if you're on the right path (evaluating), and staying on the right path through regular reviews. Consider different time horizons: this year, next year, 3 years, 5 years, 10 years, and your end goal. Direction is vastly more important than speed. Favor freedom and agency over money. Favor work-life balance over fancy job titles. Don't chase status - chase joy and happiness. Always have a viable 'Plan B' and consider uncommon career paths like entrepreneurship, freelancing, or solopreneurship.",
    "tags": [
        "careers",
        "clarity",
        "life-design",
        "personal-growth",
        "planning"
    ],
    "category": "Clarity",
    "icon": "FaBriefcase",
    "featured": false,
    "aliases": [
        "Professional Development",
        "Career Planning",
        "Career Management"
    ],
    "relatedConcepts": [
        "ikigai",
        "life-design",
        "personal-value-system",
        "personal-manifesto",
        "anti-goals",
        "periodic-reviews",
        "time-horizons",
        "work-life-balance",
        "work-life-integration"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Career+Design"
    ],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-26",
    "dateModified": "2025-12-28"
}
