{
    "id": "career-alignment",
    "name": "Career Alignment",
    "summary": "The compatibility between your work and your values, principles, goals, and priorities.",
    "explanation": "Career Alignment is about ensuring compatibility between the work you do and your own values, principles, goals, and priorities. When your work is not aligned, it's really tough to find motivation, drive, and energy - it's actually a recipe for disaster. Many Knowledge Workers never think about alignment when making career choices, and end up demotivated, unfulfilled, or even burned out. Seeking alignment means making career choices that enable you to reach your chosen goals. Cohesion is the related concept of compatibility between all facets of your life. Signs of alignment problems include: uninspiring projects, frustrating work environment, sighing when thinking about going to work, and excessive procrastination (which often indicates an underlying inner conflict). The solution is to regularly assess your situation, be honest with yourself, favor freedom and agency over money, favor work-life balance over fancy job titles, and don't chase status - chase joy and happiness. Remember: the path of least resistance is not always the most fulfilling one.",
    "tags": [
        "careers",
        "clarity",
        "values",
        "personal-growth",
        "decision-making"
    ],
    "category": "Clarity",
    "icon": "FaBalanceScale",
    "featured": false,
    "aliases": [
        "Work-life alignment",
        "Career cohesion",
        "Values alignment"
    ],
    "relatedConcepts": [
        "career-design",
        "personal-value-system",
        "personal-manifesto",
        "ikigai",
        "life-design",
        "work-life-balance",
        "work-life-integration",
        "living-on-default",
        "intrinsic-motivation"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-27",
    "dateModified": "2025-12-28"
}
