{
    "id": "carpe-diem",
    "name": "Carpe Diem",
    "summary": "The Latin phrase meaning 'seize the day' - making the most of present opportunities.",
    "explanation": "Carpe diem (Latin for 'seize the day' or 'pluck the day') is a phrase from Horace's Odes encouraging making the most of present time and opportunities. The full context adds: 'trusting as little as possible in tomorrow.' The philosophy involves: recognizing life's brevity, acting on opportunities now rather than postponing, and not assuming future chances. Carpe diem is not about recklessness or hedonism but: purposeful engagement with present opportunities, not letting fear or procrastination waste time, and treating each day as valuable. The concept balances with: prudent planning (not ignoring future), sustainable pace (not burning out), and meaningful action (not just pleasure). It counters: excessive deferral ('I'll do it later'), fear-based inaction, and taking present moments for granted. Understanding impermanence makes action more precious. For knowledge workers, carpe diem suggests: pursuing meaningful projects now rather than waiting for perfect conditions, having important conversations while you can, and treating workdays as opportunities not obligations.",
    "tags": [
        "philosophies",
        "wisdom",
        "time",
        "actions",
        "motivations"
    ],
    "category": "Concepts",
    "icon": "FaSun",
    "featured": false,
    "aliases": [
        "Seize the day",
        "Pluck the day",
        "Live fully today"
    ],
    "relatedConcepts": [
        "tempus-fugit",
        "impermanence"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Carpe diem - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Carpe_diem",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
