{
    "id": "categorical-desires",
    "name": "Categorical Desires",
    "summary": "Desires that give us reasons to continue living, as opposed to conditional desires that assume we are already alive.",
    "explanation": "Categorical Desires is a philosophical concept developed by Bernard Williams to explain what motivates continued existence. Unlike conditional desires—which presuppose that you are alive (such as wanting to finish reading a book or see a friend)—categorical desires provide fundamental reasons to want to go on living at all.\n\nWilliams introduced this concept in his essay \"The Makropulos Case: Reflections on the Tedium of Immortality,\" using the example of an opera character who becomes immortal and eventually finds eternal life unbearable. He argued that categorical desires are essential for making life worth living, but they have important limitations:\n\n**Key Characteristics:**\n\n**Future-Oriented**: Categorical desires project into the future and give us reasons to want to be there when that future arrives.\n\n**Identity-Connected**: These desires are deeply tied to who we are as individuals. They reflect our core values, projects, and commitments.\n\n**Exhaustible**: Williams argued that categorical desires can run out over sufficiently long timescales. After hundreds or thousands of years, one might exhaust the desires that made immortality appealing.\n\n**Personal and Variable**: What counts as a categorical desire varies between individuals—for one person it might be creative work, for another raising children, for another scientific discovery.\n\n**The Immortality Problem:**\n\nWilliams used categorical desires to argue against the desirability of immortality. He proposed that eternal life leads to two equally problematic outcomes:\n\n1. **Boredom through exhaustion**: Your categorical desires eventually run out, making continued existence tedious and meaningless.\n\n2. **Loss of identity**: To avoid boredom, you must change so fundamentally that the person who wanted immortality no longer exists—so in a meaningful sense, \"you\" didn't get immortality after all.\n\n**Contrast with Conditional Desires:**\n\n- **Conditional**: \"I want to eat dinner\" (assumes you're alive)\n- **Categorical**: \"I want to see my children grow up\" (gives reason to stay alive)\n\nUnderstanding categorical desires helps clarify what gives life meaning and purpose. It suggests that mortality may be necessary for the very desires that make life worth living—they gain urgency and significance precisely because we don't have infinite time to pursue them.",
    "tags": [
        "philosophy",
        "mortality",
        "purpose",
        "meaning",
        "existentialism",
        "desires",
        "motivation",
        "ethics"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Ground Projects",
        "Life-Sustaining Desires",
        "Categorical Projects"
    ],
    "relatedConcepts": [
        "memento-mori",
        "ikigai",
        "existentialism"
    ],
    "relatedNotes": [],
    "articles": [
        {
            "title": "Why We Need to Die",
            "url": "https://willllliam.com/blog/why-we-need-to-die",
            "type": "website"
        }
    ],
    "books": [
        {
            "title": "Problems of the Self by Bernard Williams",
            "url": "https://www.amazon.com/dp/0521290600?tag=dsebastien00-20"
        },
        {
            "title": "The Makropulos Case in Philosophy and Phenomenological Research",
            "url": "https://www.amazon.com/dp/0521315700?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Bernard Williams - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Bernard_Williams",
            "type": "website"
        },
        {
            "title": "The Makropulos Case - Stanford Encyclopedia of Philosophy",
            "url": "https://plato.stanford.edu/entries/williams-bernard/",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-30",
    "dateModified": "2025-12-30"
}
