{
    "id": "change-blindness",
    "name": "Change Blindness",
    "summary": "Failure to notice changes in visual scenes, especially during disruptions or when attention is elsewhere.",
    "explanation": "Change blindness is the failure to notice changes in visual scenes that occur during brief visual disruptions (like eye movements, blinks, or scene cuts). People can miss major changes - swapped conversation partners, disappearing objects, or altered colors - if the change occurs during an interruption. Change blindness reveals: we don't perceive as continuously as we think, visual memory across disruptions is limited, and attention is required to detect change. The effect is stronger when: changes are outside the focus of attention, changes occur gradually, and observers aren't expecting change. Change blindness has practical implications: eyewitness testimony is less reliable than assumed, important changes may go unnoticed, and continuous monitoring doesn't guarantee change detection. For knowledge workers, understanding change blindness suggests: actively checking for changes rather than assuming you'd notice, documenting states to compare, and not overestimating your awareness of gradual shifts.",
    "tags": [
        "attention",
        "perceptions",
        "cognition",
        "psychology",
        "awareness"
    ],
    "category": "Concepts",
    "icon": "FaExclamationTriangle",
    "featured": false,
    "aliases": [
        "Visual change blindness",
        "Change detection failure",
        "Scene blindness"
    ],
    "relatedConcepts": [
        "inattentional-blindness"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
