{
    "id": "chronic-stress",
    "name": "Chronic Stress",
    "summary": "Prolonged activation of the stress response without adequate recovery, causing cumulative damage.",
    "explanation": "Chronic stress is the long-term activation of the body's stress response system without sufficient recovery periods. While acute stress is adaptive (mobilizing resources for immediate challenges), chronic stress causes cumulative harm. The body wasn't designed for persistent fight-or-flight activation. Effects include: elevated cortisol damaging memory and immune function, cardiovascular strain, inflammation, sleep disruption, anxiety, depression, and accelerated aging. Common sources include: ongoing work pressure, financial worry, relationship problems, caregiving demands, and hostile environments. Chronic stress differs from acute stress not just in duration but in its insidious nature - it becomes the 'new normal,' making it harder to recognize. For knowledge workers, chronic stress often develops gradually through sustained overwork without recovery. The solution requires addressing root causes, not just managing symptoms.",
    "tags": [
        "stresses",
        "health",
        "psychology",
        "physiology",
        "well-being"
    ],
    "category": "Concepts",
    "icon": "FaInfinity",
    "featured": false,
    "aliases": [
        "Long-term stress",
        "Persistent stress",
        "Ongoing stress"
    ],
    "relatedConcepts": [
        "acute-stress",
        "burnouts",
        "allostatic-load",
        "cortisol",
        "recovery",
        "resilience"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Why Zebras Don't Get Ulcers by Robert Sapolsky",
            "url": "https://amzn.to/3DpT9BT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
