{
    "id": "cognitive-distortions",
    "name": "Cognitive Distortions",
    "summary": "Systematic patterns of biased thinking that negatively distort our perception of reality.",
    "explanation": "Cognitive distortions are habitual patterns of thinking that are biased, exaggerated, or irrational, leading to negative emotions and maladaptive behavior. Identified in cognitive behavioral therapy, common distortions include: all-or-nothing thinking (seeing things in black and white), catastrophizing (expecting the worst), mind reading (assuming others' negative thoughts), fortune telling (predicting negative outcomes), personalization (blaming yourself for external events), should statements (rigid rules about behavior), and emotional reasoning (feeling something makes it true). Everyone experiences cognitive distortions, but they become problematic when frequent and intense. Recognizing distortions is the first step to challenging them. Techniques include examining evidence, considering alternative explanations, and testing predictions. Journaling helps identify recurring patterns. Awareness of these distortions improves decision-making and emotional well-being.",
    "tags": [
        "psychology",
        "mental-health",
        "thinking",
        "cognition",
        "cbt"
    ],
    "category": "Concepts",
    "icon": "FaGlasses",
    "featured": false,
    "aliases": [
        "Thinking errors",
        "Negative thinking patterns",
        "Automatic negative thoughts"
    ],
    "relatedConcepts": [
        "cognitive-behavioral-therapy",
        "cognitive-reappraisal",
        "putting-thoughts-on-trial",
        "catastrophizing",
        "anxiety",
        "depression"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Feeling Good by David Burns",
            "url": "https://amzn.to/3VkT5H7"
        }
    ],
    "references": [
        {
            "title": "Cognitive distortion - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Cognitive_distortion",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
