{
    "id": "compassion-fatigue",
    "name": "Compassion Fatigue",
    "summary": "Emotional and physical exhaustion from caring for others in distress, reducing capacity for empathy.",
    "explanation": "Compassion fatigue is the emotional, physical, and psychological impact of helping others, often through experiences of stress, trauma, or suffering. Originally identified in healthcare workers, it affects anyone who regularly supports others in distress: managers, coaches, parents, volunteers, and caring colleagues. Symptoms include emotional numbness, reduced empathy, irritability, difficulty separating work from personal life, and decreased job satisfaction. Unlike burnout (which stems from workplace demands generally), compassion fatigue specifically results from the empathic engagement with others' suffering. Prevention involves: setting boundaries, practicing self-compassion, maintaining personal interests outside caregiving, seeking supervision or peer support, and recognizing early warning signs. Understanding compassion fatigue helps validate the real cost of caring work and emphasizes that sustainable helping requires caring for oneself too.",
    "tags": [
        "psychology",
        "mental-health",
        "well-being",
        "burnouts",
        "stresses",
        "coaching"
    ],
    "category": "Concepts",
    "icon": "FaBatteryQuarter",
    "featured": false,
    "aliases": [
        "Secondary traumatic stress",
        "Empathy fatigue",
        "Caregiver burnout"
    ],
    "relatedConcepts": [
        "burnouts",
        "emotional-burnout",
        "empathy",
        "self-compassion",
        "types-of-rest",
        "boundaries"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/l/pkm-coaching",
            "type": "other"
        }
    ],
    "tutorials": []
}
