{
    "id": "core-human-drives",
    "name": "Core Human Drives",
    "summary": "Five fundamental motivations that drive all human behavior: the drives to Acquire, Bond, Learn, Defend, and Feel.",
    "explanation": "Core Human Drives is a framework from Josh Kaufman's 'The Personal MBA' that identifies five fundamental motivations underlying all human behavior. Understanding these drives helps in product design, marketing, management, and personal development.\n\n**The Five Core Drives**:\n\n1. **Drive to Acquire**: The desire to collect material and immaterial things—possessions, money, status, influence, and experiences. This explains why people seek promotions, buy luxury items, and accumulate wealth.\n\n2. **Drive to Bond**: The desire to be loved and feel valued in relationships with others. This drive underlies our need for connection, belonging, friendship, and community.\n\n3. **Drive to Learn**: The desire to satisfy our curiosity and understand the world around us. This explains why people read books, explore new places, take courses, and seek to master new skills.\n\n4. **Drive to Defend**: The desire to protect ourselves, our loved ones, and our property from threats—physical, emotional, or financial. This drives security-seeking behavior and risk management.\n\n5. **Drive to Feel**: The desire for emotional experiences like pleasure, excitement, novelty, and entertainment. This explains why people seek entertainment, adventure, and sensory experiences.\n\n**Practical Applications**:\n\n- **Business**: Whenever a group of people have an unmet drive, a market forms to satisfy it. The more drives your product or service addresses, and the better you communicate those connections, the more attractive your offer becomes.\n\n- **Marketing**: Frame your message to appeal to multiple drives. A car might satisfy the drive to acquire (status), bond (family trips), and feel (driving pleasure).\n\n- **Product Design**: Consider which drives your product addresses and how to strengthen those connections.\n\n- **Self-Understanding**: Recognize which drives most influence your own decisions and behaviors.\n\nThis framework provides a simple but powerful lens for understanding human motivation and designing solutions that resonate with fundamental needs.",
    "tags": [
        "psychology",
        "motivations",
        "businesses",
        "marketing",
        "human-nature",
        "personal-development"
    ],
    "category": "Frameworks",
    "icon": "FaUsers",
    "featured": false,
    "aliases": [
        "Five Core Human Drives",
        "Human Drives Framework"
    ],
    "relatedConcepts": [
        "intrinsic-motivation",
        "extrinsic-motivation",
        "ikigai",
        "buyer-persona"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/32+Literature+notes/32.02+Content/Core+human+drives"
    ],
    "articles": [],
    "references": [
        {
            "title": "Core Human Drives - The Personal MBA",
            "url": "https://personalmba.com/core-human-drives/",
            "type": "websites"
        },
        {
            "title": "The Personal MBA by Josh Kaufman",
            "url": "https://personalmba.com/",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        }
    ],
    "tutorials": []
}
