{
    "id": "creative-destruction",
    "name": "Creative Destruction",
    "summary": "The process by which innovation continuously destroys and replaces old economic structures.",
    "explanation": "Creative destruction, a concept from economist Joseph Schumpeter, describes capitalism's essential nature: innovation continuously destroys and replaces existing economic structures. New technologies, products, and business models arise and make old ones obsolete - automobiles destroyed horse-drawn transportation, digital photography destroyed film, streaming destroyed video rental. This destruction is 'creative' because it enables progress; new value replaces old. Creative destruction is uncomfortable for incumbents (who are destroyed) and workers in displaced industries, but drives economic growth and improvement. Schumpeter saw entrepreneurs as the agents of creative destruction, introducing innovations that transform industries. For knowledge workers, creative destruction is both threat and opportunity: skills and industries become obsolete (requiring continuous adaptation), but new possibilities constantly emerge. Understanding creative destruction helps: anticipate industry changes, recognize when to abandon declining fields, and identify emerging opportunities.",
    "tags": [
        "innovations",
        "economics",
        "changes",
        "disruption",
        "capitalism"
    ],
    "category": "Concepts",
    "icon": "FaSync",
    "featured": false,
    "aliases": [
        "Schumpeterian destruction",
        "Destructive creation",
        "Economic transformation"
    ],
    "relatedConcepts": [
        "disruptive-innovation",
        "radical-innovation"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Creative destruction - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Creative_destruction",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
