{
    "id": "crossing-the-chasm",
    "name": "Crossing the Chasm",
    "summary": "The challenge of transitioning technology products from early adopters to mainstream market.",
    "explanation": "Crossing the Chasm, from Geoffrey Moore's book, describes the critical transition technology products must make between early adopters and the mainstream market. Early adopters buy for potential and tolerate imperfections; mainstream customers want proven solutions with references and support. The 'chasm' is the gap between these groups - many products succeed with early adopters but fail to cross to mainstream. Crossing requires: focusing on a specific niche (beachhead), providing whole product solutions (not just technology), establishing references, and appropriate positioning. The strategy is counterintuitive: go narrow to go broad. Rather than serving all potential customers, dominate one segment completely, then expand. This creates the references, case studies, and word-of-mouth needed for mainstream adoption. For knowledge workers, chasm-crossing thinking applies beyond products: new practices, ideas, and initiatives face similar adoption challenges requiring focused, whole-solution approaches.",
    "tags": [
        "innovations",
        "strategies",
        "marketing",
        "technologies",
        "adoption"
    ],
    "category": "Concepts",
    "icon": "FaBridge",
    "featured": false,
    "aliases": [
        "Technology chasm",
        "Moore's chasm",
        "Adoption chasm"
    ],
    "relatedConcepts": [
        "innovation-diffusion",
        "technology-adoption-lifecycle",
        "early-adopters",
        "beachhead-strategy",
        "product-market-fit",
        "go-to-market"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Crossing the Chasm by Geoffrey Moore",
            "url": "https://amzn.to/3Dp08MT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
