{
    "id": "dependent-origination",
    "name": "Dependent Origination",
    "summary": "The Buddhist teaching that all phenomena arise from conditions, nothing exists independently.",
    "explanation": "Dependent origination (pratityasamutpada) is a core Buddhist teaching that all phenomena arise from conditions - nothing exists independently or permanently. The principle states: 'When this exists, that comes to be. From the arising of this, that arises. When this does not exist, that does not come to be.' The teaching has multiple applications: in understanding suffering (showing how mental formations lead to suffering in a causal chain), in ethics (our actions have consequences), and in philosophy (challenging ideas of independent existence). Key implications include: everything is interconnected, nothing has permanent independent essence, and change is possible because things arise from conditions. The teaching avoids both eternalism (things exist permanently) and nihilism (nothing matters). Understanding dependent origination enables: seeing how suffering arises and can cease, recognizing our interdependence with everything, and approaching problems as arising from conditions (therefore changeable). For knowledge workers, dependent origination suggests: systems thinking, understanding how situations arise from multiple factors, and recognizing that changing conditions can change outcomes.",
    "tags": [
        "philosophies",
        "buddhism",
        "wisdom",
        "causation",
        "interconnection"
    ],
    "category": "Concepts",
    "icon": "FaProjectDiagram",
    "featured": false,
    "aliases": [
        "Pratityasamutpada",
        "Interdependent arising",
        "Conditioned arising"
    ],
    "relatedConcepts": [
        "systems-thinking",
        "impermanence"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Prat카tyasamutp훮da - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Prat카tyasamutp훮da",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
