{
    "id": "design-thinking-process",
    "name": "Design Thinking Process",
    "summary": "A human-centered problem-solving methodology with five iterative phases.",
    "explanation": "The Design Thinking Process is a human-centered problem-solving methodology developed at Stanford's d.school and IDEO. It emphasizes understanding users deeply before developing solutions. The five phases: Empathize - understand users deeply through observation, interviews, and immersion. Set aside assumptions and truly see the problem from their perspective. Define - synthesize findings to define the core problem. Create a clear problem statement (point of view) that guides ideation. Ideate - generate many possible solutions without judgment. Brainstorm widely, then converge on promising ideas. Prototype - create quick, rough versions of solutions. Make ideas tangible so they can be tested and improved. Test - gather feedback on prototypes. Learn what works, what doesn't, and iterate based on real user reactions. Key principles: human-centered (start with people, not technology), prototype early (learn by making), embrace ambiguity (be comfortable with not knowing), and iterate (improvement through cycles). The process is non-linear - you may jump between phases based on what you learn. For knowledge workers, Design Thinking provides: structured approach to complex problems, emphasis on user needs, and permission to experiment before committing.",
    "tags": [
        "designs",
        "problem-solving",
        "innovations",
        "methodology",
        "frameworks"
    ],
    "category": "Frameworks",
    "icon": "FaPencilRuler",
    "featured": false,
    "aliases": [
        "d.school process",
        "Human-centered design",
        "Design thinking stages"
    ],
    "relatedConcepts": [
        "design-thinking",
        "double-diamond-process",
        "user-centered-design",
        "prototyping",
        "empathy",
        "iteration"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Change by Design by Tim Brown",
            "url": "https://amzn.to/3Dp09NT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
