{
    "id": "digital-mindfulness",
    "name": "Digital Mindfulness",
    "summary": "Intentional, aware use of technology - choosing how you engage with digital tools rather than being driven by them.",
    "explanation": "Digital mindfulness is the practice of bringing awareness and intentionality to technology use. In an attention economy where apps are designed to capture and hold attention, mindless technology use can consume hours, fragment focus, and harm wellbeing. Digital mindfulness involves: noticing your impulses to check devices, being aware of how technology makes you feel, choosing when and how to engage rather than reacting automatically, and designing your digital environment to support your intentions. Practices include: pausing before opening apps and asking 'why?', noticing the urge to check without acting, using apps with intention rather than out of habit, regular digital detoxes, and curating feeds and notifications intentionally. For knowledge workers, digital mindfulness is essential for protecting attention, maintaining deep work capacity, and ensuring technology serves you rather than consuming you.",
    "tags": [
        "mindfulness",
        "technologies",
        "attention",
        "productivity",
        "habits"
    ],
    "category": "Concepts",
    "icon": "FaMobileAlt",
    "featured": false,
    "aliases": [
        "Mindful technology use",
        "Conscious digital consumption"
    ],
    "relatedConcepts": [
        "mindfulness",
        "digital-minimalism",
        "attention",
        "information-diet",
        "urge-surfing",
        "deep-work"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Digital Minimalism by Cal Newport",
            "url": "https://amzn.to/3ZpQNpo",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
