{
    "id": "disruptive-innovation",
    "name": "Disruptive Innovation",
    "summary": "Innovation that creates new markets by offering simpler, cheaper alternatives to existing solutions.",
    "explanation": "Disruptive innovation, coined by Clayton Christensen, describes how simpler, cheaper, more accessible products or services can eventually displace established market leaders. Disruption typically starts in overlooked market segments - serving customers who couldn't afford or access existing solutions, or those overserved by complex products. Initially, disruptors underperform on traditional metrics but excel on accessibility, convenience, or cost. Incumbents often ignore them, focusing on their most profitable customers. Over time, disruptors improve and move upmarket, eventually threatening the incumbent's core business. Classic examples include: digital photography disrupting Kodak, Netflix disrupting Blockbuster, and online education disrupting traditional universities. Importantly, not all innovation is disruptive - sustaining innovations improve existing products for existing customers. For knowledge workers, understanding disruptive innovation helps: recognize threats and opportunities, evaluate new technologies, and understand why market leaders fail.",
    "tags": [
        "innovations",
        "strategies",
        "businesses",
        "technologies",
        "changes"
    ],
    "category": "Concepts",
    "icon": "FaRocket",
    "featured": false,
    "aliases": [
        "Disruption",
        "Christensen disruption",
        "Market disruption"
    ],
    "relatedConcepts": [
        "innovators-dilemma",
        "sustaining-innovation",
        "creative-destruction",
        "crossing-the-chasm"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Innovator's Dilemma by Clayton Christensen",
            "url": "https://amzn.to/3Dp09NT"
        }
    ],
    "references": [
        {
            "title": "Disruptive innovation - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Disruptive_innovation",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
