{
    "id": "distress",
    "name": "Distress",
    "summary": "Negative stress that overwhelms coping ability and harms wellbeing and performance.",
    "explanation": "Distress is negative stress that exceeds our coping abilities, causing anxiety, decreased performance, and potential health problems. Unlike eustress (positive stress), distress feels threatening and uncontrollable. It can be acute (intense but short-term, like a crisis) or chronic (persistent, like ongoing job strain). Distress triggers the fight-or-flight response in ways that, when prolonged, damage health: elevated cortisol impairs immune function, cardiovascular strain increases, and cognitive function suffers. Signs include: feeling overwhelmed, difficulty concentrating, irritability, physical symptoms (headaches, muscle tension), and sleep problems. Managing distress involves: addressing root causes where possible, building coping resources, practicing stress management techniques, and knowing when to seek help. For knowledge workers, chronic distress often comes from overwork, unclear expectations, lack of control, or insufficient recovery.",
    "tags": [
        "stresses",
        "psychology",
        "health",
        "well-being",
        "mental-health"
    ],
    "category": "Concepts",
    "icon": "FaExclamationTriangle",
    "featured": false,
    "aliases": [
        "Negative stress",
        "Bad stress",
        "Harmful stress"
    ],
    "relatedConcepts": [
        "eustress",
        "burnout",
        "anxiety",
        "chronic-stress",
        "allostatic-load",
        "stress-response"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Distress (medicine) - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Distress_(medicine)",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
