{
    "id": "do-what-you-said",
    "name": "Do What You Said You Would Do",
    "summary": "A principle of integrity and reliability - honor your commitments by following through on what you promised.",
    "explanation": "Do What You Said You Would Do (sometimes abbreviated as DWYSYWD) is a fundamental principle of personal integrity and professional reliability. At its core, it's simple: when you make a commitment, follow through.\n\n**Why this matters:**\n\n1. **Trust**: Reliability builds trust. People learn they can count on you.\n\n2. **Reputation**: Your track record of keeping commitments defines how others perceive you.\n\n3. **Self-respect**: Honoring commitments to yourself builds self-confidence and self-trust.\n\n4. **Simplicity**: When you only commit to what you'll actually do, life becomes less complicated.\n\n**Practical implications:**\n\n- **Be careful with commitments**: Don't say 'yes' lightly. Under-promise and over-deliver.\n\n- **Track your promises**: Write down what you've committed to so nothing falls through the cracks.\n\n- **Communicate early**: If circumstances change and you can't deliver, communicate immediately rather than silently failing.\n\n- **Apply to yourself**: Treat promises to yourself with the same weight as promises to others.\n\nThis principle connects deeply to productivity systems - a reliable task management system is essentially infrastructure for doing what you said you would do.",
    "tags": ["principles", "integrity", "reliability", "productivity", "trust"],
    "category": "Principles",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": ["DWYSYWD", "Honor Your Commitments", "Keep Your Word"],
    "relatedConcepts": ["personal-manifesto", "self-discipline", "consistency", "gtd"],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.01+Dots/2025/09/Wisdom+-+Principle/Do+what+you+said+you+would+do+(Dot)"
    ],
    "articles": [],
    "references": [],
    "tutorials": []
}
