{
    "id": "editing",
    "name": "Editing",
    "summary": "Refining writing at the sentence and word level for clarity, precision, and style.",
    "explanation": "Editing is the writing stage focused on refining prose at the sentence and word level - improving clarity, precision, flow, and style. It's different from revision (which addresses structure and ideas) and proofreading (which catches errors). Editing concerns: word choice (the right word, not almost-right), sentence structure (varied and effective), clarity (saying exactly what you mean), conciseness (no unnecessary words), and flow (sentences connect smoothly). Key editing principles: every word should earn its place, prefer simple over complex, active over passive (usually), concrete over abstract, and specific over vague. Editing techniques: read aloud (hear awkward constructions), read slowly (catch issues speed-reading misses), edit in passes (focus on one thing at a time), and use tools (grammar checkers, readability scores) as aids. Common fixes: eliminate filler words, strengthen verbs, break up long sentences, and cut redundancy. The editing mindset: be ruthless - 'kill your darlings' means removing even good phrases that don't serve the piece. For knowledge workers, strong editing skills transform rough drafts into clear, professional communication that achieves its purpose with readers.",
    "tags": [
        "writing",
        "communication",
        "process",
        "clarity",
        "craft"
    ],
    "category": "Techniques",
    "icon": "FaEdit",
    "featured": false,
    "aliases": [
        "Line editing",
        "Copy editing",
        "Polish"
    ],
    "relatedConcepts": [
        "writing-process",
        "revision",
        "clarity-writing",
        "conciseness",
        "drafting",
        "proofreading"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "On Writing Well by William Zinsser",
            "url": "https://amzn.to/3Dp09NT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
