{
    "id": "emotional-granularity",
    "name": "Emotional Granularity",
    "summary": "The ability to make fine-grained distinctions between similar emotions, using precise emotional vocabulary.",
    "explanation": "Emotional granularity (also called emotional differentiation) is the ability to distinguish between similar emotional states with precision. Instead of just feeling 'bad,' a person with high emotional granularity can identify whether they're feeling disappointed, frustrated, anxious, or lonely. This matters because different emotions signal different needs and call for different responses. Research shows that people with higher emotional granularity are better at regulating their emotions, less likely to use maladaptive coping strategies, and more resilient to stress. Building emotional granularity involves expanding your emotional vocabulary, practicing naming emotions precisely (especially during journaling), noticing subtle differences in how emotions feel in the body, and reflecting on what situations trigger specific emotions. This skill supports better decision-making and more effective communication about needs.",
    "tags": [
        "psychology",
        "emotions",
        "mental-health",
        "self-awareness",
        "emotional-intelligence"
    ],
    "category": "Concepts",
    "icon": "FaPalette",
    "featured": false,
    "aliases": [
        "Emotional differentiation",
        "Emotion differentiation",
        "Emotional vocabulary"
    ],
    "relatedConcepts": [
        "emotional-intelligence",
        "emotional-regulation",
        "journaling",
        "mindfulness",
        "metacognition"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "How Emotions Are Made by Lisa Feldman Barrett",
            "url": "https://amzn.to/3P1XxD8"
        }
    ],
    "references": [
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/l/knowii-journaling-deep-dive",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
