{
    "id": "empty-cup",
    "name": "Empty Cup",
    "summary": "The Zen parable teaching that openness requires releasing preconceptions.",
    "explanation": "The empty cup is a Zen parable about a scholar visiting a master. As the master pours tea, he continues pouring after the cup overflows. When the scholar protests, the master explains: like this cup, you are full of your own opinions. To receive new knowledge, you must first empty your cup. The teaching involves: releasing preconceptions to learn, approaching with beginner's mind, and recognizing when existing knowledge blocks new understanding. The empty cup teaches: expertise can become barrier, certainty closes doors, and humility enables learning. Applications include: entering new domains with openness, receiving feedback without defensiveness, and approaching problems without predetermined solutions. The empty cup isn't about having no knowledge but about: not letting knowledge block new understanding, remaining open despite expertise, and knowing when to suspend judgment. For knowledge workers, the empty cup suggests: approaching new information with openness, recognizing when expertise creates blind spots, and maintaining learning orientation despite accumulated knowledge.",
    "tags": [
        "philosophies",
        "zen",
        "wisdom",
        "learning",
        "humility"
    ],
    "category": "Concepts",
    "icon": "FaCoffee",
    "featured": false,
    "aliases": [
        "Empty your cup",
        "Zen tea cup",
        "Beginner's mind parable"
    ],
    "relatedConcepts": [
        "beginners-mind",
        "learning-curve"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/l/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/l/knowledge-management-for-beginners",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
