{
    "id": "equanimity",
    "name": "Equanimity",
    "summary": "Mental calmness and composure, especially in difficult situations - being with what is without reactivity.",
    "explanation": "Equanimity is a mental state of stability and composure that isn't disturbed by experience, whether pleasant or unpleasant. It's not indifference or apathy, but a balanced awareness that can hold all experiences without being thrown off center. In Buddhist psychology, equanimity (upekkha) is considered the highest of the four brahmaviharas (divine abodes). Key qualities include: non-reactivity to pleasant and unpleasant sensations, acceptance of what cannot be changed, reduced craving for pleasure and aversion to pain, and stable presence amid chaos. Equanimity develops through practice - facing difficulties without running, enjoying pleasures without grasping. For knowledge workers, equanimity provides: resilience in setbacks, clear thinking under pressure, freedom from emotional hijacking, and sustainable high performance. It's the foundation for wise action rather than reactive response.",
    "tags": [
        "mindfulness",
        "emotional-regulation",
        "buddhism",
        "well-being",
        "resilience"
    ],
    "category": "Concepts",
    "icon": "FaBalanceScale",
    "featured": false,
    "aliases": [
        "Upekkha",
        "Emotional balance",
        "Composure"
    ],
    "relatedConcepts": [
        "mindfulness",
        "non-attachment",
        "stoicism",
        "emotional-regulation",
        "resilience",
        "radical-acceptance"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Equanimity - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Equanimity",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
