{
    "id": "escalation-of-commitment",
    "name": "Escalation of Commitment",
    "summary": "The tendency to continue investing in a decision or course of action despite evidence that it's failing, due to prior investment of time, money, or effort.",
    "explanation": "Escalation of Commitment is a behavioral pattern where individuals or groups continue to invest resources (time, money, effort) into a failing course of action, often increasing their commitment rather than cutting their losses. This phenomenon was extensively studied by organizational behavior researcher Barry Staw, who published his seminal paper 'Knee-Deep in the Big Muddy: A Study of Escalating Commitment to a Chosen Course of Action' in 1976.\n\nSeveral psychological drivers fuel this irrational behavior. Self-justification is primary: people feel compelled to prove their original decision was correct and avoid admitting error. Loss aversion makes the prospect of acknowledging a loss more painful than continuing to invest. Cognitive dissonance creates discomfort when new evidence contradicts the original decision, often resolved by dismissing negative feedback rather than changing course. Additionally, there's reputational concern, as abandoning a project may be seen as personal failure.\n\nThe phenomenon is famously illustrated by the 'Concorde Fallacy' (also called sunk cost fallacy in this context). The British and French governments continued funding the Concorde supersonic jet long after it became clear the project would never be economically viable, partly because of the enormous investments already made and national prestige at stake.\n\nOther real-world examples include: companies continuing to pour money into failing products rather than pivoting, gamblers chasing losses by betting more, individuals staying in unfulfilling careers because of years invested, and military campaigns that persist despite mounting costs and diminishing prospects of success (the Vietnam War being Staw's original inspiration).\n\nStrategies to avoid escalation of commitment include: setting clear decision criteria and exit points in advance (pre-commitment), separating initial decision-makers from continuation decisions, establishing regular review checkpoints, creating psychological safety for admitting mistakes, focusing on future costs and benefits rather than past investments, and seeking external perspectives from those without emotional investment in the decision.",
    "tags": [
        "cognitive-biases",
        "decision-making",
        "psychology",
        "investments",
        "behaviors",
        "critical-thinking"
    ],
    "category": "Principles",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Commitment Bias",
        "Irrational Escalation",
        "Sunk Cost Trap"
    ],
    "relatedConcepts": [
        "sunk-cost-fallacy",
        "loss-aversion",
        "cognitive-dissonance",
        "commitment-and-consistency",
        "pre-commitment"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Thinking, Fast and Slow by Daniel Kahneman",
            "url": "https://www.amazon.com/dp/0374533555?tag=dsebastien00-20"
        },
        {
            "title": "Mistakes Were Made (But Not by Me) by Carol Tavris and Elliot Aronson",
            "url": "https://www.amazon.com/dp/0544574788?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Escalation of commitment - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Escalation_of_commitment",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-30",
    "dateModified": "2025-12-30"
}
