{
    "id": "examined-life",
    "name": "Examined Life",
    "summary": "Socrates' teaching that a life worth living requires continual self-reflection and questioning.",
    "explanation": "The Examined Life is Socrates' teaching that 'the unexamined life is not worth living' - that human flourishing requires continual self-reflection, questioning, and pursuit of truth. The concept involves: questioning one's beliefs and assumptions, reflecting on how one lives, seeking understanding rather than accepting received wisdom, and pursuing virtue through knowledge. Socrates practiced this through: dialogues that exposed hidden assumptions, persistent questioning until truth emerged, and applying the same rigor to himself. The examined life contrasts with: living by unexamined convention, pursuing comfort over truth, and avoiding difficult questions. Examination includes: one's values (what do I truly believe?), actions (do I live according to my values?), and assumptions (why do I believe what I believe?). The goal isn't endless self-doubt but: clarity about what matters, alignment of life with values, and genuine wisdom. For knowledge workers, the examined life suggests: regular reflection on career and life direction, questioning assumptions in work and thinking, and pursuing authentic rather than conventional success.",
    "tags": [
        "philosophies",
        "wisdom",
        "reflection",
        "socrates",
        "self-knowledge"
    ],
    "category": "Concepts",
    "icon": "FaMicroscope",
    "featured": false,
    "aliases": [
        "Self-examination",
        "Reflective life",
        "Socratic examination"
    ],
    "relatedConcepts": [
        "know-thyself",
        "reflective-thinking",
        "wisdom-of-crowds"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
