{
    "id": "experience-stretching",
    "name": "Experience Stretching",
    "summary": "Extending the happiness from positive experiences through anticipation, savoring, and reminiscence.",
    "explanation": "Experience stretching is the practice of maximizing happiness from positive experiences by extending them beyond their actual duration. This involves three phases: anticipation (enjoying the lead-up), savoring (fully experiencing the moment), and reminiscence (reliving through memory). Techniques include: planning experiences well in advance, creating rituals around anticipation, fully engaging senses during experiences, capturing memories (photos, journaling), and regularly revisiting positive memories. Experience stretching counters two tendencies: rushing through experiences without attention, and forgetting positives while remembering negatives. Research shows deliberate memory creation and revisiting significantly increases happiness derived from experiences. For knowledge workers, experience stretching means: not just having good experiences but fully extracting their value, treating memory as an asset worth investing in, and recognizing that a single experience can provide happiness multiple times.",
    "tags": [
        "happiness",
        "experiences",
        "memories",
        "savoring",
        "anticipation"
    ],
    "category": "Techniques",
    "icon": "FaExpandArrowsAlt",
    "featured": false,
    "aliases": [
        "Extending experiences",
        "Maximizing experiences",
        "Experience amplification"
    ],
    "relatedConcepts": [
        "savoring",
        "anticipation-happiness",
        "reminiscence",
        "memories",
        "experience-over-things",
        "gratitude"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
