{
    "id": "expressing-gratitude",
    "name": "Expressing Gratitude",
    "summary": "Communicating appreciation to others through words, actions, or gestures.",
    "explanation": "Expressing gratitude is the practice of communicating appreciation to others through words, actions, or gestures. While internal gratitude has benefits, expressed gratitude adds relationship-strengthening effects for both expresser and recipient. Expression methods include: verbal thanks, written notes, gifts, reciprocal actions, and public recognition. Effective expression involves: specificity (noting exactly what you appreciate), timeliness (expressing soon after the appreciated action), and sincerity (genuine rather than obligatory feeling). Research shows that people underestimate how much their expressions mean to recipients - we often hold back when sharing would be welcomed. Expression benefits include: strengthening relationships, encouraging continued positive behavior, and creating positive interaction cycles. Barriers include: awkwardness (expressing feels vulnerable), assumptions (believing people know they're appreciated), and cultural norms (some contexts discourage open appreciation). For knowledge workers, expressing gratitude means: thanking colleagues specifically, acknowledging help received, and creating cultures where appreciation is regularly voiced.",
    "tags": [
        "gratitude",
        "communications",
        "relationships",
        "expression",
        "workplace"
    ],
    "category": "Techniques",
    "icon": "FaComment",
    "featured": false,
    "aliases": [
        "Showing appreciation",
        "Voicing thanks",
        "Gratitude expression"
    ],
    "relatedConcepts": [
        "gratitude-practice",
        "gratitude-letters",
        "thank-you-notes",
        "communications",
        "relationships",
        "recognition"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
