{
    "id": "failure-resume",
    "name": "Failure Resume",
    "summary": "A document listing one's failures, rejections, and setbacks alongside lessons learned.",
    "explanation": "A failure resume (or CV of failures) is a document listing one's failures, rejections, and setbacks alongside lessons learned. The concept was popularized by Johannes Haushofer's viral 'CV of Failures.' The practice counters: survivorship bias (we only see others' successes), imposter syndrome (believing others haven't failed), and fear of failure (normalizing setbacks). Elements typically include: rejected applications, failed projects, abandoned ventures, and significant mistakes. The practice benefits: the creator (processing failures, seeing patterns), others (normalizing failure, inspiring persistence), and culture (countering success-only narratives). Creating a failure resume involves: documenting significant failures, extracting lessons from each, and being willing to share vulnerability. The practice can be kept private (personal reflection) or public (cultural contribution). Some criticize the practice as potentially performative or humble-bragging. Authentic failure resumes focus on: genuine failures (not near-misses or strategic pivots), real lessons (not just listing), and appropriate vulnerability. For knowledge workers, failure resumes help: process rejection, maintain perspective, and connect with others through shared experience.",
    "tags": [
        "failures",
        "reflection",
        "careers",
        "vulnerability",
        "personal-development"
    ],
    "category": "Techniques",
    "icon": "FaFileAlt",
    "featured": false,
    "aliases": [
        "CV of failures",
        "Failure CV",
        "Rejection resume"
    ],
    "relatedConcepts": [
        "learning-from-failure",
        "failure-stories",
        "resilience",
        "reflective-thinking"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
