{
    "id": "failure-patterns",
    "name": "Failure Patterns",
    "summary": "Recurring types of failures that share common characteristics and causes.",
    "explanation": "Failure patterns are recurring types of failures that share common characteristics, causes, and potential solutions. Recognizing patterns enables: prediction (anticipating likely failure modes), prevention (addressing common causes), and faster recovery (having practiced solutions). Common failure patterns include: overconfidence failures (underestimating complexity), coordination failures (breakdowns between parties), scaling failures (what worked small fails large), and attention failures (missing important information). Pattern recognition requires: documenting failures systematically, analyzing across cases, and identifying common elements. Organizations can build: failure pattern libraries, pattern-aware checklists, and pattern-based training. Individual patterns often reflect: recurring blind spots, skill gaps, or environmental factors. Identifying personal failure patterns enables: targeted improvement, appropriate caution, and self-awareness. The anti-pattern is treating each failure as unique without recognizing recurrence. For knowledge workers, understanding failure patterns means: tracking your own recurring failures, learning from others' documented patterns, and proactively addressing identified patterns before they cause failure.",
    "tags": [
        "failures",
        "patterns",
        "learning",
        "prevention",
        "analysis"
    ],
    "category": "Concepts",
    "icon": "FaProjectDiagram",
    "featured": false,
    "aliases": [
        "Common failures",
        "Recurring failures",
        "Failure modes"
    ],
    "relatedConcepts": [
        "failure-analysis",
        "learning-from-failure",
        "pattern-recognition",
        "prevention",
        "systems-thinking",
        "anti-patterns"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
