{
    "id": "failure-tolerance",
    "name": "Failure Tolerance",
    "summary": "The capacity to accept and learn from failures without excessive negative response.",
    "explanation": "Failure tolerance is the capacity - individual or organizational - to accept and learn from failures without excessive negative emotional, behavioral, or systemic responses. High failure tolerance enables: experimentation, risk-taking, honest feedback, and continuous learning. Low failure tolerance creates: fear-based conservatism, blame cultures, hidden problems, and stagnation. Individual failure tolerance involves: emotional resilience, identity separation from performance, and learning orientation. Organizational failure tolerance involves: psychological safety, blameless cultures, and appropriate failure response policies. Building failure tolerance requires: exposure to manageable failures, developing recovery practices, and separating failure types (tolerating intelligent failures while preventing preventable ones). Context matters - some domains require low failure tolerance (surgery, aviation) while others benefit from high tolerance (innovation, learning). For knowledge workers, building failure tolerance means: gradually expanding comfort with risk, developing reliable recovery practices, and cultivating environments where appropriate failures are accepted as learning opportunities.",
    "tags": [
        "failures",
        "resilience",
        "cultures",
        "psychology",
        "innovations"
    ],
    "category": "Concepts",
    "icon": "FaShieldAlt",
    "featured": false,
    "aliases": [
        "Tolerance for failure",
        "Failure acceptance capacity",
        "Risk tolerance"
    ],
    "relatedConcepts": [
        "psychological-safety",
        "resilience",
        "failure-acceptance",
        "blameless-culture",
        "experimentation",
        "learning-culture"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
