{
    "id": "failure-as-data",
    "name": "Failure as Data",
    "summary": "Treating each failure as an information point that refines understanding and strategy.",
    "explanation": "Failure as data is a mindset that treats each failure as an information point that refines understanding, strategy, and prediction rather than an endpoint or judgment. This perspective: removes emotional charge from failure, enables systematic learning, and maintains forward momentum. Like a scientist whose failed experiment still generates useful data, failure-as-data practitioners: document what happened, analyze contributing factors, update models of how things work, and adjust approaches accordingly. The mindset requires: sufficient emotional distance to analyze objectively, systematic documentation practices, and commitment to using data for improvement. This differs from: failure denial (pretending it didn't happen), failure rumination (emotional processing without learning), and failure normalization (accepting failure without analyzing). The approach is particularly valuable in: complex environments with uncertain outcomes, iterative processes, and experimental work. For knowledge workers, adopting failure-as-data means: documenting failures systematically, treating setbacks as experiments that generated results, and using accumulated failure data to inform better future decisions.",
    "tags": [
        "failures",
        "data",
        "learning",
        "mindsets",
        "analysis"
    ],
    "category": "Concepts",
    "icon": "FaDatabase",
    "featured": false,
    "aliases": [
        "Failure information",
        "Data-driven failure",
        "Analytical failure approach"
    ],
    "relatedConcepts": [
        "failure-as-feedback",
        "learning-from-failure",
        "iterative-note-taking"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/l/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/l/knowledge-management-for-beginners",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
