{
    "id": "failure-recovery",
    "name": "Failure Recovery",
    "summary": "The process of bouncing back from failures while maintaining confidence and momentum.",
    "explanation": "Failure recovery is the process of bouncing back from failures, setbacks, and disappointments while maintaining confidence, motivation, and momentum. Recovery involves: emotional processing (allowing but not wallowing in disappointment), cognitive reframing (finding meaning and lessons), and behavioral re-engagement (taking action despite setback). Key recovery practices include: self-compassion (treating yourself kindly), perspective-taking (recognizing failures in context of larger journey), support-seeking (connecting with others who understand), and action-taking (doing something rather than ruminating). Recovery timeframes vary based on: failure magnitude, personal resilience, available support, and past failure experience. Warning signs of poor recovery include: extended rumination, global negative self-judgments, avoidance of similar challenges, and prolonged disengagement. Building recovery capacity involves: practicing with small failures, developing reliable recovery routines, and building support networks. For knowledge workers, failure recovery means: having predictable practices for processing setbacks, maintaining motivation despite rejection, and returning to productive action relatively quickly after failures.",
    "tags": [
        "failures",
        "recovery",
        "resilience",
        "psychology",
        "well-being"
    ],
    "category": "Concepts",
    "icon": "FaRedo",
    "featured": false,
    "aliases": [
        "Bouncing back",
        "Recovery from failure",
        "Failure resilience"
    ],
    "relatedConcepts": [
        "resilience",
        "failure-acceptance",
        "self-compassion",
        "emotional-regulation",
        "persistence"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
