{
    "id": "favor-economy",
    "name": "Favor Economy",
    "summary": "The informal system of exchanging favors and assistance that underlies professional networks.",
    "explanation": "The favor economy is the informal system of exchanging favors, assistance, and support that underlies professional and social networks. Unlike formal economies with explicit prices, favor economies operate through: implicit obligations, social capital accumulation, and network-based exchange. Success in the favor economy requires: building credit (doing favors), maintaining reputation (being reliable), and network positioning (knowing people who can help). The economy functions because: people prefer helping those who helped them, reputation information spreads, and being known as helpful creates opportunities. Key dynamics include: favor banking (accumulating credits), favor calling (asking for help), and favor matching (reciprocal relationships). Effective participation means: being generous without keeping explicit score, asking for help appropriately, and being a connector (introducing people who can help each other). Risks include: over-extraction (damaging reputation), under-utilization (not asking for help), and transactional mindset (treating relationships as transactions). For knowledge workers, the favor economy means: contributing to communities, asking for help when needed, and building genuine relationships rather than extracting maximum value.",
    "tags": [
        "reciprocity",
        "networking",
        "relationships",
        "social-capital",
        "careers"
    ],
    "category": "Concepts",
    "icon": "FaHandHoldingHeart",
    "featured": false,
    "aliases": [
        "Favor bank",
        "Help economy",
        "Social credit system"
    ],
    "relatedConcepts": [
        "reciprocity-principle",
        "networking",
        "social-capital",
        "relationships",
        "reputation",
        "give-and-take"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
