{
    "id": "fear-of-failure",
    "name": "Fear of Failure",
    "summary": "The emotional response that prevents risk-taking due to concern about negative outcomes.",
    "explanation": "Fear of failure is the emotional response that prevents risk-taking and action due to concern about negative outcomes, judgment, or loss. The fear manifests as: procrastination, perfectionism, excessive preparation, avoiding challenges, and self-sabotage. Underlying sources include: identity threat (failure means 'I am a failure'), social judgment (what will others think), loss aversion (losing feels worse than equivalent gain), and trauma (past failures created lasting fear). The fear is adaptive in some contexts (avoiding truly dangerous risks) but maladaptive when it prevents: learning opportunities, meaningful challenges, and necessary growth experiences. Managing fear of failure involves: separating performance from identity, exposing yourself gradually to failure, reframing failure as learning, and building failure recovery practices. Organizations can address fear through: psychological safety, celebrating learning from failure, and leaders sharing their own failures. For knowledge workers, managing fear of failure means: recognizing when fear is holding you back, taking calculated risks despite discomfort, and building personal resilience through small failure experiences.",
    "tags": [
        "failure",
        "fear",
        "psychology",
        "risk",
        "self-limiting-beliefs"
    ],
    "category": "Concepts",
    "icon": "FaExclamationTriangle",
    "featured": true,
    "aliases": [
        "Atychiphobia",
        "Failure anxiety",
        "Risk aversion"
    ],
    "relatedConcepts": [
        "failure-mindset",
        "risk-taking",
        "perfectionism",
        "procrastination",
        "psychological-safety",
        "self-efficacy"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
