{
    "id": "feast-or-famine-cycle",
    "name": "Feast or Famine Cycle",
    "summary": "The boom-bust pattern in freelance and creative work where income and workload oscillate between abundance and scarcity.",
    "explanation": "The feast or famine cycle is a recurring pattern experienced by freelancers, consultants, and creative professionals where work and income alternate between periods of overwhelming abundance (feast) and concerning scarcity (famine). During feast periods, you have more work than you can handle, working long hours with no time for business development or rest. During famine periods, work dries up and you scramble to find new clients, often with financial stress. The cycle is self-perpetuating: when busy, you can't prospect for new work; when work finishes, you have no pipeline. Breaking the cycle requires: consistent marketing regardless of current workload, maintaining a sales pipeline even when busy, setting boundaries during feast times to preserve energy for business development, building financial reserves during feast periods to weather famine, and potentially raising rates to work less while earning the same. Some professionals learn to embrace the cycle by planning for downtime as creative recovery and business development periods. Understanding this cycle helps you: recognize the pattern before it controls you, implement systems to smooth out the peaks and valleys, and maintain perspective during both extremes.",
    "tags": [
        "freelancing",
        "businesses",
        "productivity",
        "finances",
        "cycles",
        "work-life-balance"
    ],
    "category": "Business & Economics",
    "icon": "FaChartLine",
    "featured": false,
    "aliases": [
        "Boom-bust cycle",
        "Freelance feast famine",
        "Workload oscillation"
    ],
    "relatedConcepts": [
        "work-cycles",
        "binge-working",
        "burnout",
        "time-poverty",
        "types-of-rest",
        "sustainable-success",
        "creative-resistance"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2026-01-03",
    "dateModified": "2026-01-03"
}
