{
    "id": "fresh-start-effect",
    "name": "Fresh Start Effect",
    "summary": "The increased motivation to pursue goals following temporal landmarks that mark new beginnings.",
    "explanation": "The fresh start effect, researched by Katy Milkman and colleagues, describes increased goal pursuit motivation following temporal landmarks - new year, birthdays, Mondays, or any date that feels like a new beginning. The effect occurs because landmarks: create psychological separation from past failures (that was 'old me'), open new mental accounting periods, and trigger reflection about goals. Gym attendance spikes after New Year's, first of month, and even after birthdays. The fresh start effect is leveraged by: timing behavior changes to landmarks, framing current moments as fresh starts, and using setbacks as opportunities for new beginnings (Monday after a bad week). The effect decays over time, so combining it with habit-building is important. For knowledge workers, the fresh start effect offers: strategic timing for new initiatives, recovery mechanism after failures (next quarter is fresh start), and understanding why resolution timing matters for success likelihood.",
    "tags": [
        "time",
        "motivation",
        "behavior-change",
        "psychology",
        "goals"
    ],
    "category": "Concepts",
    "icon": "FaPlay",
    "featured": false,
    "aliases": [
        "Fresh starts",
        "New beginning effect",
        "Clean slate effect"
    ],
    "relatedConcepts": [
        "temporal-landmarks",
        "motivation",
        "habit-formation",
        "goal-setting",
        "self-renewal",
        "behavior-change"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "How to Change by Katy Milkman",
            "url": "https://amzn.to/3Dp08MT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
