{
    "id": "gamification",
    "name": "Gamification",
    "summary": "Using game elements like points, badges, and competition to increase engagement in non-game contexts.",
    "explanation": "Gamification applies game design elements to non-game contexts to increase motivation, engagement, and desired behaviors. Common elements include: points, badges, leaderboards, progress bars, levels, challenges, rewards, and narratives. Gamification leverages psychological principles like: variable rewards, achievement recognition, competition, and progress visualization. When effective, it can increase engagement, motivation, and learning. However, poorly designed gamification can backfire - extrinsic rewards can undermine intrinsic motivation, and superficial point systems feel manipulative. Effective gamification: aligns with genuine goals, provides meaningful feedback, allows autonomy, creates mastery opportunities, and doesn't replace inherent value with artificial rewards. For knowledge workers, gamification principles can be self-applied through: streak tracking, personal challenges, progress visualization, and reward systems for difficult tasks.",
    "tags": [
        "education",
        "motivations",
        "engagement",
        "designs",
        "productivity"
    ],
    "category": "Techniques",
    "icon": "FaGamepad",
    "featured": false,
    "aliases": [
        "Game-based motivation",
        "Game mechanics"
    ],
    "relatedConcepts": [
        "intrinsic-motivation",
        "extrinsic-motivation",
        "habit-loop",
        "progress-principle",
        "streak-tracking",
        "variable-rewards"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
