{
    "id": "give-and-take",
    "name": "Give and Take",
    "summary": "Adam Grant's framework describing three reciprocity styles: givers, takers, and matchers.",
    "explanation": "Give and Take is Adam Grant's framework describing three fundamental reciprocity styles that shape how people interact in professional and personal settings. Givers contribute without keeping score, prioritizing others' interests. Takers try to get as much as possible while giving as little as necessary. Matchers aim for balanced, tit-for-tat exchanges. Grant's research reveals surprising findings: givers occupy both the bottom AND top of success metrics. Failed givers burn out through selfless giving without boundaries. Successful givers practice 'otherish' giving - generous but strategic, helping others while protecting their own interests. Key strategies for successful giving include: being generous with time for high-impact activities, setting boundaries, and being selective about who to help. The framework suggests that giving creates success through expanded networks, reputation building, and collaborative opportunities. For knowledge workers, applying give-and-take means: cultivating a giving mindset with healthy boundaries, avoiding takers, and seeking win-win opportunities that create value for all.",
    "tags": [
        "reciprocity",
        "successes",
        "networking",
        "generosity",
        "careers"
    ],
    "category": "Frameworks",
    "icon": "FaHandsHelping",
    "featured": true,
    "aliases": [
        "Giver-taker-matcher",
        "Reciprocity styles",
        "Giving framework"
    ],
    "relatedConcepts": [
        "generosity-principle",
        "giving-first",
        "networking",
        "successes",
        "boundaries",
        "relationships"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Give and Take by Adam Grant",
            "url": "https://amzn.to/3Dp09NT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
