{
    "id": "giving-first",
    "name": "Giving First",
    "summary": "The practice of providing value to others before expecting anything in return.",
    "explanation": "Giving first is the practice of providing value to others before expecting or asking for anything in return. Rather than transactional thinking ('I'll help if you help me'), giving first operates from abundance mindset and genuine desire to contribute. The approach builds: trust (demonstrating good faith), reciprocity (triggering natural return instincts), and reputation (being known as generous). Giving first works because: it differentiates you from takers, creates relationship capital, and often returns more than was given. The practice requires: identifying what you can offer (knowledge, connections, time), giving without attachment to outcome, and trusting that value returns over time. Potential pitfalls include: giving to manipulate (transparent and ineffective), giving past your capacity (burnout), and giving to the wrong people (exploited by takers). Effective giving first involves: being genuinely helpful, choosing recipients wisely, and maintaining sustainable giving practices. For knowledge workers, giving first means: sharing knowledge freely, making introductions generously, and contributing to communities before extracting value.",
    "tags": [
        "reciprocity",
        "generosity",
        "networking",
        "relationships",
        "abundance"
    ],
    "category": "Principles",
    "icon": "FaGift",
    "featured": false,
    "aliases": [
        "Lead with value",
        "Give before you get",
        "Value-first approach"
    ],
    "relatedConcepts": [
        "give-and-take",
        "generosity-principle",
        "networked-thought",
        "reciprocity-principle",
        "trust-building"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
