{
    "id": "good-pain-bad-pain",
    "name": "Good Pain vs Bad Pain",
    "summary": "Distinguishing between effort that leads to growth (good pain) and damage that harms you (bad pain).",
    "explanation": "Good Pain vs Bad Pain is about learning to distinguish between two types of discomfort in work and life. Good pain means effort - it's the discomfort that comes from growth, learning, and pushing yourself toward your goals. It's the struggle of building new skills, taking on challenges, or persisting through difficult but meaningful work. Bad pain means damage - it's the harm that comes from misalignment, toxic environments, or situations that drain rather than develop you. It includes burnout, moral injury from work that conflicts with your values, or staying in situations that actively harm your wellbeing. The key insight: it's not necessarily a bad sign if you're currently struggling at work. Acknowledge that good pain will most often make for a brighter future. But if the struggle comes from fundamental misalignment with your values, goals, or needs, that's bad pain - and you need to make changes. The distinction helps with career decisions: embrace good pain that leads to growth, but don't tolerate bad pain that causes lasting damage.",
    "tags": ["careers", "personal-growth", "decision-making", "well-being", "clarity"],
    "category": "Concepts",
    "icon": "FaHeartbeat",
    "featured": false,
    "aliases": ["Effort vs damage", "Growth pain vs harmful pain"],
    "relatedConcepts": [
        "career-alignment",
        "burnouts",
        "growth-mindset",
        "deliberate-practice",
        "desirable-difficulties",
        "career-design",
        "intrinsic-motivation"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        }
    ],
    "tutorials": []
}
