{
    "id": "gradually-then-suddenly",
    "name": "Gradually, Then Suddenly",
    "summary": "Major outcomes like success or failure accumulate gradually through small actions before appearing to happen all at once.",
    "explanation": "This principle originates from Ernest Hemingway's novel \"The Sun Also Rises,\" where a character is asked: \"How did you go bankrupt?\" The answer: \"Two ways. Gradually, then suddenly.\" This insight applies far beyond financial ruin—it describes how most significant changes in life unfold.\n\nBoth success and failure follow this pattern. Mistakes, procrastination, and poor decisions gradually compound over time until they suddenly manifest as failure. Conversely, consistent effort, good habits, and incremental progress accumulate until they suddenly appear as overnight success.\n\nThe media tends to focus on the \"suddenlies\"—the dramatic moments of breakthrough or collapse. But it's the \"graduallies\" that truly matter. The daily choices, the small wins, the persistent efforts that nobody sees are what determine the eventual outcome.\n\nExcellence requires consistent graduallies: endurance through difficulty, sustained effort when motivation wanes, and regular self-reflection to stay on course. Understanding this principle helps shift focus from seeking quick results to building sustainable practices. Every step counts, even when progress feels invisible. The sudden moment of success or failure is merely the visible culmination of countless invisible moments that preceded it.",
    "tags": ["success", "failure", "persistence", "compound-growth", "mindset"],
    "category": "Principles",
    "icon": "FaStream",
    "featured": false,
    "aliases": ["Gradually then suddenly", "The Hemingway Effect"],
    "relatedConcepts": [
        "compound-growth",
        "persistence",
        "small-wins",
        "progress-is-rarely-linear"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Gradually,+then+suddenly"
    ],
    "articles": [],
    "references": [
        {
            "title": "The Sun Also Rises - Ernest Hemingway",
            "url": "https://en.wikipedia.org/wiki/The_Sun_Also_Rises",
            "type": "book"
        }
    ],
    "tutorials": []
}
