{
    "id": "gratitude-mindset",
    "name": "Gratitude Mindset",
    "summary": "A habitual perspective that notices and appreciates the positive aspects of experiences.",
    "explanation": "Gratitude mindset is a habitual perspective and way of seeing that naturally notices and appreciates the positive aspects of experiences, relationships, and circumstances. Unlike occasional gratitude practice, a gratitude mindset becomes an automatic orientation toward appreciation. Developing this mindset involves: practicing gratitude until it becomes habitual, reframing challenges as opportunities, and cultivating awareness of everyday blessings. The mindset protects against: hedonic adaptation (taking good things for granted), negativity bias (over-focusing on problems), and entitlement (expecting rather than appreciating). People with gratitude mindsets: notice small positives automatically, feel appreciation without effort, and maintain perspective during difficulties. Building the mindset requires: consistent practice over time, intentional attention training, and environmental cues that trigger grateful thinking. The mindset differs from: toxic positivity (ignoring real problems), passive acceptance (not working to improve), and performance (expressing gratitude you don't feel). For knowledge workers, developing a gratitude mindset means: training yourself to notice positives automatically, maintaining appreciation for opportunities, and bringing grateful perspective to daily work.",
    "tags": [
        "gratitude",
        "mindset",
        "psychology",
        "perspective",
        "wellbeing"
    ],
    "category": "Concepts",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Grateful mindset",
        "Appreciative mindset",
        "Thankful perspective"
    ],
    "relatedConcepts": [
        "gratitude-practice",
        "positive-psychology",
        "mindset",
        "perspective-taking",
        "wellbeing",
        "happiness"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
