{
    "id": "gratitude-meditation",
    "name": "Gratitude Meditation",
    "summary": "Meditation practices focused on cultivating feelings of appreciation and thankfulness.",
    "explanation": "Gratitude meditation is a meditation practice focused on cultivating feelings of appreciation and thankfulness. Unlike gratitude journaling which uses writing, gratitude meditation uses focused attention and visualization to generate grateful emotions. Practice typically involves: settling into meditation posture, bringing to mind things to be grateful for, feeling the gratitude in the body, and extending appreciation broadly. Variations include: person-focused (appreciating specific individuals), experience-focused (savoring positive moments), and general appreciation (thankfulness for life itself). The practice offers: deeper emotional experience than cognitive listing, physical relaxation combined with positive emotion, and meditation skill development alongside gratitude cultivation. Gratitude meditation can be: guided (following instructions), structured (specific sequence), or free-form (open exploration). Regular practice builds: gratitude as automatic response, deeper appreciation capacity, and meditation skills. For knowledge workers, gratitude meditation provides: a calming practice with mood benefits, a way to process and appreciate experiences, and stress reduction combined with perspective enhancement.",
    "tags": [
        "gratitude",
        "meditation",
        "mindfulness",
        "well-being",
        "practices"
    ],
    "category": "Techniques",
    "icon": "FaOm",
    "featured": false,
    "aliases": [
        "Thankfulness meditation",
        "Appreciation meditation",
        "Grateful meditation"
    ],
    "relatedConcepts": [
        "gratitude-practice",
        "mindfulness",
        "loving-kindness-meditation",
        "positive-emotions"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
