{
    "id": "gratitude-rituals",
    "name": "Gratitude Rituals",
    "summary": "Recurring ceremonial practices that formally incorporate gratitude into life or work.",
    "explanation": "Gratitude rituals are recurring ceremonial practices that formally incorporate gratitude into individual, family, or organizational life. Unlike casual habits, rituals have: formal structure, symbolic meaning, and intentional performance. Examples include: mealtime gratitude (saying grace or sharing appreciations), meeting gratitude (beginning or ending meetings with thanks), holiday rituals (Thanksgiving practices), and milestone rituals (anniversary appreciations). Rituals work through: creating dedicated time for gratitude, adding social and symbolic dimensions, and building anticipation and memory. Organizational rituals might include: weekly gratitude rounds, project completion appreciations, and annual recognition ceremonies. Family rituals include: bedtime gratitude conversations, gratitude jars, and holiday traditions. Effective rituals are: consistent (predictable timing), meaningful (not empty form), and participatory (all contribute). The ritual structure elevates gratitude from private thought to shared practice. For knowledge workers, gratitude rituals can: create team culture around appreciation, mark important moments with thankfulness, and build consistent gratitude practice into professional life.",
    "tags": [
        "gratitude",
        "rituals",
        "culture",
        "practice",
        "traditions"
    ],
    "category": "Techniques",
    "icon": "FaCalendarCheck",
    "featured": false,
    "aliases": [
        "Thankfulness rituals",
        "Appreciation ceremonies",
        "Gratitude traditions"
    ],
    "relatedConcepts": [
        "gratitude-practice",
        "rituals",
        "traditions",
        "culture",
        "team-building",
        "family-practices"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
