{
    "id": "gratitude-exercises",
    "name": "Gratitude Exercises",
    "summary": "Structured activities designed to develop and strengthen gratitude capacity.",
    "explanation": "Gratitude exercises are structured activities designed to develop and strengthen gratitude capacity, ranging from brief daily practices to more intensive interventions. Research-supported exercises include: Three Good Things (listing three positive things daily with causes), Gratitude Letter (writing detailed thanks to someone), Mental Subtraction (imagining life without something valued), and Gratitude Meditation (focused appreciation practice). Less structured exercises include: gratitude walks (noticing things to appreciate while walking), gratitude photography (capturing images of things you're grateful for), and gratitude sharing (exchanging appreciations with others). Effective exercises: are specific rather than generic, involve genuine reflection rather than rote listing, and are practiced consistently. Variety helps maintain engagement - rotating between exercises prevents staleness. The exercises work by: training attention toward positives, building neural pathways for appreciation, and creating tangible practice of gratitude. For knowledge workers, gratitude exercises provide: concrete ways to build gratitude capacity, practices that can be integrated into busy schedules, and tools for managing stress and maintaining perspective.",
    "tags": [
        "gratitude",
        "exercises",
        "practices",
        "well-being",
        "interventions"
    ],
    "category": "Techniques",
    "icon": "FaDumbbell",
    "featured": false,
    "aliases": [
        "Gratitude activities",
        "Thankfulness exercises",
        "Appreciation practices"
    ],
    "relatedConcepts": [
        "gratitude-practice",
        "gratitude-prompts",
        "positive-psychology"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
