{
    "id": "grateful-living",
    "name": "Grateful Living",
    "summary": "A life approach where gratitude becomes a foundational orientation rather than occasional practice.",
    "explanation": "Grateful living is a life approach where gratitude becomes a foundational orientation and way of being rather than an occasional practice. Promoted by Brother David Steindl-Rast and organizations like Gratefulness.org, grateful living emphasizes: living from gratitude rather than adding gratitude practices, seeing life itself as gift, and orienting toward appreciation as a default. The approach involves: waking to gratitude, seeing opportunities in every moment, and responding to life with thankfulness. It differs from gratitude practices in: pervasiveness (all of life, not just practice times), depth (fundamental orientation, not technique), and integration (way of being, not thing you do). Elements include: appreciating ordinary moments, finding gift in difficulty, and expressing gratitude naturally. Challenges include: maintaining perspective during genuine hardship, avoiding Pollyanna positivity, and integrating with realistic assessment of problems. For knowledge workers, grateful living provides: fundamental perspective shift, sustainable wellbeing enhancement, and orientation that transforms relationship with work and life beyond specific practices.",
    "tags": [
        "gratitude",
        "philosophy",
        "wellbeing",
        "lifestyle",
        "spirituality"
    ],
    "category": "Concepts",
    "icon": "FaSun",
    "featured": false,
    "aliases": [
        "Living gratefully",
        "Gratitude lifestyle",
        "Thankful living"
    ],
    "relatedConcepts": [
        "gratitude-practice",
        "gratitude-mindset",
        "presence",
        "mindfulness",
        "philosophy-of-life",
        "wellbeing"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Gratefulness.org",
            "url": "https://gratefulness.org/",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
