{
    "id": "habits-define-identity",
    "name": "Habits Define Identity",
    "summary": "Your habits and routines are part of you - they shape your life and define who you are.",
    "explanation": "We humans are creatures of habits. We tend to keep doing the same things, following the same patterns. In a way, our habits and routines are part of us, but they also define who we are. They shape our lives and identities. Routines and habits can either make or break us - they can enslave us, or serve as enablers and catalysts. As the saying goes: 'At the end of the day, you are a combination of your habits and the people who you spend the most time with.' Self-awareness about your habits is key to personal growth. By being conscious of your habits, routines, and patterns, you can live a more intentional life - one that you design to serve your goals. It's not only about productivity and optimization. It's more profound: it's about alignment, health, and happiness. People do not decide their futures - they decide their habits, and their habits decide their futures. Systems and habits are what give you consistency to make long-term changes. The key areas to reflect on include: routines (morning, work, evening), health habits, self-care practices, harmful behaviors, stress management, things to start doing, and things to stop doing.",
    "tags": [
        "habits",
        "identities",
        "personal-growth",
        "self-awareness",
        "life-design"
    ],
    "category": "Principles",
    "icon": "FaRedo",
    "featured": false,
    "aliases": [
        "Habits shape identity",
        "You are your habits",
        "Routines define you"
    ],
    "relatedConcepts": [
        "habit-loop",
        "keystone-habits",
        "habit-stacking",
        "living-on-default",
        "life-design",
        "periodic-reviews",
        "self-discipline",
        "personal-manifesto"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Atomic Habits by James Clear",
            "url": "https://amzn.to/3VG1JfK"
        }
    ],
    "references": [
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-27",
    "dateModified": "2025-12-28"
}
