{
    "id": "hic-et-nunc",
    "name": "Hic et Nunc",
    "summary": "The Latin phrase meaning 'here and now' - emphasis on present moment awareness.",
    "explanation": "Hic et nunc (Latin for 'here and now') is a philosophical phrase emphasizing the importance of present moment awareness. The concept involves: recognizing that the present is the only reality we directly experience, releasing preoccupation with past and future, and engaging fully with current circumstances. The wisdom addresses: regret about the past (unchangeable), anxiety about future (uncertain), and the escape from present (missing life as it happens). Living hic et nunc means: attending to present experience, making decisions based on current reality, and finding meaning in immediate existence. The concept appears across philosophies: Stoic focus on what's in our control now, Buddhist emphasis on present awareness, and existentialist stress on authentic present engagement. It's not about ignoring past lessons or future planning but about: where attention primarily rests, what receives full engagement, and where meaning is found. For knowledge workers, hic et nunc suggests: being present with current work, not letting past failures or future anxieties dominate attention, and finding satisfaction in present engagement.",
    "tags": [
        "philosophy",
        "wisdom",
        "presence",
        "mindfulness",
        "time"
    ],
    "category": "Concepts",
    "icon": "FaMapMarkerAlt",
    "featured": false,
    "aliases": [
        "Here and now",
        "Present moment",
        "Now awareness"
    ],
    "relatedConcepts": [
        "presence",
        "mindfulness",
        "age-quod-agis",
        "present-moment",
        "awareness",
        "engagement"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
