{
    "id": "identifying-system-constraints",
    "name": "Identifying System Constraints",
    "summary": "Practical techniques for discovering bottlenecks and limiting factors in any system, enabling targeted improvements where they matter most.",
    "explanation": "Identifying constraints is a crucial skill in systems thinking. A constraint (or bottleneck) is the factor that limits the overall throughput or performance of a system. Finding and addressing constraints is often the highest-leverage improvement you can make.\n\n**Five techniques for identifying constraints:**\n\n**1. Make work-in-progress visible**\nVisualize the flow of work through your system. Where work piles up is often where constraints exist. Kanban boards, dashboards, and status reports help reveal these accumulation points.\n\n**2. Look for the most scarce resources**\nIdentify what's in shortest supply - whether that's time, attention, money, people, or equipment. Scarcity often indicates a constraint. Ask: 'What resource, if we had more of it, would significantly increase output?'\n\n**3. Ask people what resource they're most often waiting on**\nThe people working within a system often have direct knowledge of what slows them down. Regular conversations about blockers and waiting time can quickly surface constraints.\n\n**4. Look for constraining policies and rules**\nSometimes constraints aren't physical resources but artificial limitations: approval processes, policies, regulations, or 'the way things have always been done.' Question whether these rules still serve their original purpose.\n\n**5. Perform experiments and measure changes to throughput**\nSystematically test hypotheses about where constraints exist. Make small changes and measure their impact on overall system output. If changing something dramatically improves throughput, you've likely found a constraint.\n\n**Why this matters:**\n\nImproving a non-constraint has limited impact on overall system performance. But removing or expanding a true constraint can unlock significant improvements. This principle, central to the Theory of Constraints, means that identifying the right constraint is often more important than the improvement itself.",
    "tags": [
        "systems-thinking",
        "constraints",
        "bottlenecks",
        "optimizations",
        "problem-solving"
    ],
    "category": "Techniques",
    "icon": "FaProjectDiagram",
    "featured": false,
    "aliases": [
        "Finding Bottlenecks",
        "Constraint Identification"
    ],
    "relatedConcepts": [
        "systems-thinking",
        "root-cause-analysis",
        "kanban",
        "five-whys",
        "limit-work-in-progress"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/32+Literature+notes/32.02+Content/How+to+identify+constraints+in+a+system"
    ],
    "articles": [],
    "references": [],
    "tutorials": [],
    "datePublished": "2025-12-26",
    "dateModified": "2025-12-28"
}
