{
    "id": "impermanence",
    "name": "Impermanence",
    "summary": "Anicca - the Buddhist teaching that all phenomena are temporary and constantly changing.",
    "explanation": "Impermanence (anicca in Pali) is one of the three marks of existence in Buddhist philosophy, stating that all conditioned phenomena are temporary and in constant flux. Nothing stays the same - pleasant experiences pass, painful experiences pass, youth passes, life passes. This isn't pessimistic but realistic, and understanding it deeply can reduce suffering. We suffer when we cling to what changes (youth, pleasure, relationships) or resist inevitable change. Contemplating impermanence: reduces attachment and grasping, helps appreciate present moments, provides perspective during difficulties ('this too shall pass'), motivates meaningful action (time is limited), and develops equanimity. For knowledge workers, impermanence perspective helps: handle project endings, cope with organizational change, appreciate current opportunities, and maintain balance when success or failure occurs. The antidote to suffering from change is not preventing change but changing our relationship to it.",
    "tags": [
        "buddhism",
        "philosophies",
        "mindfulness",
        "wisdom",
        "acceptance"
    ],
    "category": "Concepts",
    "icon": "FaHourglass",
    "featured": false,
    "aliases": [
        "Anicca",
        "Transience",
        "This too shall pass"
    ],
    "relatedConcepts": [
        "equanimity",
        "non-attachment",
        "memento-mori",
        "stoicism",
        "radical-acceptance",
        "buddhist-concepts"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
