{
    "id": "inattentional-blindness",
    "name": "Inattentional Blindness",
    "summary": "Failure to notice unexpected stimuli when attention is focused elsewhere.",
    "explanation": "Inattentional blindness is the phenomenon where people fail to notice unexpected but clearly visible events when their attention is engaged elsewhere. The famous 'invisible gorilla' experiment demonstrated this: viewers counting basketball passes often completely miss a gorilla walking through the scene. This isn't about vision but attention - the information reaches the eyes but isn't consciously processed. Inattentional blindness shows: attention is necessary for awareness, we see far less than we think, and focused attention creates blindness to the unexpected. It has practical implications: distracted drivers miss hazards, focused workers miss important signals, and experts can miss obvious anomalies in their domain. The effect is stronger when: cognitive load is high, unexpected stimuli are dissimilar to attended targets, and we have strong expectations. For knowledge workers, inattentional blindness warns: intense focus creates blind spots, important signals may be missed, and deliberate attention shifts are sometimes necessary.",
    "tags": [
        "attention",
        "perceptions",
        "cognition",
        "psychology",
        "awareness"
    ],
    "category": "Concepts",
    "icon": "FaEyeSlash",
    "featured": false,
    "aliases": [
        "Attention blindness",
        "Perceptual blindness",
        "Invisible gorilla effect"
    ],
    "relatedConcepts": [
        "change-blindness",
        "selective-attention",
        "focus"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Invisible Gorilla by Chabris and Simons",
            "url": "https://amzn.to/3Dp09NT"
        }
    ],
    "references": [
        {
            "title": "Inattentional blindness - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Inattentional_blindness",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
