{
    "id": "information-anxiety",
    "name": "Information Anxiety",
    "summary": "The stress and discomfort caused by the gap between what we know and what we feel we should know.",
    "explanation": "Information anxiety, a term coined by Richard Saul Wurman, describes the psychological distress arising from: feeling overwhelmed by information volume, not understanding available information, fearing we're missing important information, or struggling to find relevant information when needed. Unlike productive concern about knowledge gaps, information anxiety creates paralysis rather than action. It manifests as: compulsive checking of news and feeds, inability to commit to decisions, constant fear of being out of the loop, and guilt about unread materials. The condition worsens in the digital age because: information is infinite while attention is finite, FOMO is engineered into platforms, and the illusion that we should know everything is reinforced. For knowledge workers, managing information anxiety requires: accepting that complete knowledge is impossible, defining what information actually matters for your goals, and developing trust in your information systems.",
    "tags": [
        "information",
        "anxieties",
        "psychology",
        "digital-wellness",
        "attention"
    ],
    "category": "Concepts",
    "icon": "FaExclamationTriangle",
    "featured": false,
    "aliases": [
        "Info anxiety",
        "Knowledge anxiety",
        "FOMO anxiety"
    ],
    "relatedConcepts": [
        "information-fatigue-syndrome",
        "fomo",
        "continuous-partial-attention",
        "information-filtering",
        "news-diet",
        "attention-management"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Information Anxiety by Richard Saul Wurman",
            "url": "https://amzn.to/3Dq19LT"
        }
    ],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
