{
    "id": "innovation-culture",
    "name": "Innovation Culture",
    "summary": "Organizational values and practices that encourage experimentation, risk-taking, and new ideas.",
    "explanation": "Innovation culture refers to the organizational values, norms, and practices that foster experimentation, support risk-taking, and encourage new ideas. Elements include: psychological safety (safe to propose and fail), tolerance for ambiguity, cross-functional collaboration, quick decision-making, customer focus, and celebrating learning (not just success). Innovation culture requires leadership actions: allocating resources to experimentation, protecting innovative projects from premature metrics, and modeling innovative behavior. Gary Pisano's research shows innovation culture has uncomfortable aspects: tolerance for failure requires intolerance for incompetence, willingness to experiment requires rigorous discipline, psychological safety requires candid criticism, and collaboration requires individual accountability. Building innovation culture takes time - it can't be declared, only cultivated through consistent behavior. For knowledge workers, contributing to innovation culture means: proposing ideas despite uncertainty, providing candid feedback, and supporting others' experimentation.",
    "tags": [
        "innovations",
        "cultures",
        "organizations",
        "creativity",
        "leadership"
    ],
    "category": "Concepts",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": [
        "Creative culture",
        "Experimentation culture",
        "Risk-taking culture"
    ],
    "relatedConcepts": [
        "psychological-safety",
        "innovation-theater",
        "intrapreneurship",
        "fail-fast"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
