{
    "id": "innovation-diffusion",
    "name": "Innovation Diffusion",
    "summary": "How innovations spread through populations over time following predictable patterns.",
    "explanation": "Innovation diffusion describes how new ideas, products, and practices spread through populations over time. Everett Rogers identified a characteristic pattern: innovators (2.5%) adopt first, followed by early adopters (13.5%), early majority (34%), late majority (34%), and laggards (16%). Adoption follows an S-curve - slow at first, accelerating as critical mass is reached, then slowing as saturation occurs. Factors affecting diffusion include: relative advantage (is it better?), compatibility (fits existing practices?), complexity (easy to understand?), trialability (can test before committing?), and observability (can see others using it?). Understanding diffusion helps: time market entry, design for adoption, and predict technology trajectories. Geoffrey Moore's 'Crossing the Chasm' identifies the gap between early adopters and mainstream market that many innovations fail to cross. For knowledge workers, diffusion theory helps: predict technology adoption, design for different user segments, and understand why some innovations succeed while others fail.",
    "tags": [
        "innovations",
        "adoption",
        "markets",
        "technologies",
        "patterns"
    ],
    "category": "Concepts",
    "icon": "FaProjectDiagram",
    "featured": false,
    "aliases": [
        "Diffusion of innovations",
        "Adoption curve",
        "Technology diffusion"
    ],
    "relatedConcepts": [
        "crossing-the-chasm",
        "technology-adoption-lifecycle",
        "network-effects"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Diffusion of Innovations by Everett Rogers",
            "url": "https://amzn.to/3Dp09NT"
        }
    ],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
