{
    "id": "innovation-theater",
    "name": "Innovation Theater",
    "summary": "Superficial innovation activities that create the appearance of progress without real change.",
    "explanation": "Innovation theater refers to activities that create the appearance of innovation without producing meaningful change or value. It includes: hackathons that never lead to implementation, innovation labs disconnected from core business, brainstorming sessions without follow-through, and showcasing buzzwords without understanding them. Innovation theater is seductive because: it's visible and demonstrable, it feels productive, and it satisfies stakeholder demands for innovation. Signs include: focus on activities over outcomes, celebration of ideas rather than results, innovation teams with no path to implementation, and metrics measuring effort not impact. Organizations engage in innovation theater to: signal progressiveness, check boxes for investors, and avoid the harder work of actual change. Combating it requires: connecting innovation to business outcomes, measuring implementation not ideation, and creating pathways from ideas to reality. For knowledge workers, recognizing innovation theater helps: avoid wasting energy on performative activities and focus on changes that actually matter.",
    "tags": [
        "innovations",
        "organizations",
        "cultures",
        "criticism",
        "effectiveness"
    ],
    "category": "Concepts",
    "icon": "FaTheaterMasks",
    "featured": false,
    "aliases": [
        "Fake innovation",
        "Innovation washing",
        "Performative innovation"
    ],
    "relatedConcepts": [
        "innovation-culture",
        "organizational-change",
        "cargo-cult",
        "execution",
        "impact",
        "results-focus"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
