{
    "id": "intelligent-failure",
    "name": "Intelligent Failure",
    "summary": "Failures that occur in pursuit of worthy goals, with appropriate risk management and learning.",
    "explanation": "Intelligent failure is a concept from Amy Edmondson distinguishing valuable failures from preventable ones. Intelligent failures occur when: pursuing worthy goals, taking calculated risks, operating in uncertain territory, and generating learning. These contrast with: preventable failures (mistakes in known processes), complex failures (multiple factors in familiar operations), and reckless failures (unnecessary risks without learning). Characteristics of intelligent failures include: the opportunity was worth the risk, appropriate preparation was done, failure generated new knowledge, and the failure was contained (didn't cause catastrophic damage). Organizations need intelligent failures because: innovation requires experimentation, learning requires discovering what doesn't work, and competitive advantage requires trying new things. Promoting intelligent failure involves: rewarding thoughtful risk-taking, distinguishing failure types when evaluating, and creating psychological safety for appropriate experimentation. For knowledge workers, pursuing intelligent failures means: taking calculated risks on worthwhile projects, learning maximally from setbacks, and distinguishing between failures worth having and those that should be prevented.",
    "tags": [
        "failures",
        "innovations",
        "learning",
        "risk-taking",
        "experimentation"
    ],
    "category": "Concepts",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": [
        "Good failure",
        "Productive failure",
        "Valuable failure"
    ],
    "relatedConcepts": [
        "productive-failure",
        "psychological-safety",
        "learning-from-failure"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Right Kind of Wrong by Amy Edmondson",
            "url": "https://amzn.to/3Dp09NT"
        }
    ],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/l/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/l/knowledge-management-for-beginners",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
