{
    "id": "interoception",
    "name": "Interoception",
    "summary": "The sense of the internal state of the body, including signals like hunger, temperature, and heart rate.",
    "explanation": "Interoception is our ability to perceive internal bodily signals—heart rate, breathing, hunger, temperature, pain, and subtle feelings throughout the body. It's sometimes called our eighth sense. Interoceptive awareness underlies emotional experience: we feel emotions as bodily sensations before we cognitively label them. Research shows that better interoceptive awareness correlates with improved emotional regulation, better decision-making (particularly in intuitive judgments), and mental health. Poor interoception is linked to conditions like anxiety, depression, eating disorders, and alexithymia (difficulty identifying emotions). Improving interoceptive awareness through body scan meditation, mindfulness, and practices like yoga helps us catch stress early, understand our emotional states, and make better decisions. For knowledge workers, tuning into body signals provides important information about energy, stress levels, and authentic responses.",
    "tags": [
        "neuroscience",
        "psychology",
        "self-awareness",
        "mindfulness",
        "emotions",
        "health"
    ],
    "category": "Concepts",
    "icon": "FaHeartbeat",
    "featured": false,
    "aliases": [
        "Interoceptive awareness",
        "Body awareness",
        "Internal sensing"
    ],
    "relatedConcepts": [
        "mindfulness",
        "emotional-granularity",
        "emotional-intelligence",
        "gut-feeling"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Interoception - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Interoception",
            "type": "website"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/l/knowii-journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
