{
    "id": "karma",
    "name": "Karma",
    "summary": "The principle that actions have consequences, shaping future experience and character.",
    "explanation": "Karma (Sanskrit for 'action') is the principle that actions have consequences that shape future experience, character, and circumstances. While popularly understood as cosmic justice or fate, the concept is more nuanced: intentional actions (body, speech, mind) create tendencies and consequences, wholesome actions lead to positive outcomes, harmful actions to negative, and karma operates through natural processes, not divine reward/punishment. Karma emphasizes: agency (we create our karma), responsibility (we experience consequences), and change (karma can be transformed). The concept differs from fatalism - karma is not fixed destiny but ongoing creation. Past karma creates conditions, but present action creates future karma. The teaching encourages: ethical action, mindfulness of intentions, and responsibility for consequences. Common misunderstandings include: karma as fate (it's ongoing creation), instantaneous effects (consequences often delayed), and judgment (natural process, not moral punishment). For knowledge workers, karma suggests: actions and decisions have consequences, character is built through repeated actions, and present choices shape future possibilities.",
    "tags": [
        "philosophies",
        "buddhism",
        "hinduism",
        "wisdom",
        "ethics"
    ],
    "category": "Concepts",
    "icon": "FaCircle",
    "featured": false,
    "aliases": [
        "Action and consequence",
        "Law of karma",
        "Karmic principle"
    ],
    "relatedConcepts": [
        "buddhism",
        "hinduism",
        "ethics",
        "consequences",
        "causation",
        "dharma"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
