{
    "id": "kintsugi-mindset",
    "name": "Kintsugi Mindset",
    "summary": "Embracing brokenness as part of beauty, inspired by the Japanese art of golden repair.",
    "explanation": "Kintsugi mindset is a psychological perspective inspired by the Japanese art of kintsugi - repairing broken pottery with gold, making the breaks visible and beautiful rather than hidden. The mindset involves: embracing rather than hiding brokenness, seeing healing as transformation rather than restoration, and finding beauty and strength in scars. Applied psychologically, kintsugi mindset means: acknowledging past wounds, treating recovery as growth rather than return to original state, and valuing the wisdom gained through difficulty. The concept challenges: shame about damage, desire to appear unbroken, and idea that healing means erasing the past. Kintsugi mindset offers: validation of difficult experiences, framework for integration rather than denial, and narrative of growth through adversity. The perspective aligns with post-traumatic growth research showing that struggle can produce strength. For knowledge workers, kintsugi mindset suggests: learning from failures openly, integrating setbacks into growth narratives, and recognizing that experience including difficult experience creates value.",
    "tags": [
        "philosophy",
        "psychology",
        "wisdom",
        "resilience",
        "healing"
    ],
    "category": "Concepts",
    "icon": "FaGem",
    "featured": false,
    "aliases": [
        "Golden repair",
        "Embracing brokenness",
        "Beautiful scars"
    ],
    "relatedConcepts": [
        "wabi-sabi",
        "post-traumatic-growth",
        "resilience",
        "healing",
        "vulnerability",
        "self-compassion"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
