{
    "id": "knowledge-organization",
    "name": "Knowledge Organization",
    "summary": "Systems and methods for structuring knowledge to enable retrieval and use.",
    "explanation": "Knowledge organization encompasses systems and methods for structuring knowledge to enable retrieval, connection, and use. Approaches include: hierarchical (folder structures, taxonomies), networked (linking, tagging), chronological (date-based), and hybrid (combining approaches). Key concepts include: classification (grouping by categories), indexing (creating findability), metadata (information about information), and linking (connecting related items). Effective organization balances: structure (enough to find things) with flexibility (adapting to evolving needs), and capture effort (organization at input) with retrieval effort (organization at retrieval). Personal knowledge management systems must fit: individual thinking styles, types of knowledge managed, and retrieval patterns. Common challenges include: over-organization (too much structure), under-organization (can't find things), and organizational debt (maintaining systems). For knowledge workers, effective knowledge organization means: choosing appropriate systems for your needs, maintaining consistency, evolving systems as needs change, and balancing organization effort with actual use.",
    "tags": [
        "knowledge-work",
        "organizations",
        "information-architecture",
        "personal-knowledge-management",
        "systems"
    ],
    "category": "Concepts",
    "icon": "FaSitemap",
    "featured": false,
    "aliases": [
        "Organizing knowledge",
        "Information organization",
        "Knowledge structure"
    ],
    "relatedConcepts": [
        "personal-knowledge-management",
        "knowledge-curation",
        "taxonomy",
        "tagging",
        "note-taking",
        "information-architecture"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
