{
    "id": "lean-startup",
    "name": "Lean Startup",
    "summary": "A methodology for developing products through validated learning and iterative experimentation.",
    "explanation": "The Lean Startup, developed by Eric Ries, is a methodology for developing products and businesses that emphasizes rapid learning over elaborate planning. Core principles include: Build-Measure-Learn cycle (create minimal products, measure customer response, learn and iterate), validated learning (measuring progress by learning, not by building), and pivot or persevere decisions (systematically deciding when to change direction). Key concepts include: Minimum Viable Product (smallest thing that tests your hypothesis), innovation accounting (measuring progress toward product-market fit), and continuous deployment. Lean Startup applies beyond startups - it's a scientific approach to creating under uncertainty. The methodology combats two failure modes: building something nobody wants, and never shipping while perfecting. Criticism includes: works better for some industries than others, and 'lean' can be misused to excuse under-investment. For knowledge workers, lean startup thinking means: treating work as experiments, measuring what matters, and adapting based on evidence not opinion.",
    "tags": [
        "innovations",
        "entrepreneurship",
        "methodology",
        "startups",
        "product-development"
    ],
    "category": "Methods",
    "icon": "FaRocket",
    "featured": false,
    "aliases": [
        "Lean methodology",
        "Ries methodology",
        "Lean product development"
    ],
    "relatedConcepts": [
        "minimum-viable-product",
        "pivot-or-persevere",
        "rapid-experimentation"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Lean Startup by Eric Ries",
            "url": "https://www.amazon.com/dp/0307887898?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Lean startup - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Lean_startup",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Dev Concepts",
            "url": "https://dev-concepts.dev",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
