{
    "id": "levels-of-work",
    "name": "Levels of Work",
    "summary": "A framework describing four progressive stages of professional work, from traditional employment to running a large organization.",
    "explanation": "Levels of Work is a framework shared by Tim Denning that categorizes professional work into four distinct stages, each representing increasing autonomy, risk, and potential reward.\n\n**Level 1: Job**\n\nTraditional employment where you trade time for money. You work for someone else, receive a fixed salary, and have limited control over your schedule and income potential. While stable and predictable, this level offers the least autonomy and typically caps your earning potential.\n\n**Level 2: Freelancing, Consulting, and One-Person Businesses**\n\nAt this level, you've stepped out of traditional employment to offer your skills directly to clients. You gain more control over your time, the projects you take on, and your income. However, you're still essentially trading time for money, though at potentially higher rates. This includes solopreneurs, consultants, and independent contractors.\n\n**Level 3: Starting a Business**\n\nHere you transition from being the product to building something that can operate beyond just your individual effort. You create systems, potentially hire a small team, and begin building assets that can generate income without your direct involvement. This level involves significantly more risk but also the potential for scalable growth.\n\n**Level 4: Running a Business with a Large Number of Employees**\n\nThe highest level involves leading a substantial organization with many employees. At this stage, you're focused on strategy, leadership, and scaling. Your income is no longer tied to your personal hours worked, but rather to the success of the organization you've built.\n\nThis framework helps individuals understand their current position and envision possible career progressions. Moving between levels requires different skills, mindsets, and risk tolerances. Not everyone needs or wants to reach Level 4 - the key is understanding where you are and where you want to be.",
    "tags": [
        "careers",
        "entrepreneurship",
        "work",
        "progression"
    ],
    "category": "Frameworks",
    "icon": "FaLayerGroup",
    "featured": false,
    "aliases": [
        "Work Progression Framework",
        "Career Levels"
    ],
    "relatedConcepts": [
        "career-design",
        "financial-independence"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Levels+of+work"
    ],
    "articles": [],
    "references": [
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-26",
    "dateModified": "2025-12-28"
}
