{
    "id": "locus-of-control",
    "name": "Locus of Control",
    "summary": "A psychological concept describing whether people believe outcomes are controlled by themselves (internal) or by external forces like fate, luck, or others (external).",
    "explanation": "Locus of Control is a psychological framework developed by Julian Rotter in 1954 that describes the degree to which individuals believe they have control over the outcomes in their lives. It exists on a spectrum between two orientations: internal and external.\n\nPeople with an internal locus of control believe they are the primary architects of their own destiny. They view their successes and failures as direct results of their own efforts, decisions, and abilities. When something goes wrong, they ask 'What could I have done differently?' rather than blaming circumstances. This mindset fosters proactivity, persistence, and resilience because setbacks are seen as learning opportunities rather than proof of helplessness.\n\nPeople with an external locus of control attribute outcomes to factors outside their influence - luck, fate, powerful others, or circumstances. While this perspective can provide comfort during failures ('It wasn't my fault'), it often leads to passivity, decreased motivation, and a sense of powerlessness. Why try hard if the outcome is predetermined anyway?\n\nResearch consistently shows that an internal locus of control correlates with better outcomes across multiple domains: higher academic achievement, better job performance, improved physical and mental health, lower stress levels, and greater life satisfaction. Those with internal orientation tend to seek more information before making decisions, take more initiative, and persist longer in the face of obstacles.\n\nDeveloping a more internal locus of control involves several strategies: focusing on what you can influence rather than what you cannot (similar to Stoic philosophy), keeping a journal of how your actions led to outcomes, setting and achieving small goals to build evidence of your agency, reframing setbacks as learning experiences, and surrounding yourself with people who model personal responsibility.\n\nIt's worth noting that a healthy perspective involves recognizing that not everything is within our control. The key is distinguishing between what we can influence and what we cannot, then focusing our energy on the former. This balanced view prevents both the paralysis of learned helplessness and the frustration of trying to control the uncontrollable.",
    "tags": [
        "psychology",
        "mindsets",
        "motivations",
        "self-improvement",
        "personal-development",
        "mental-health"
    ],
    "category": "Principles",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Internal Locus of Control",
        "External Locus of Control",
        "Perceived Control",
        "Personal Agency"
    ],
    "relatedConcepts": [
        "growth-mindset",
        "self-discipline",
        "stoicism",
        "learned-helplessness"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/32+Literature+notes/32.02+Content/Locust+of+control"
    ],
    "articles": [],
    "references": [
        {
            "title": "Locus of control - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Locus_of_control",
            "type": "websites"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-26",
    "dateModified": "2025-12-28"
}
