{
    "id": "matthew-principle",
    "name": "Matthew Principle",
    "summary": "The phenomenon where the rich get richer and the poor get poorer - accumulated advantage.",
    "explanation": "The Matthew Principle (or Matthew Effect) describes the phenomenon of accumulated advantage: those who already have advantage tend to gain more advantage, while those without fall further behind. Named after a biblical verse: 'For to everyone who has, more will be given.' Where the Matthew Principle operates: science (famous scientists get more credit for discoveries), education (early achievers get more attention and resources), wealth (money makes more money), and networks (well-connected people attract more connections). Mechanisms: recognition begets recognition, early success opens doors, resources compound, and systems favor incumbents. Implications: inequality tends to increase naturally, early interventions matter disproportionately, 'level playing fields' don't stay level, and success is partly self-reinforcing. The principle has a dark side: it means talent alone isn't enough, luck in early stages gets magnified, and systemic disadvantage accumulates. For knowledge workers, the Matthew Principle suggests: early career investments compound, visibility matters beyond just competence, and building advantage is strategic - accumulated reputation, networks, and skills create increasing returns.",
    "tags": [
        "sociology",
        "economics",
        "inequality",
        "systems",
        "advantage"
    ],
    "category": "Principles",
    "icon": "FaChartLine",
    "featured": false,
    "aliases": [
        "Matthew Effect",
        "Accumulated advantage",
        "Rich get richer"
    ],
    "relatedConcepts": [
        "power-law",
        "compound-effect",
        "network-effects",
        "inequality",
        "preferential-attachment",
        "virtuous-cycle-vicious-cycle"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
