{
    "id": "metanoia",
    "name": "Metanoia",
    "summary": "A transformative change of heart or fundamental shift in one's way of thinking and being.",
    "explanation": "Metanoia (Greek: μετάνοια) refers to a profound transformation of one's worldview, perspective, or entire way of being. It represents more than just changing one's mind—it describes a fundamental reorientation of consciousness and values.\n\nThe concept has roots in ancient Greek philosophy and was later adopted in religious contexts to describe spiritual conversion or repentance. In modern psychology and personal development, metanoia describes moments of radical insight that lead to lasting behavioral and cognitive change.\n\nMetanoia often occurs during pivotal life experiences, deep reflection, or encounters with ideas that challenge core assumptions. Unlike gradual learning or incremental change, metanoia represents a discontinuous shift—a before-and-after moment where one's relationship to reality fundamentally transforms.\n\nThis concept is valuable for understanding personal transformation, paradigm shifts in thinking, and the psychology of profound change. It acknowledges that some changes aren't just about acquiring new information, but about fundamentally reorganizing how we see ourselves and the world.",
    "tags": [
        "transformation",
        "psychology",
        "philosophy",
        "mindset",
        "personal-growth",
        "paradigm-shifts",
        "self-awareness",
        "cognitive-psychology"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Transformative Change",
        "Paradigm Shift",
        "Fundamental Transformation"
    ],
    "relatedConcepts": [
        "metacognition",
        "growth-mindset",
        "paradigm-shifts"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Structure of Scientific Revolutions by Thomas Kuhn",
            "url": "https://www.amazon.com/dp/0226458121?tag=dsebastien00-20"
        },
        {
            "title": "Mindset: The New Psychology of Success by Carol Dweck",
            "url": "https://www.amazon.com/dp/0345472322?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Metanoia - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Metanoia_(psychology)",
            "type": "website"
        },
        {
            "title": "Metanoia (theology) - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Metanoia_(theology)",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-30",
    "dateModified": "2025-12-30"
}
