{
    "id": "middle-way",
    "name": "Middle Way",
    "summary": "The Buddhist path of moderation between extremes of indulgence and asceticism.",
    "explanation": "The Middle Way (Madhyama-pratipad) is the Buddha's fundamental approach: a path between the extremes of sensual indulgence and severe asceticism. The Buddha discovered this after trying both extremes - palace luxury and near-death fasting - finding neither led to liberation. The Middle Way represents: balanced effort (neither lazy nor straining), moderation in lifestyle (neither indulgent nor ascetic), and non-attachment to extremes (avoiding rigid views). The concept extends beyond lifestyle to: views (between eternalism and nihilism), practice (between laxity and tension), and understanding (between substantialism and emptiness). The Middle Way isn't mediocrity or compromise but finding what's appropriate in each situation. It relates to but differs from Aristotle's Golden Mean - more about avoiding extremes in approach to spiritual practice and views about reality. For knowledge workers, the Middle Way suggests: sustainable work habits avoiding burnout and stagnation, balanced views avoiding dogmatism, and appropriate effort that's neither negligent nor obsessive.",
    "tags": [
        "philosophies",
        "buddhism",
        "wisdom",
        "balance",
        "moderation"
    ],
    "category": "Concepts",
    "icon": "FaDharmachakra",
    "featured": false,
    "aliases": [
        "Madhyama-pratipad",
        "Path of moderation",
        "Buddhist balance"
    ],
    "relatedConcepts": [
        "golden-mean",
        "noble-eightfold-path",
        "wisdom-of-crowds"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Middle Way - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Middle_Way",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
