{
    "id": "millionaire-behavior",
    "name": "Millionaire Behavior",
    "summary": "A set of behavioral patterns and mindsets commonly observed among highly successful people who build lasting wealth.",
    "explanation": "Millionaire behavior refers to the habits, mindsets, and approaches that characterize people who achieve significant financial success over the long term. Rather than focusing on get-rich-quick schemes, these behaviors emphasize sustainable practices:\n\n**Play the long game**: Be willing to play a game for an extraordinary length of time. Very few people are willing to commit to something for decades. If you are, you have an unfair advantage over those seeking quick results.\n\n**Sharpen the axe first**: Invest time in identifying your key business insight before acting. Years spent understanding a market or developing expertise might look like wasted time, but it allows you to deploy your energy with 100x or 1000x leverage later.\n\n**Enjoy the process**: Like Novak Djokovic says about hitting tennis balls, you can only perform at the top 1% level if you genuinely enjoy what you're doing. You can fake passion in the short term, but not for decades.\n\n**Leverage content**: Use content creation to attract people to your ideas. Warren Buffett pioneered this with his annual shareholder letters. Content is an incredible form of business leverage.\n\n**Serve others**: Ground yourself in serving others rather than pursuing personal financial goals. Those who play at the highest level prioritize creating value for others. Create value, receive value.\n\n**Authenticity over everything**: Be true to your core values. You can fake a character for days or months, but not for decades. Authentic alignment with your values is essential for sustained success.\n\n**Be the first reader**: Create something you would be thrilled to consume yourself. This high bar ensures quality and genuine value.\n\n**Hunt antelope, not field mice**: Stop wasting time and energy on small decisions with small rewards. Your energy is limited—use it for high-impact activities.\n\n**Present energy matters**: The energy you bring to your home life governs your relationships. When you're with family, be fully present. Work-life seasons change, but the quality of presence doesn't have to.",
    "tags": [
        "wealth",
        "successes",
        "mindsets",
        "behaviors",
        "long-term-thinking",
        "personal-development"
    ],
    "category": "Principles",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": [
        "Wealth Building Habits",
        "Success Behaviors"
    ],
    "relatedConcepts": [
        "compound-growth",
        "persistence",
        "patience",
        "consistency",
        "delayed-gratification"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/32+Literature+notes/32.02+Content/Millionaire+behavior"
    ],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-26",
    "dateModified": "2025-12-28"
}
