{
    "id": "narrative-identity",
    "name": "Narrative Identity",
    "summary": "The internalized story of the self that provides life with unity and purpose.",
    "explanation": "Narrative identity is the internalized, evolving story of the self that provides life with unity, purpose, and meaning. Developed by Dan McAdams and others, the concept holds that: we understand ourselves through stories, identity is constructed not discovered, and life stories integrate past, present, and imagined future. Key elements include: tone (optimistic vs. pessimistic framing), themes (recurring patterns like redemption, contamination, agency), and structure (how events are connected). Narrative identity affects: wellbeing (redemptive narratives correlate with health), motivation (stories shape action), and resilience (reframing enables recovery). Stories can be: edited (reinterpreting past events), extended (writing new chapters), and shared (connecting through mutual narratives). The concept differs from simple autobiography - it's the subjective, meaning-making story, not just facts. For knowledge workers, narrative identity suggests: being intentional about self-story, recognizing how narrative shapes possibility, and understanding that identity is authored, not just revealed.",
    "tags": [
        "psychology",
        "identities",
        "meaning",
        "story",
        "self"
    ],
    "category": "Concepts",
    "icon": "FaBook",
    "featured": false,
    "aliases": [
        "Life story",
        "Self-narrative",
        "Identity story"
    ],
    "relatedConcepts": [
        "identities",
        "meaning",
        "storytelling",
        "self-concept",
        "purpose",
        "redemption-narrative"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "The Redemptive Self by Dan McAdams",
            "url": "https://amzn.to/3Dp09NT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
