{
    "id": "noble-eightfold-path",
    "name": "Noble Eightfold Path",
    "summary": "The Buddhist path to ending suffering through right understanding, conduct, and mental discipline.",
    "explanation": "The Noble Eightfold Path is the Buddha's practical prescription for ending suffering, comprising eight interconnected practices grouped into three categories. Wisdom (prajna): Right View (understanding the Four Noble Truths), Right Intention (commitment to ethical improvement). Ethics (sila): Right Speech (truthful, helpful, kind communication), Right Action (ethical conduct), Right Livelihood (earning living harmlessly). Mental Discipline (samadhi): Right Effort (cultivating wholesome states), Right Mindfulness (present awareness), Right Concentration (focused meditation). The path is: interconnected (elements support each other), practical (applied daily), and gradual (developed over time). It's called 'right' not morally but in the sense of 'conducive to ending suffering.' The path isn't linear but more like a wheel where all elements are practiced simultaneously at deepening levels. For knowledge workers, the Eightfold Path offers: practical guidance for ethical work, mindfulness practices for focus, and framework for professional development aligned with wellbeing.",
    "tags": [
        "philosophy",
        "buddhism",
        "wisdom",
        "practice",
        "spirituality"
    ],
    "category": "Frameworks",
    "icon": "FaDharmachakra",
    "featured": false,
    "aliases": [
        "Eightfold Path",
        "Buddhist path",
        "Middle path practices"
    ],
    "relatedConcepts": [
        "four-noble-truths",
        "buddhism",
        "mindfulness",
        "ethics",
        "meditation",
        "wisdom"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
