{
    "id": "non-duality",
    "name": "Non-Duality",
    "summary": "The philosophical teaching that subject and object, self and other, are ultimately not separate.",
    "explanation": "Non-duality (advaita in Sanskrit) is the philosophical teaching that the fundamental division between subject and object, self and world, is ultimately illusory - reality is one undivided whole. The concept appears in: Advaita Vedanta (atman is brahman - self is ultimate reality), Buddhism (emptiness transcends subject-object division), and Taoism (the Tao is undivided). Non-duality doesn't deny apparent differences but suggests they exist within a larger unity. The teaching challenges: the assumed separation between observer and observed, the belief in an isolated self, and dualistic thinking that divides reality into opposing pairs. Understanding non-duality leads to: reduced sense of isolation, diminished grasping and aversion, and different relationship with experience. The teaching is often: intellectually understood before experientially realized, approached through meditation and inquiry, and difficult to express in inherently dualistic language. For knowledge workers, non-duality offers: different perspective on self-other dynamics, framework for understanding interconnection, and potential liberation from rigid separations that create conflict.",
    "tags": [
        "philosophies",
        "spirituality",
        "wisdom",
        "consciousness",
        "metaphysics"
    ],
    "category": "Concepts",
    "icon": "FaYinYang",
    "featured": false,
    "aliases": [
        "Advaita",
        "Non-dual awareness",
        "Unity consciousness"
    ],
    "relatedConcepts": [
        "dependent-origination",
        "tao-dao"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Nondualism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Nondualism",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
