{
    "id": "non-attachment",
    "name": "Non-Attachment",
    "summary": "Freedom from clinging to outcomes, possessions, or experiences - holding things lightly.",
    "explanation": "Non-attachment is the practice of engaging fully with life while not clinging to specific outcomes, possessions, or experiences. It's not detachment (disconnecting or not caring) but rather participating wholeheartedly without the suffering that comes from grasping. Buddhist teaching identifies attachment (tanha) as a root cause of suffering - we suffer not from loss but from our clinging to what is lost or our grasping for what we don't have. Non-attachment means: working hard toward goals without being devastated if they don't materialize, enjoying possessions without being owned by them, loving fully while accepting relationships change, and pursuing success while defining yourself beyond outcomes. For knowledge workers, non-attachment helps: maintain mental health through project failures, avoid burnout from over-identification with work, make clearer decisions free from fear of loss, and stay flexible in changing circumstances.",
    "tags": [
        "buddhism",
        "mindfulness",
        "philosophies",
        "well-being",
        "wisdom"
    ],
    "category": "Concepts",
    "icon": "FaFeather",
    "featured": false,
    "aliases": [
        "Letting go",
        "Non-clinging",
        "Detachment from outcomes"
    ],
    "relatedConcepts": [
        "equanimity",
        "impermanence",
        "stoicism",
        "process-over-outcome",
        "radical-acceptance"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Untethered Soul by Michael Singer",
            "url": "https://amzn.to/3DoP8xT"
        }
    ],
    "references": [
        {
            "title": "Nonattachment (philosophy) - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Nonattachment_(philosophy)",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
