{
    "id": "open-innovation",
    "name": "Open Innovation",
    "summary": "Using external ideas and paths to market alongside internal innovation capabilities.",
    "explanation": "Open innovation, coined by Henry Chesbrough, describes organizations using external ideas and technologies alongside internal R&D, and external paths to market alongside internal channels. It contrasts with closed innovation (everything developed in-house). Open innovation takes two forms: outside-in (incorporating external knowledge - partnerships, acquisitions, licensing) and inside-out (letting internal innovations flow out - licensing, spin-offs, open-sourcing). Drivers include: distributed knowledge (no company has all the smart people), shorter product cycles (too slow to do everything internally), and active external innovation ecosystems. Open innovation requires: managing intellectual property strategically, building absorptive capacity (ability to use external knowledge), and developing partnership capabilities. Challenges include: not-invented-here syndrome, protecting core capabilities, and coordination costs. For knowledge workers, open innovation thinking means: leveraging others' work rather than reinventing, contributing to communities, and recognizing value beyond organizational boundaries.",
    "tags": [
        "innovations",
        "strategies",
        "collaboration",
        "ecosystems",
        "partnerships"
    ],
    "category": "Concepts",
    "icon": "FaDoorOpen",
    "featured": false,
    "aliases": [
        "Collaborative innovation",
        "External innovation",
        "Distributed innovation"
    ],
    "relatedConcepts": [
        "innovation-ecosystems",
        "partnerships",
        "collaboration",
        "knowledge-sharing",
        "intellectual-property",
        "platform-business"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Open Innovation by Henry Chesbrough",
            "url": "https://amzn.to/3Dp08MT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
