{
    "id": "operating-rhythm",
    "name": "Operating Rhythm",
    "summary": "Recurring patterns of meetings, reviews, and activities that drive organizational execution.",
    "explanation": "Operating rhythm refers to the recurring patterns of meetings, reviews, check-ins, and activities that drive execution in organizations or personal productivity systems. It provides: predictability (everyone knows what happens when), accountability (regular review points), coordination (synchronization across teams), and momentum (continuous forward progress). Components include: daily standups or check-ins, weekly planning and review, monthly/quarterly business reviews, and annual planning cycles. Benefits include: reduced coordination overhead (scheduled touchpoints), early problem detection (regular reviews catch issues), consistent execution (rhythm creates habit), and reduced decision fatigue (standardized cadence). Design considerations: frequency appropriate to work type, duration proportional to value, clear purpose for each element, and flexibility within structure. Common patterns: daily tactical, weekly strategic, monthly operational, quarterly directional. For knowledge workers, establishing operating rhythm means: designing personal review cadences, coordinating with team rhythms, and balancing structure with flexibility for deep work.",
    "tags": [
        "productivity",
        "management",
        "systems",
        "execution",
        "cadence"
    ],
    "category": "Leadership & Management",
    "icon": "FaHeartbeat",
    "featured": false,
    "aliases": [
        "Business cadence",
        "Execution rhythm",
        "Management operating system"
    ],
    "relatedConcepts": [
        "systems-thinking"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://obsidianstarterkit.com",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/l/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/l/pkm-coaching",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
