{
    "id": "optionality",
    "name": "Optionality",
    "summary": "The strategic practice of keeping options open to benefit from uncertainty and unexpected opportunities.",
    "explanation": "Optionality is the property of asymmetric upside - having choices available that can be exercised when beneficial and ignored when not. Nassim Taleb popularized this concept in the context of antifragility: systems with optionality benefit from volatility rather than being harmed by it. In decision-making, optionality means structuring choices to preserve future flexibility. Examples include: taking a generalist role early in your career (more future paths), learning transferable skills, maintaining financial reserves (options to act on opportunities), or making reversible decisions when possible. The value of options increases with uncertainty - when the future is unpredictable, keeping doors open becomes more valuable. However, optionality has costs: maintaining options requires resources and may mean less commitment to any single path. The key is recognizing when preserving options outweighs the benefits of full commitment, and when the opposite is true.",
    "tags": [
        "decision-making",
        "mental-models",
        "strategic-thinking",
        "antifragility",
        "uncertainties"
    ],
    "category": "Frameworks",
    "icon": "FaDoorOpen",
    "featured": false,
    "aliases": [
        "Keeping options open",
        "Strategic flexibility",
        "Option value"
    ],
    "relatedConcepts": [
        "reversible-vs-irreversible-decisions",
        "black-swan",
        "opportunity-cost",
        "second-order-effects",
        "bias-for-action"
    ],
    "relatedNotes": [],
    "articles": [
        {
            "title": "The Barbell Strategy: Optionality in Practice",
            "url": "https://fs.blog/the-barbell-strategy/",
            "type": "websites"
        }
    ],
    "references": [
        {
            "title": "Antifragile: Things That Gain from Disorder",
            "url": "https://amzn.to/4iL5jCQ",
            "type": "book"
        },
        {
            "title": "The Black Swan: The Impact of the Highly Improbable",
            "url": "https://amzn.to/3ZS0QJ7",
            "type": "book"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": []
}
