{
    "id": "post-traumatic-growth",
    "name": "Post-Traumatic Growth",
    "summary": "Positive psychological change that can emerge from struggling with highly challenging life circumstances.",
    "explanation": "Post-traumatic growth (PTG) is the experience of positive change that can occur following struggle with major life crises or traumatic events. Unlike resilience (returning to baseline), PTG involves transformation beyond previous levels of functioning. Researchers Tedeschi and Calhoun identified five domains of growth: greater appreciation of life, improved relationships, recognition of new possibilities, enhanced personal strength, and spiritual or existential development. PTG doesn't mean trauma is good or that everyone should experience growth—it acknowledges that some people find meaning and positive change through their struggles. Factors supporting PTG include: deliberate rumination (reflective processing rather than intrusive thoughts), social support, acceptance, and finding meaning. Understanding PTG offers hope without minimizing suffering, and reminds us that adversity, while painful, sometimes catalyzes profound personal development.",
    "tags": [
        "psychology",
        "mental-health",
        "personal-growth",
        "resilience",
        "well-being"
    ],
    "category": "Concepts",
    "icon": "FaSeedling",
    "featured": false,
    "aliases": [
        "PTG",
        "Growth after trauma",
        "Adversarial growth"
    ],
    "relatedConcepts": [
        "resilience",
        "trauma",
        "meaningful-pursuits",
        "growth-mindset",
        "adversity-paradox",
        "logotherapy",
        "stoicism"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
