{
    "id": "pretesting",
    "name": "Pretesting",
    "summary": "Testing yourself on material before learning it improves subsequent learning, even when you get answers wrong.",
    "explanation": "Pretesting (or prequestioning) is the practice of attempting to answer questions about material before you've studied it. Counterintuitively, this improves learning even when - perhaps especially when - you get the answers wrong. The mechanism appears to be that pretesting: primes attention for relevant information, creates curiosity gaps that feel satisfying to fill, generates predictions that engage deeper processing when confirmed or corrected, and activates related prior knowledge. Research shows pretested items are remembered better than equivalent non-pretested items, even accounting for the extra exposure. For knowledge workers, this suggests: preview quizzes or questions before reading material, try to answer your own questions before searching, and embrace 'not knowing' as an active part of learning. Pretesting is another form of productive failure that sets up the mind for better encoding.",
    "tags": [
        "learning",
        "memories",
        "study-techniques",
        "cognitive-science",
        "preparation"
    ],
    "category": "Techniques",
    "icon": "FaClipboardQuestion",
    "featured": false,
    "aliases": [
        "Pre-questioning",
        "Test-before-study"
    ],
    "relatedConcepts": [
        "testing-effect",
        "productive-failure",
        "curiosity-gap",
        "generation-effect",
        "active-recall",
        "desirable-difficulties"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Make It Stick by Peter Brown",
            "url": "https://amzn.to/3DpT8v2",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
