{
    "id": "pro-aging-trance",
    "name": "Pro-aging Trance",
    "summary": "The psychological state of accepting aging and death as inevitable and even meaningful, framed by some as a rationalization of mortality.",
    "explanation": "The Pro-aging Trance is a controversial concept coined by biogerontologist Aubrey de Grey to describe what he views as society's collective rationalization of aging and death. De Grey argues that because death has been inevitable throughout human history, people have developed elaborate psychological and philosophical frameworks to make peace with mortality rather than working to overcome it.\n\n**De Grey's Argument:**\n\nAccording to de Grey, the \"trance\" manifests in several ways:\n\n**Rationalization**: Finding positive meaning in mortality (e.g., \"death gives life meaning\") rather than treating it as a problem to solve.\n\n**Naturalistic Fallacy**: Arguing that because aging is natural, it must be good or acceptable. De Grey contends this is equivalent to accepting disease simply because it's natural.\n\n**Shifting Goalposts**: As life extension research advances, critics shift their objections from \"it's impossible\" to \"it's undesirable.\"\n\n**Sour Grapes**: Similar to Aesop's fable, people declare they don't want what they believe they can't have—in this case, greatly extended or unlimited lifespan.\n\n**The Counterargument:**\n\nCritics of de Grey's position argue that:\n\n**Genuine Philosophy**: Many philosophical positions on mortality (like Bernard Williams' categorical desires argument) represent serious intellectual engagement, not mere coping mechanisms.\n\n**Quality vs. Quantity**: The focus on living well rather than living indefinitely may reflect authentic values, not rationalization.\n\n**Practical Wisdom**: Accepting mortality allows people to focus on making the most of finite time rather than being paralyzed by death anxiety.\n\n**Social and Ethical Concerns**: Objections to radical life extension may stem from legitimate concerns about overpopulation, resource distribution, and social stagnation.\n\n**The Debate's Significance:**\n\nWhether or not one accepts de Grey's framing, the concept raises important questions:\n\n- How much of our acceptance of mortality is adaptive wisdom versus defensive rationalization?\n- Would we view death differently if radical life extension became achievable?\n- Are philosophical arguments about mortality's meaning influenced by its perceived inevitability?\n- What would we pursue if we had centuries or millennia instead of decades?\n\nThe \"pro-aging trance\" concept is deliberately provocative, designed to challenge assumptions and spark debate about mortality, meaning, and the ethics of life extension research. It forces consideration of whether our cultural narratives about death serve us or simply help us cope with what we can't change.",
    "tags": [
        "psychology",
        "mortality",
        "aging",
        "longevity",
        "cognitive-biases",
        "rationalization",
        "philosophy",
        "biogerontology"
    ],
    "category": "Psychology & Mental Models",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Pro-Aging Bias",
        "Mortality Rationalization",
        "Death Acceptance Rationalization"
    ],
    "relatedConcepts": [
        "memento-mori",
        "cognitive-dissonance",
        "categorical-desires"
    ],
    "relatedNotes": [],
    "articles": [
        {
            "title": "Why We Need to Die",
            "url": "https://willllliam.com/blog/why-we-need-to-die",
            "type": "website"
        }
    ],
    "books": [
        {
            "title": "Ending Aging by Aubrey de Grey and Michael Rae",
            "url": "https://www.amazon.com/dp/0312367074?tag=dsebastien00-20"
        },
        {
            "title": "The Longevity Seekers by Ted Anton",
            "url": "https://www.amazon.com/dp/022609606X?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Aubrey de Grey - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Aubrey_de_Grey",
            "type": "website"
        },
        {
            "title": "SENS Research Foundation",
            "url": "https://www.sens.org/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-30",
    "dateModified": "2025-12-30"
}
