{
    "id": "progressive-muscle-relaxation",
    "name": "Progressive Muscle Relaxation",
    "summary": "A technique of systematically tensing and releasing muscle groups to induce physical and mental relaxation.",
    "explanation": "Progressive Muscle Relaxation (PMR), developed by Edmund Jacobson in the 1930s, is a systematic technique for reducing muscle tension and inducing relaxation. The method involves deliberately tensing a muscle group for 5-10 seconds, then releasing and noticing the contrast for 15-20 seconds, then moving to the next group. Typically starting from the feet and moving upward (or vice versa), PMR trains awareness of tension you may not realize you're holding and develops the skill of releasing it. Benefits include: reduced anxiety and stress, better sleep, pain management, and increased body awareness. PMR works because: muscular tension accompanies psychological stress, and releasing tension signals safety to the nervous system. For knowledge workers who hold tension from desk work and mental strain, PMR provides a practical tool for releasing accumulated stress, especially before sleep or after intense work periods.",
    "tags": [
        "relaxation",
        "stresses",
        "body",
        "techniques",
        "well-being"
    ],
    "category": "Techniques",
    "icon": "FaDumbbell",
    "featured": false,
    "aliases": [
        "PMR",
        "Jacobson relaxation",
        "Muscle relaxation"
    ],
    "relatedConcepts": [
        "relaxation-response",
        "body-scan-meditation",
        "stress-management",
        "sleep",
        "anxieties",
        "grounding"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
