{
    "id": "progress-principle",
    "name": "Progress Principle",
    "summary": "The finding that making meaningful progress in work is the single most important factor in boosting motivation and engagement.",
    "explanation": "The Progress Principle, discovered by researchers Teresa Amabile and Steven Kramer through their extensive study of knowledge workers, reveals that making meaningful progress in work is the single biggest driver of motivation, positive emotions, and engagement. Even small wins can trigger a positive inner work life, leading to better performance. Their research analyzed nearly 12,000 daily diary entries and found that on days when workers made progress, they were more intrinsically motivated, had more positive perceptions of their work environment, and reported better moods. Conversely, setbacks had an outsized negative impact on inner work life. The key insight is that progress does not need to be major - small wins matter greatly. Managers and individuals can leverage this by: breaking projects into milestones, celebrating small victories, removing obstacles that block progress, providing timely feedback, and ensuring people understand how their work contributes to meaningful goals. The Progress Principle also explains why tracking systems, visible progress indicators, and regular reviews are so motivating - they make progress tangible and salient.",
    "tags": [
        "productivity",
        "motivations",
        "psychology",
        "management",
        "work"
    ],
    "category": "Principles",
    "icon": "FaChartLine",
    "featured": false,
    "aliases": [
        "Power of small wins",
        "Progress motivation",
        "Inner work life"
    ],
    "relatedConcepts": [
        "celebrate-wins",
        "compound-growth",
        "dopamine",
        "flow-state",
        "kaizen",
        "metronomes-and-momentum",
        "small-wins",
        "success-breeds-confidence"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "The Progress Principle: Using Small Wins to Ignite Joy, Engagement, and Creativity at Work by Teresa Amabile and Steven Kramer",
            "url": "https://amzn.to/3VRvxKZ",
            "type": "book"
        },
        {
            "title": "Harvard Business Review: The Power of Small Wins",
            "url": "https://hbr.org/2011/05/the-power-of-small-wins",
            "type": "websites"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Kit",
            "url": "https://store.dsebastien.net/l/obsidian-starter-kit",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/l/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Personal Knowledge Management Coaching",
            "url": "https://store.dsebastien.net/l/pkm-coaching",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
