{
    "id": "psychological-essentialism",
    "name": "Psychological Essentialism",
    "summary": "The cognitive bias of believing that certain categories of things have an underlying essence that makes them what they are and determines their observable characteristics.",
    "explanation": "Psychological Essentialism is the intuitive belief that certain categories, particularly natural kinds and social groups, possess an underlying, often invisible 'essence' that makes them fundamentally what they are. This essence is thought to be causally responsible for the surface features we observe and to be shared by all members of the category. For instance, we might believe that there is something inherently 'tiger-like' about all tigers that causes their stripes, behavior, and other characteristics, independent of any individual tiger's specific history or environment.\n\nThis cognitive tendency emerges early in childhood development. By age four or five, children demonstrate essentialist thinking about biological categories, believing that a baby raised by different species will still develop the characteristics of its birth species. This suggests essentialism may be a fundamental aspect of human categorization rather than purely a learned cultural belief. Developmental psychologist Susan Gelman's research has extensively documented how children use essentialist reasoning to make inferences about category members, predict properties, and explain why things are the way they are.\n\nPsychological essentialism offers some cognitive benefits. It allows for efficient generalization and inference-making across category members, supports learning by providing a framework for organizing information, and helps us predict how unfamiliar instances of a category will behave. When we encounter a new fruit we've never seen, our essentialist thinking helps us infer it probably has seeds, grows on a plant, and is edible.\n\nHowever, essentialism has significant downsides, particularly when applied to human social groups. It can reinforce stereotyping by making people believe that group differences are natural, fixed, and deeply rooted rather than socially constructed or environmentally influenced. When we essentialize racial, gender, or other social categories, we may perceive group members as more homogeneous than they actually are and view group boundaries as more rigid and meaningful than they truly are. This contributes to prejudice and resistance to social change.\n\nThe growth mindset, developed by psychologist Carol Dweck, directly counters essentialist thinking about human abilities and traits. Where essentialism suggests that intelligence, talent, or personality are fixed essences that determine outcomes, growth mindset emphasizes that these qualities can be developed through effort, learning, and persistence. Adopting a growth mindset requires consciously rejecting the essentialist intuition that people 'are what they are' and cannot fundamentally change.\n\nRecognizing our essentialist tendencies is the first step toward thinking more accurately about categories. We can practice viewing categories as fuzzy rather than sharply bounded, considering how context and experience shape characteristics, and remembering that variation within categories is often greater than variation between them. This more nuanced thinking leads to better scientific understanding and more equitable treatment of others.",
    "tags": [
        "cognitive-biases",
        "psychology",
        "categorization",
        "stereotypes",
        "social-psychology",
        "thinking"
    ],
    "category": "Principles",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Essentialism",
        "Essentialist Thinking"
    ],
    "relatedConcepts": [
        "fundamental-attribution-error",
        "in-group-bias",
        "growth-mindset"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Essential Child: Origins of Essentialism in Everyday Thought by Susan A. Gelman",
            "url": "https://www.amazon.com/dp/0195181980?tag=dsebastien00-20"
        },
        {
            "title": "Mindset: The New Psychology of Success by Carol S. Dweck",
            "url": "https://www.amazon.com/dp/0345472322?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Psychological Essentialism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Psychological_essentialism",
            "type": "website"
        },
        {
            "title": "Essentialism (psychology) - Stanford Encyclopedia of Philosophy",
            "url": "https://plato.stanford.edu/entries/natural-kinds/",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-30",
    "dateModified": "2025-12-30"
}
