{
    "id": "psychological-safety",
    "name": "Psychological Safety",
    "summary": "The belief that one can speak up, take risks, and be vulnerable without fear of punishment or humiliation.",
    "explanation": "Psychological safety, a term coined by Harvard professor Amy Edmondson, is the shared belief that a team or environment is safe for interpersonal risk-taking. In psychologically safe environments, people feel comfortable asking questions, admitting mistakes, proposing ideas, and challenging the status quo without fear of embarrassment or retaliation. Google's Project Aristotle found psychological safety to be the most important factor in high-performing teams. Without it, people self-censor, hide errors, and avoid innovation. Building psychological safety requires: leaders modeling vulnerability, responding constructively to mistakes, actively inviting input, expressing appreciation for candor, and framing work as learning rather than performance. For knowledge workers, psychological safety enables the open exchange of ideas essential for creativity, problem-solving, and continuous improvement.",
    "tags": [
        "psychology",
        "teamwork",
        "leadership",
        "collaboration",
        "cultures",
        "workplace"
    ],
    "category": "Concepts",
    "icon": "FaShieldAlt",
    "featured": false,
    "aliases": [
        "Team safety",
        "Safe to fail environment"
    ],
    "relatedConcepts": [
        "trust",
        "feedbacks",
        "growth-mindset",
        "innovations",
        "vulnerability",
        "team-dynamics",
        "learning-from-failure"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "The Fearless Organization by Amy Edmondson",
            "url": "https://amzn.to/3CrR6kZ",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        }
    ],
    "tutorials": []
}
