{
    "id": "radical-self-acceptance",
    "name": "Radical Self-Acceptance",
    "summary": "Fully accepting yourself - including flaws and limitations - without conditions or judgment.",
    "explanation": "Radical self-acceptance means embracing yourself completely as you are right now, without conditions or prerequisites for worthiness. It's not about complacency or avoiding growth, but recognizing that self-worth isn't earned through achievement or perfection. The 'radical' part means accepting even what seems unacceptable - your mistakes, limitations, embarrassing moments, and shadow aspects. Psychologist Carl Rogers noted that paradoxically, we can only change once we accept ourselves as we are. Radical self-acceptance doesn't mean approving of all behaviors or stopping growth, but separating who you are from what you do. It's influenced by Buddhism (non-attachment to ego), humanistic psychology (unconditional positive regard), and DBT (dialectical behavior therapy). For knowledge workers prone to perfectionism and impostor syndrome, radical self-acceptance is foundational - it frees energy from self-attack for actual growth and creative work.",
    "tags": [
        "psychology",
        "self-compassion",
        "mindfulness",
        "personal-growth",
        "wellbeing"
    ],
    "category": "Concepts",
    "icon": "FaHeart",
    "featured": false,
    "aliases": [
        "Unconditional self-acceptance",
        "Complete self-acceptance"
    ],
    "relatedConcepts": [
        "self-compassion",
        "radical-acceptance",
        "inner-critic",
        "perfectionism",
        "cognitive-behavioral-therapy",
        "mindfulness",
        "non-attachment"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Radical Acceptance by Tara Brach",
            "url": "https://amzn.to/3DqR2L4",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
