{
    "id": "rain-technique",
    "name": "RAIN Technique",
    "summary": "A mindfulness practice for difficult emotions: Recognize, Allow, Investigate, Nurture.",
    "explanation": "RAIN is a four-step mindfulness practice for working with difficult emotions, developed by Michele McDonald and popularized by Tara Brach. R - Recognize: Name what is happening ('I notice anxiety'). A - Allow: Let the experience be there without trying to fix, change, or push away. I - Investigate: With kindness, explore where you feel it in the body, what it needs, what beliefs accompany it. N - Nurture: Offer yourself compassion, perhaps imagining how you'd comfort a friend. The N was originally 'Non-identification' (recognizing emotions aren't your whole identity) but was updated to emphasize self-compassion. RAIN creates space between trigger and reaction, preventing emotional hijacking while building self-understanding. It's particularly useful for: recurring difficult emotions, moments of high stress, and building emotional intelligence. The practice can take minutes or longer depending on emotional intensity.",
    "tags": [
        "mindfulness",
        "emotional-regulation",
        "self-compassion",
        "psychology",
        "techniques"
    ],
    "category": "Techniques",
    "icon": "FaCloudRain",
    "featured": false,
    "aliases": [
        "RAIN meditation",
        "RAIN practice"
    ],
    "relatedConcepts": [
        "mindfulness",
        "emotional-regulation",
        "self-compassion",
        "cognitive-defusion",
        "radical-acceptance",
        "stop-technique"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Radical Compassion by Tara Brach",
            "url": "https://amzn.to/3DqR9wT"
        }
    ],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
