{
    "id": "rationalism",
    "name": "Rationalism",
    "summary": "The philosophical view that reason is the primary source of knowledge and truth.",
    "explanation": "Rationalism is the philosophical position that reason, rather than experience or sensory observation, is the primary source of knowledge and truth. Rationalists believe that some knowledge is innate or can be derived through pure reasoning alone. Core claims: the mind has innate ideas (not all knowledge comes from experience), reason can discover truths about reality (through logic and deduction), and some truths are necessary and universal (like mathematics). Key rationalist thinkers: Descartes ('I think, therefore I am'), Leibniz, and Spinoza. Rationalism contrasts with empiricism: empiricists say all knowledge comes from sensory experience; rationalists say some truths are known through reason alone. Examples of rationalist truths: mathematical knowledge (2+2=4 doesn't require observation), logical truths (A cannot be both A and not-A), and perhaps ethical principles (some argue). Modern relevance: science combines rational reasoning with empirical observation, critical thinking uses rational analysis, and formal systems (math, logic, programming) are rationalist domains. For knowledge workers, rationalist thinking helps: value logical analysis, recognize the power of deductive reasoning, and understand when problems can be solved through pure reasoning versus when observation is needed.",
    "tags": [
        "philosophy",
        "epistemology",
        "reasoning",
        "knowledge",
        "thinking"
    ],
    "category": "Concepts",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": [
        "Rationalist philosophy",
        "Continental rationalism",
        "Reason-based philosophy"
    ],
    "relatedConcepts": [
        "empiricism",
        "epistemology",
        "reasoning",
        "logic",
        "philosophy",
        "critical-thinking"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
