{
    "id": "reciprocity-principle",
    "name": "Reciprocity Principle",
    "summary": "The social norm of responding to positive actions with positive actions in return.",
    "explanation": "The reciprocity principle is a fundamental social norm where people respond to positive actions with other positive actions, creating cycles of mutual benefit. Robert Cialdini identified reciprocity as one of the six key principles of influence. The principle operates automatically and powerfully: when someone does something for us, we feel compelled to return the favor. This isn't just politeness but a deep evolutionary adaptation that enabled human cooperation and social cohesion. In practice, reciprocity creates: social bonds (mutual exchange builds trust), influence opportunities (giving creates obligation), and sustainable relationships (balanced exchange over time). The principle can be applied positively (generosity that builds genuine relationships) or manipulatively (small gifts creating pressure for larger returns). For knowledge workers, understanding reciprocity means: giving value first without expectation, building relationship capital through generous contribution, and recognizing when others are using reciprocity for manipulation.",
    "tags": [
        "reciprocity",
        "influence",
        "psychology",
        "relationships",
        "social-norms"
    ],
    "category": "Principles",
    "icon": "FaExchangeAlt",
    "featured": false,
    "aliases": [
        "Principle of reciprocation",
        "Give and receive",
        "Mutual exchange principle"
    ],
    "relatedConcepts": [
        "reciprocity-norm",
        "give-and-take",
        "social-exchange",
        "trust-building",
        "social-capital"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Influence by Robert Cialdini",
            "url": "https://amzn.to/3Dp09NT"
        }
    ],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
