{
    "id": "reciprocity-bias",
    "name": "Reciprocity Bias",
    "summary": "The cognitive tendency to feel obligated to return favors, even when disproportionate.",
    "explanation": "Reciprocity bias is the cognitive tendency to feel compelled to return favors, gifts, or concessions, often in disproportionate measure. While reciprocity itself is a healthy social norm, the bias can lead to poor decisions when the return exceeds what's appropriate. Examples include: feeling obligated to buy after receiving a 'free' sample, agreeing to large requests after small favors, and maintaining relationships out of obligation rather than genuine connection. The bias operates unconsciously and powerfully - small gifts can create large obligations. Marketers and negotiators deliberately exploit this through: free trials, unexpected gifts, and the 'door-in-the-face' technique (large request followed by smaller 'concession'). Protecting against unhealthy reciprocity bias involves: recognizing manipulation tactics, giving yourself permission to decline, separating gifts from obligations, and responding proportionally. For knowledge workers, awareness means: not overcommitting due to small favors, recognizing when reciprocity is being weaponized, and building genuine rather than transactional relationships.",
    "tags": [
        "reciprocity",
        "cognitive-biases",
        "psychology",
        "influence",
        "decision-making"
    ],
    "category": "Concepts",
    "icon": "FaBalanceScale",
    "featured": false,
    "aliases": [
        "Reciprocation bias",
        "Obligation bias",
        "Return favor bias"
    ],
    "relatedConcepts": [
        "reciprocity-principle",
        "obligation-principle"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
