{
    "id": "reciprocity-norm",
    "name": "Reciprocity Norm",
    "summary": "The unwritten social rule that people should help those who have helped them.",
    "explanation": "The reciprocity norm is the unwritten social rule that people should help those who have helped them. Unlike a principle (which describes behavior), the norm is a social expectation that violations are noticed and sometimes punished through reputation damage or relationship withdrawal. The norm exists across all human cultures, suggesting deep evolutionary roots. Anthropologists like Marcel Mauss studied how gift exchange creates social bonds and obligations. The norm serves multiple functions: it enables cooperation without formal contracts, creates mutual aid networks, and builds social cohesion. Violating the norm (taking without giving) leads to being labeled as a 'free rider' or 'taker,' damaging social standing. However, excessive adherence creates: scorekeeping relationships, obligation anxiety, and inability to accept generosity. Healthy reciprocity operates over long timeframes with flexibility, not transaction-by-transaction accounting. For knowledge workers, navigating the norm means: contributing to communities before extracting value, accepting help gracefully, and building long-term reciprocal relationships rather than immediate exchanges.",
    "tags": [
        "reciprocity",
        "social-norms",
        "sociology",
        "cultures",
        "relationships"
    ],
    "category": "Concepts",
    "icon": "FaHandshake",
    "featured": false,
    "aliases": [
        "Norm of reciprocity",
        "Social reciprocity",
        "Give-give relationship"
    ],
    "relatedConcepts": [
        "reciprocity-principle",
        "social-norms",
        "gift-giving",
        "social-exchange",
        "trust",
        "cooperation"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "The Gift by Marcel Mauss",
            "url": "https://amzn.to/3Dp09NT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
