{
    "id": "reciprocity-rule",
    "name": "Reciprocity Rule",
    "summary": "The informal guideline to repay in kind what another person has provided.",
    "explanation": "The reciprocity rule is the informal guideline that we should try to repay, in kind, what another person has provided to us. This rule creates a sense of future obligation, enabling the development of various kinds of ongoing relationships. Cialdini describes it as one of the most potent weapons of influence in human interaction. The rule operates through: creating debt (receiving creates obligation), demanding compliance (the debt must be repaid), and allowing exploitation (even unwanted gifts create obligation). The power comes from the deep discomfort of being in debt and the social cost of being seen as ungrateful or as a taker. The rule can be weaponized through: unsolicited gifts, escalating exchanges, and concession-then-request sequences. Defending against exploitation involves: accepting gifts but not obligations, recognizing the tactic, and responding proportionally or declining entirely. For knowledge workers, the rule suggests: being generous first (creating positive debts), accepting help without feeling overly obligated, and distinguishing genuine gifts from manipulation tactics.",
    "tags": [
        "reciprocity",
        "influence",
        "psychology",
        "social-rules",
        "behaviors"
    ],
    "category": "Concepts",
    "icon": "FaRetweet",
    "featured": false,
    "aliases": [
        "Rule of reciprocation",
        "Payback rule",
        "Return favor rule"
    ],
    "relatedConcepts": [
        "reciprocity-principle",
        "reciprocity-bias",
        "obligation-principle"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Influence by Robert Cialdini",
            "url": "https://amzn.to/3Dp09NT"
        }
    ],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
