{
    "id": "running-costs-influence",
    "name": "Running Costs Influence",
    "summary": "How ongoing operational costs affect decision-making, often more than initial investment costs.",
    "explanation": "Running Costs Influence describes the phenomenon where ongoing operational expenses significantly impact decisions, behavior, and outcomes - often more than initial purchase or setup costs. Understanding this influence is crucial for personal finance, business strategy, and technology choices.\n\nKey Concepts:\n\nTotal Cost of Ownership (TCO): The complete cost of an asset including:\n- Initial purchase price\n- Installation/setup costs\n- Ongoing operational costs\n- Maintenance and support\n- Training and adaptation\n- Eventual disposal or migration\n\nWhy Running Costs Matter:\n\n1. Accumulation: Small recurring costs compound over time\n2. Commitment: Once locked into running costs, changing becomes expensive\n3. Cash Flow: Ongoing costs affect regular budgets more than one-time purchases\n4. Hidden Costs: Running costs are often underestimated or overlooked\n\nExamples:\n\n- Software: Free/cheap software with expensive hosting vs. paid with free hosting\n- Vehicles: Purchase price vs. fuel, insurance, maintenance\n- Real Estate: Purchase price vs. utilities, taxes, maintenance\n- Subscriptions: Low monthly fees that add up significantly over time\n- Enterprise Tools: License cost vs. training, integration, support\n\nDecision Framework:\n\n1. Calculate total 3-5 year cost, not just upfront cost\n2. Consider scalability of running costs\n3. Account for switching costs if you need to change later\n4. Factor in hidden operational requirements\n\nThis principle argues for careful evaluation of ongoing costs, as they often determine long-term viability more than initial investment.",
    "tags": ["business", "finance", "decision-making", "economics", "strategy"],
    "category": "Principles",
    "icon": "FaChartLine",
    "featured": false,
    "aliases": ["Total Cost of Ownership", "Operational Cost Impact"],
    "relatedConcepts": [],
    "relatedNotes": [],
    "articles": [],
    "references": [],
    "tutorials": []
}
