{
    "id": "samadhi",
    "name": "Samadhi",
    "summary": "A state of profound meditative concentration where the mind becomes completely absorbed in its object of focus.",
    "explanation": "Samadhi (Sanskrit: समाधि) is a state of intense concentration and meditative absorption in Hindu, Buddhist, and yogic traditions. It represents one of the highest states of meditation, where the distinction between the meditator, the act of meditation, and the object of meditation dissolves into unified awareness.\n\nThe characteristics of samadhi include:\n- Complete mental absorption in the meditation object\n- Cessation of discursive thought and mental chatter\n- Profound peace and equanimity\n- Heightened clarity and awareness\n- Loss of ordinary sense of time and self\n- Deep joy or bliss (in some forms)\n\nIn classical yoga philosophy (Patanjali's Yoga Sutras), samadhi is the eighth and final limb of the yogic path. Different traditions describe various levels or types of samadhi:\n\n**Savikalpa Samadhi**: Concentration with seed or object - the mind remains focused on a particular object or concept\n\n**Nirvikalpa Samadhi**: Concentration without seed - pure consciousness without any object, considered the highest state\n\nIn Buddhist traditions, particularly Theravada, similar states are called jhanas or dhyanas, representing progressive levels of meditative absorption.\n\nWhile samadhi is a powerful and valuable meditative state, teachers emphasize that it should be balanced with insight practices (vipassana in Buddhism). Concentration alone, while producing profound states, may not lead to the wisdom and liberation that comes from direct insight into the nature of mind and reality.\n\nUnderstanding samadhi helps meditators recognize and work with deep states of concentration, distinguish genuine absorption from other meditative experiences, and appreciate the role of concentration in contemplative development.",
    "tags": [
        "meditation",
        "buddhism",
        "hinduism",
        "yoga",
        "mindfulness",
        "contemplative-practices",
        "consciousness",
        "concentration"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Meditative Absorption",
        "Meditative Concentration",
        "Jhana",
        "Dhyana"
    ],
    "relatedConcepts": [
        "laya",
        "makyou",
        "mindfulness",
        "flow-state"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "The Mind Illuminated by Culadasa (John Yates)",
            "url": "https://www.amazon.com/dp/1501156985?tag=dsebastien00-20"
        },
        {
            "title": "The Yoga Sutras of Patanjali by Sri Swami Satchidananda",
            "url": "https://www.amazon.com/dp/1938477073?tag=dsebastien00-20"
        },
        {
            "title": "Right Concentration by Leigh Brasington",
            "url": "https://www.amazon.com/dp/161180871X?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Samadhi - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Samadhi",
            "type": "website"
        },
        {
            "title": "Dhyāna in Buddhism - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Dhy%C4%81na_in_Buddhism",
            "type": "website"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/l/knowii-journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-30",
    "dateModified": "2025-12-30"
}
