{
    "id": "sapere-aude",
    "name": "Sapere Aude",
    "summary": "The Latin phrase meaning 'dare to know' - courage to use one's own understanding.",
    "explanation": "Sapere aude (Latin for 'dare to know' or 'dare to be wise') is a phrase from Horace, later used by Kant as the motto of the Enlightenment. The concept involves: having courage to think independently, not relying solely on authorities for knowledge, and trusting your own reason and investigation. Kant defined Enlightenment as emergence from self-imposed immaturity - the inability to use understanding without another's guidance. Barriers to sapere aude include: fear of being wrong, comfort in received wisdom, and social pressure to conform. The dare involves: questioning accepted beliefs, investigating for yourself, and standing by conclusions despite opposition. The concept doesn't mean rejecting all expertise but rather: engaging critically with knowledge, not accepting claims uncritically, and developing your own informed judgment. For knowledge workers, sapere aude means: questioning industry assumptions, investigating claims rather than accepting them, developing independent judgment, and having courage to voice reasoned disagreement.",
    "tags": [
        "philosophies",
        "wisdom",
        "courage",
        "thinking",
        "enlightenment"
    ],
    "category": "Concepts",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": [
        "Dare to know",
        "Dare to be wise",
        "Think for yourself"
    ],
    "relatedConcepts": [
        "critical-thinking",
        "wisdom-of-crowds"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
