{
    "id": "satori",
    "name": "Satori",
    "summary": "The Zen Buddhist concept of sudden enlightenment or awakening to true nature.",
    "explanation": "Satori is the Zen Buddhist term for sudden enlightenment or awakening - a flash of intuitive understanding of one's true nature and reality. Unlike gradual enlightenment through accumulated practice, satori is: sudden and unexpected, transformative yet momentary, and beyond intellectual understanding. Satori is not: a state to achieve and keep, understanding through thinking, or something the ego accomplishes. It often arises from: intense meditation, koan practice (paradoxical questions that exhaust conceptual mind), and ordinary moments when mind is open. Satori reveals: what was always already present, the emptiness of fixed self, and reality prior to conceptual overlay. The experience is described as: waking from a dream, seeing what was always there, and sudden clarity. Satori is both important and not - important as glimpse of true nature, unimportant as something to grasp for. For knowledge workers, satori represents: the possibility of sudden insight, the value of practices that open mind, and recognition that breakthrough understanding may come unexpectedly.",
    "tags": [
        "philosophies",
        "zen",
        "buddhism",
        "wisdom",
        "enlightenment"
    ],
    "category": "Concepts",
    "icon": "FaBolt",
    "featured": false,
    "aliases": [
        "Zen enlightenment",
        "Sudden awakening",
        "Kensho"
    ],
    "relatedConcepts": [
        "zen",
        "buddhism",
        "enlightenment",
        "mu",
        "meditation",
        "awakening"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
