{
    "id": "self-compassion",
    "name": "Self-Compassion",
    "summary": "Treating yourself with the same kindness and understanding you would offer a good friend during difficult times.",
    "explanation": "Self-compassion, as defined by researcher Kristin Neff, involves three components: self-kindness (being gentle with yourself rather than harshly self-critical), common humanity (recognizing that suffering and imperfection are shared human experiences), and mindfulness (holding painful thoughts and feelings in balanced awareness). Unlike self-esteem, which depends on success and comparison, self-compassion provides stable emotional resilience. Research shows self-compassion reduces anxiety, depression, and fear of failure while increasing motivation and well-being. Contrary to fears that it leads to complacency, self-compassionate people actually take more responsibility for mistakes and are more motivated to improve. For knowledge workers and perfectionists, self-compassion is essential for recovering from setbacks, reducing procrastination (which often stems from fear of self-criticism), and maintaining sustainable productivity.",
    "tags": [
        "psychology",
        "mental-health",
        "well-being",
        "personal-growth",
        "mindfulness"
    ],
    "category": "Concepts",
    "icon": "FaHeart",
    "featured": false,
    "aliases": [
        "Self-kindness",
        "Being kind to yourself"
    ],
    "relatedConcepts": [
        "mindfulness",
        "perfectionism",
        "resilience",
        "growth-mindset",
        "impostor-syndrome",
        "second-arrow"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Self-Compassion by Kristin Neff",
            "url": "https://amzn.to/3VhMpQ4"
        }
    ],
    "references": [
        {
            "title": "Self-compassion - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Self-compassion",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
