{
    "id": "show-dont-tell",
    "name": "Show Don't Tell",
    "summary": "Using concrete details and examples to convey meaning rather than abstract statements.",
    "explanation": "Show don't tell is the writing principle of using concrete details, examples, and scenes to convey meaning rather than abstract statements. Instead of telling readers what to think or feel, you show them evidence and let them conclude. Telling vs showing: 'She was angry' (telling) vs 'She slammed the door, her hands shaking' (showing). 'The product is innovative' (telling) vs 'It reduced processing time from hours to seconds' (showing). Why showing works: concrete details are memorable, readers engage more when they draw conclusions, showing creates vivid mental pictures, and specific evidence is more credible than assertions. When to show: emotional content (let readers feel), claims you want readers to believe, key points you want remembered, and character/product qualities. When telling is fine: transitions, background information, summaries, and when showing would be tediously long. Balance: not everything needs showing - show what matters, tell what connects. The principle applies beyond fiction: in business writing, show impact with data; in arguments, show with examples. For knowledge workers, show don't tell creates: more compelling presentations, more credible arguments, and more engaging content across all professional writing.",
    "tags": [
        "writing",
        "communication",
        "technique",
        "storytelling",
        "craft"
    ],
    "category": "Principles",
    "icon": "FaEye",
    "featured": false,
    "aliases": [
        "Concrete vs abstract",
        "Demonstrate don't assert",
        "Evidence over claims"
    ],
    "relatedConcepts": [
        "storytelling",
        "clarity-writing",
        "concrete-examples",
        "persuasion",
        "vivid-writing",
        "evidence"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
