{
    "id": "sitting-with-discomfort",
    "name": "Sitting with Discomfort",
    "summary": "Building capacity to tolerate unpleasant experiences without immediately reacting or escaping.",
    "explanation": "Sitting with discomfort is the practice of staying present with uncomfortable experiences - physical sensations, emotions, or thoughts - without immediately trying to fix, escape, or distract from them. Modern life offers endless ways to avoid discomfort (snacking, scrolling, numbing), but avoiding discomfort has costs: it prevents growth, limits resilience, and often leads to greater suffering through avoidance behaviors. The practice involves: noticing discomfort arising, resisting the urge to immediately react, observing the discomfort with curiosity, and watching it naturally change and often pass. This builds distress tolerance, reveals that most discomfort is survivable, and breaks automatic reactivity patterns. For knowledge workers, sitting with discomfort helps: persist through challenging projects, handle difficult conversations, manage anxiety without avoidance, and develop emotional resilience.",
    "tags": [
        "mindfulness",
        "resilience",
        "emotional-regulation",
        "psychology",
        "growth"
    ],
    "category": "Techniques",
    "icon": "FaCouch",
    "featured": false,
    "aliases": [
        "Discomfort tolerance",
        "Tolerating distress"
    ],
    "relatedConcepts": [
        "equanimity",
        "radical-acceptance",
        "resilience",
        "comfort-zone",
        "urge-surfing",
        "delayed-gratification"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
