{
    "id": "skin-in-the-game",
    "name": "Skin in the Game",
    "summary": "Having personal stake in outcomes leads to better decision-making and ensures accountability.",
    "explanation": "Skin in the Game is a concept popularized by Nassim Nicholas Taleb that describes the alignment of incentives when decision-makers bear the consequences of their actions. When someone has skin in the game, they share both the upside and downside risks of their decisions. This creates a powerful accountability mechanism that has been recognized throughout history - from Hammurabi's Code (where builders were killed if their structures collapsed) to modern venture capitalists who invest their own money alongside their funds.\n\nThe absence of skin in the game creates dangerous asymmetries. When advisors, managers, or policymakers can benefit from risks while offloading downsides to others, their incentives become misaligned with those they serve. Taleb argues this was a root cause of the 2008 financial crisis, where bankers profited from risky bets while taxpayers absorbed the losses. The concept extends beyond finance to any domain where principals delegate decisions to agents - including medicine, consulting, journalism, and public policy.\n\nAs a mental model, Skin in the Game provides a powerful filter for evaluating advice and institutions. Ask: does this person face consequences if their recommendations fail? The model also guides personal ethics - taking ownership of your decisions and their outcomes, rather than externalizing costs to others. This principle suggests that the most trustworthy guidance comes from those who practice what they preach and who would be personally affected by the advice they give.",
    "tags": [
        "mental-model",
        "thinking",
        "systems-thinking",
        "incentives",
        "decision-making",
        "ethics"
    ],
    "category": "Principles",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": [
        "Having skin in the game",
        "Personal stake",
        "Risk sharing"
    ],
    "relatedConcepts": [
        "black-swan",
        "lindy-effect",
        "reversible-vs-irreversible-decisions",
        "decision-fatigue"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Skin in the Game by Nassim Nicholas Taleb",
            "url": "https://www.amazon.com/dp/042528462X?tag=dsebastien00-20"
        },
        {
            "title": "Antifragile by Nassim Nicholas Taleb",
            "url": "https://www.amazon.com/dp/0812979680?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Skin in the Game (book) - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Skin_in_the_Game_(book)",
            "type": "website"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-27",
    "dateModified": "2025-12-28"
}
