{
    "id": "solid-principles",
    "name": "SOLID Principles",
    "summary": "Five fundamental design principles for creating maintainable, scalable, and flexible object-oriented software systems.",
    "explanation": "SOLID is an acronym representing five core principles of object-oriented programming and design, introduced by Robert C. Martin (Uncle Bob). These principles guide developers in creating software that is easy to maintain, extend, and refactor.\n\n**Single Responsibility Principle (SRP)**: A class should have only one reason to change, meaning it should have only one job or responsibility. This keeps classes focused and makes them easier to understand, test, and maintain.\n\n**Open-Closed Principle (OCP)**: Software entities (classes, modules, functions) should be open for extension but closed for modification. You should be able to add new functionality without changing existing code, typically achieved through abstraction and polymorphism.\n\n**Liskov Substitution Principle (LSP)**: Objects of a superclass should be replaceable with objects of its subclasses without affecting the correctness of the program. Subtypes must be substitutable for their base types without altering desirable properties.\n\n**Interface Segregation Principle (ISP)**: No client should be forced to depend on methods it does not use. Instead of one large interface, many smaller, specific interfaces are preferable, allowing clients to only know about the methods that are relevant to them.\n\n**Dependency Inversion Principle (DIP)**: High-level modules should not depend on low-level modules; both should depend on abstractions. Abstractions should not depend on details; details should depend on abstractions. This promotes loose coupling and makes systems more flexible.\n\nTogether, these principles help developers avoid code smells, reduce technical debt, and build systems that can evolve gracefully over time. They are foundational to many modern software architecture patterns and practices.",
    "tags": [
        "software-development",
        "design-patterns",
        "object-oriented",
        "principles",
        "architecture",
        "clean-code",
        "maintainability"
    ],
    "category": "Principles",
    "icon": "FaCubes",
    "featured": false,
    "aliases": [
        "SOLID",
        "SOLID Design Principles"
    ],
    "relatedConcepts": [
        "dry-principle",
        "kiss-principle",
        "yagni"
    ],
    "relatedNotes": [],
    "articles": [
        {
            "title": "SOLID: The First 5 Principles of Object Oriented Design",
            "url": "https://www.digitalocean.com/community/conceptual-articles/s-o-l-i-d-the-first-five-principles-of-object-oriented-design",
            "type": "websites"
        },
        {
            "title": "SOLID Principles - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/SOLID",
            "type": "websites"
        }
    ],
    "references": [
        {
            "title": "Clean Architecture: A Craftsman's Guide to Software Structure and Design",
            "url": "https://www.amazon.com/Clean-Architecture-Craftsmans-Software-Structure/dp/0134494164",
            "type": "book"
        },
        {
            "title": "Agile Software Development, Principles, Patterns, and Practices",
            "url": "https://www.amazon.com/Software-Development-Principles-Patterns-Practices/dp/0135974445",
            "type": "book"
        },
        {
            "title": "Dev Concepts",
            "url": "https://dev-concepts.dev",
            "type": "other"
        }
    ],
    "tutorials": [
        {
            "title": "SOLID Principles in 100 Seconds",
            "url": "https://www.youtube.com/watch?v=MSq_DCRxOxw",
            "type": "video"
        }
    ]
}
