{
    "id": "sophrosyne",
    "name": "Sophrosyne",
    "summary": "The Greek virtue of moderation, self-control, and temperance.",
    "explanation": "Sophrosyne is an ancient Greek virtue meaning moderation, self-control, temperance, and sound-mindedness. It involves: restraint of appetite and impulse, moderation in all things, and knowing one's limits and proper place. For the Greeks, sophrosyne was essential to: individual wellbeing, social harmony, and avoiding hubris (arrogant overreach). The concept includes: knowing yourself (recognizing your limitations), controlling impulses (not being driven by desires), and acting moderately (avoiding extremes). Sophrosyne contrasts with: excess (too much of anything), impulsiveness (acting on every urge), and hubris (thinking yourself above limits). The virtue enables: sustainable living (not burning out), social harmony (not overreaching), and wisdom (clear thinking uncluttered by desire). In modern terms, sophrosyne relates to: self-regulation, emotional intelligence, and delayed gratification. For knowledge workers, sophrosyne means: moderating workload to sustainable levels, controlling impulses toward distraction, and maintaining balance rather than extremes in work and life.",
    "tags": [
        "philosophies",
        "virtue",
        "wisdom",
        "moderation",
        "self-control"
    ],
    "category": "Concepts",
    "icon": "FaBalanceScale",
    "featured": false,
    "aliases": [
        "Temperance",
        "Moderation",
        "Self-control"
    ],
    "relatedConcepts": [
        "virtue",
        "moderation",
        "golden-mean",
        "self-control",
        "balance",
        "cardinal-virtues"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
