{
    "id": "sources-of-advantages",
    "name": "Sources of Advantages",
    "summary": "The key factors that create competitive advantage: talent, hard work, curiosity, energy, temperament, and partner.",
    "explanation": "Shane Parrish identified six key sources of advantage that contribute to success. Understanding these helps you identify where to invest your development efforts and recognize your existing strengths.\n\n**1. Talent**\nNatural abilities and aptitudes you were born with or developed early. These are your innate advantages.\n\n**2. Hard Work**\nThe willingness to put in sustained effort over time. This is often the great equalizer - hard work can compensate for lesser talent.\n\n**3. Curiosity**\nThe drive to learn, explore, and understand. Curious people continuously expand their capabilities and spot opportunities others miss.\n\n**4. Energy**\nPhysical and mental vitality. High energy enables more output, faster learning, and greater persistence.\n\n**5. Temperament**\nKeeping your head when everyone is losing theirs. Emotional stability and composure under pressure create advantages in crisis situations.\n\n**6. Partner**\nWho you choose to work and live with. The right partner multiplies your capabilities; the wrong one diminishes them.\n\n**Using this framework:**\n\n- Audit which sources are your current strengths\n- Identify which sources need development\n- Recognize that you don't need all six to succeed\n- Remember that different endeavors weight these differently\n\nAdvantage compounds: strength in one area often enables development in others.",
    "tags": ["success", "personal-development", "advantages", "strategy", "self-awareness"],
    "category": "Frameworks",
    "icon": "FaLayerGroup",
    "featured": false,
    "aliases": ["Competitive Advantages", "Success Factors"],
    "relatedConcepts": [
        "unfair-advantage",
        "t-shaped-skills",
        "growth-mindset",
        "luck-surface-area"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/32+Literature+notes/32.02+Content/Sources+of+advantages"
    ],
    "articles": [],
    "references": [],
    "tutorials": []
}
