{
    "id": "sparketype",
    "name": "Sparketype Assessment",
    "summary": "A personality assessment that identifies the nature of work most meaningful to you, at the intersection of passion and purpose.",
    "explanation": "The Sparketype assessment, developed by Jonathan Fields, aims to identify the nature of work that is most meaningful for you. It operates at the intersection of passion and purpose, helping you understand what type of work allows you to fully express your talents and get into flow more easily.\n\nFields identified 10 distinct Sparketypes, each representing a different way people find meaning and fulfillment in their work:\n\n1. **The Maven**: Loves the process of learning and mastering new skills and knowledge. Mavens are perpetual students driven by curiosity.\n\n2. **The Maker**: Finds joy in creating things from nothing, bringing ideas into physical form. Whether it's art, code, or products, Makers need to build.\n\n3. **The Scientist**: Driven by curiosity, loves figuring out how things work. Scientists thrive on solving puzzles and discovering answers.\n\n4. **The Essentialist**: Finds meaning in creating order, clarity, and simplicity from chaos and complexity. They distill things to their core.\n\n5. **The Performer**: Comes alive when engaging and energizing others through dynamic interaction and presence.\n\n6. **The Sage**: Fulfilled by teaching and sharing wisdom with others. Unlike Mavens who learn for themselves, Sages learn to illuminate paths for others.\n\n7. **The Warrior**: Thrives on gathering and organizing people around a common cause or mission. Warriors build and lead movements.\n\n8. **The Advisor**: Finds purpose in guiding, mentoring, and counseling others through challenges and decisions.\n\n9. **The Advocate**: Driven to champion ideas, people, or causes. They amplify and defend what they believe in.\n\n10. **The Nurturer**: Fulfilled by caring for and elevating others, helping them grow, heal, and thrive.\n\nUnderstanding your Sparketype helps you make better career decisions, structure your work for more satisfaction, and recognize why certain tasks energize you while others drain you. The assessment reveals not just your primary Sparketype but also your Shadow (what gives you secondary energy) and Anti-Sparketype (what drains you).",
    "tags": [
        "self-discovery",
        "careers",
        "personality",
        "purpose",
        "assessments",
        "work",
        "flow",
        "meaningful-work"
    ],
    "category": "Frameworks",
    "icon": "FaFire",
    "featured": false,
    "aliases": [
        "Sparketype",
        "Sparketypes",
        "Sparketype Test",
        "Sparked Assessment"
    ],
    "relatedConcepts": [
        "flow-state",
        "ikigai"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Sparketype+assessment"
    ],
    "articles": [
        {
            "title": "Sparketype.com",
            "url": "https://sparketype.com/",
            "type": "websites"
        }
    ],
    "books": [
        {
            "title": "Sparked: Discover Your Unique Imprint for Work that Makes You Come Alive",
            "url": "https://amzn.to/3ZIHpmG"
        }
    ],
    "references": [
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [
        {
            "title": "Take the Sparketype Assessment",
            "url": "https://sparketype.com/sparketest/",
            "type": "websites"
        }
    ],
    "datePublished": "2025-12-26",
    "dateModified": "2025-12-28"
}
