{
    "id": "stoic-exercises",
    "name": "Stoic Exercises",
    "summary": "Practical techniques from Stoic philosophy for building resilience and wisdom.",
    "explanation": "Stoic exercises are practical techniques developed by ancient Stoic philosophers for building character, resilience, and wisdom in daily life. Key exercises include: morning preparation (contemplating the day's challenges), evening review (examining the day's actions and reactions), premeditatio malorum (negative visualization), voluntary discomfort (occasionally practicing hardship), the view from above (gaining perspective through imagining a cosmic view), and the discipline of desire (wanting only what is within our control). These exercises share common principles: focus on what's controllable, acceptance of what isn't, and continuous self-examination. Modern Stoic practitioners often incorporate: journaling, meditation, and deliberate practice of preferred responses to common situations. The exercises are designed to be practical - not abstract philosophy but concrete daily practices. Research suggests these exercises can reduce anxiety, increase resilience, and improve emotional regulation. For knowledge workers, Stoic exercises offer: practical tools for handling workplace stress, frameworks for responding to setbacks, and methods for maintaining equanimity amid uncertainty.",
    "tags": [
        "philosophies",
        "stoicism",
        "wisdom",
        "practices",
        "self-improvement"
    ],
    "category": "Techniques",
    "icon": "FaDumbbell",
    "featured": false,
    "aliases": [
        "Stoic practices",
        "Stoic techniques",
        "Stoic disciplines"
    ],
    "relatedConcepts": [
        "stoicism",
        "premeditatio-malorum",
        "amor-fati",
        "journaling",
        "self-examination",
        "resilience"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "The Daily Stoic by Ryan Holiday",
            "url": "https://amzn.to/3Dp09NT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
