{
    "id": "stoic-values",
    "name": "Stoic Values",
    "summary": "The four cardinal virtues of Stoicism: wisdom, courage, justice, and temperance.",
    "explanation": "Stoic values center on four cardinal virtues that the Stoics considered essential for a good life. These virtues were seen as interconnected - you can't truly have one without the others. The four cardinal virtues: Wisdom (sophia) - knowing what is truly good, bad, or indifferent; making sound judgments; understanding what's within your control. Courage (andreia) - facing difficulties and fears; speaking truth; persisting despite adversity; moral courage, not just physical. Justice (dikaiosyne) - treating others fairly; fulfilling social duties; contributing to community; acting with integrity. Temperance (sophrosyne) - self-control and moderation; mastering desires; avoiding excess; balanced approach to pleasures. Why virtues matter: for Stoics, virtue is the only true good (external things are 'indifferent'), virtuous action leads to eudaimonia (flourishing), and character is built through consistent practice of virtues. Living by Stoic values: ask 'what would a wise/courageous/just/temperate person do?', treat each situation as opportunity to practice virtue, and measure success by character, not outcomes. For knowledge workers, Stoic values provide: ethical framework for decisions, focus on what you can control (your character), and timeless guidance for professional and personal life.",
    "tags": [
        "philosophies",
        "stoicism",
        "values",
        "virtue",
        "ethics"
    ],
    "category": "Concepts",
    "icon": "FaBalanceScale",
    "featured": false,
    "aliases": [
        "Cardinal virtues",
        "Stoic virtues",
        "Four virtues"
    ],
    "relatedConcepts": [
        "stoicism",
        "neostoicism",
        "wisdom-of-crowds"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Meditations by Marcus Aurelius",
            "url": "https://amzn.to/3Dp09NT"
        }
    ],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
