{
    "id": "stress-inoculation",
    "name": "Stress Inoculation",
    "summary": "Controlled exposure to manageable stress to build tolerance and coping skills for future challenges.",
    "explanation": "Stress inoculation is the practice of deliberately exposing yourself to controlled, manageable stress to build tolerance and coping skills for handling larger challenges. Like a vaccine introduces weakened pathogens to build immunity, stress inoculation introduces moderate stress to build psychological resilience. Developed by Donald Meichenbaum as Stress Inoculation Training (SIT), it's used in military training, sports psychology, and anxiety treatment. Key principles: gradual exposure (start small and increase), maintaining sense of control, developing coping strategies, building confidence through mastery, and processing experiences afterward. For knowledge workers, stress inoculation might include: practicing presentations in increasingly challenging settings, taking on slightly beyond-comfort projects, simulating high-pressure scenarios, or intentionally adding constraints to build adaptability. The key is dosage - enough stress to grow, not so much as to overwhelm.",
    "tags": [
        "stresses",
        "resilience",
        "psychology",
        "training",
        "coping"
    ],
    "category": "Techniques",
    "icon": "FaShieldAlt",
    "featured": false,
    "aliases": [
        "Stress inoculation training",
        "SIT",
        "Stress vaccination"
    ],
    "relatedConcepts": [
        "resilience",
        "comfort-zone",
        "deliberate-practice",
        "eustress"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
