{
    "id": "success-identity",
    "name": "Success Identity",
    "summary": "Seeing yourself as someone who succeeds - identity-level belief in your capacity for achievement.",
    "explanation": "Success identity is the internalized belief that you are someone who succeeds - not that you occasionally achieve things, but that success is part of who you are. This identity-level belief shapes behavior: people with a success identity take more action, persist longer, recover faster from setbacks, and interpret challenges differently. It's the opposite of learned helplessness or a failure identity. Building a success identity involves: accumulating evidence of success (even small wins count), reframing setbacks as learning rather than confirmation of inability, surrounding yourself with successful people (identity is socially influenced), and consciously identifying as 'someone who succeeds at X.' The key insight from James Clear's Atomic Habits applies here: every action is a vote for the identity you want to embody. For knowledge workers, cultivating a success identity provides psychological fuel for ambitious goals.",
    "tags": [
        "success",
        "identity",
        "mindset",
        "psychology",
        "beliefs"
    ],
    "category": "Concepts",
    "icon": "FaUserCheck",
    "featured": false,
    "aliases": [
        "Winner identity",
        "Achiever identity"
    ],
    "relatedConcepts": [
        "identity-based-habits",
        "self-efficacy",
        "growth-mindset",
        "limiting-beliefs",
        "success-spiral",
        "self-concept"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Atomic Habits by James Clear",
            "url": "https://amzn.to/3ZqkV2t",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
