{
    "id": "success-invites-success",
    "name": "Success Invites Success",
    "summary": "When you succeed once, you become more likely to succeed again, creating a virtuous circle through the compound effect.",
    "explanation": "Success invites success is a principle that describes how achievement creates momentum for more achievement. When we succeed once, we become more likely to succeed again, creating a virtuous circle.\n\nThis happens through multiple mechanisms:\n\n**Confidence builds**: Success proves to yourself that you can achieve things, reducing self-doubt for future attempts.\n\n**Skills compound**: Each success teaches lessons and builds capabilities that make the next challenge easier.\n\n**Reputation grows**: Others notice your track record, creating more opportunities.\n\n**Resources accumulate**: Success often brings resources (money, connections, knowledge) that enable bigger endeavors.\n\n**Momentum is real**: The psychological and practical advantages of winning create forward motion that's easier to maintain than to start.\n\nThis is the compound effect applied to achievement. Small wins lead to bigger wins, which lead to even bigger ones.\n\n**How to leverage this principle:**\n\n- Start small to create your first wins\n- Celebrate successes to reinforce the pattern\n- Build on what's working rather than constantly starting over\n- Recognize that early struggles are investment in future momentum\n\nThe flip side is also true: failure can breed failure through a vicious cycle. That's why starting small and building gradually is so powerful - it lets you establish the virtuous circle before tackling bigger challenges.",
    "tags": [
        "successes",
        "compound-growth",
        "momentum",
        "virtuous-circle",
        "mindsets"
    ],
    "category": "Principles",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": [
        "Success Breeds Success",
        "Winning Momentum"
    ],
    "relatedConcepts": [
        "compound-growth",
        "virtuous-circle",
        "start-small",
        "small-wins",
        "matthew-effect"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Success+invites+success"
    ],
    "articles": [],
    "references": [
        {
            "title": "The Matthew Effect: Accumulated Advantage - Farnam Street",
            "url": "https://fs.blog/the-matthew-effect/",
            "type": "website"
        },
        {
            "title": "Success and Motivation: The Virtuous Cycle - Psychology Today",
            "url": "https://www.psychologytoday.com/us/blog/the-right-mindset/201603/success-and-motivation",
            "type": "website"
        },
        {
            "title": "The Power of Small Wins - Harvard Business Review",
            "url": "https://hbr.org/2011/05/the-power-of-small-wins",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-26",
    "dateModified": "2025-12-29"
}
