{
    "id": "sustainable-success",
    "name": "Sustainable Success",
    "summary": "Achieving and maintaining success without burning out or sacrificing wellbeing and relationships.",
    "explanation": "Sustainable success means achieving meaningful accomplishments while maintaining health, relationships, and wellbeing over the long term. It contrasts with success achieved through unsustainable means - chronic overwork, neglected relationships, or depleted health - that eventually extracts a cost. Key elements include: pacing (marathons not sprints), recovery (building rest into success strategies), alignment (pursuing success that matches values), relationships (success that strengthens rather than strains connections), and health (physical and mental resources for continued achievement). Sustainable success often requires: saying no to opportunities, accepting slower growth for greater longevity, and redefining success beyond achievement. For knowledge workers, sustainable success means: building systems rather than relying on heroics, maintaining energy reserves, and treating wellbeing as a strategic asset rather than an obstacle to achievement.",
    "tags": [
        "success",
        "wellbeing",
        "work-life-balance",
        "burnout",
        "longevity"
    ],
    "category": "Concepts",
    "icon": "FaLeaf",
    "featured": false,
    "aliases": [
        "Long-term success",
        "Balanced success"
    ],
    "relatedConcepts": [
        "burnout",
        "work-life-balance",
        "energy-management",
        "essentialism",
        "recovery",
        "success-without-fulfillment"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
