{
    "id": "take-blame-distribute-praise",
    "name": "Take Blame, Distribute Praise",
    "summary": "A leadership principle where you absorb responsibility for failures and share credit for successes with your team.",
    "explanation": "Take all the blame, distribute all the praise is a powerful principle for leadership, consulting, and professional relationships. It recognizes that how you handle success and failure shapes your reputation and relationships more than the outcomes themselves.\n\n**When Things Go Wrong**:\n\nIf a project does not go as planned, take the blame. As an external consultant or leader, it doesn't ultimately matter whether the failure was \"your fault\" - someone needs to be accountable. By accepting responsibility:\n\n- You demonstrate integrity and professionalism\n- You protect your team and preserve their morale\n- Even if they don't hire you again, they will respect you\n- Others will speak positively about your character when asked\n\n**When Things Go Right**:\n\nIf you succeed, spread the praise. Give credit to your team, your clients, and everyone who contributed. By sharing success:\n\n- They feel good about their own contributions\n- They associate positive feelings with working with you\n- They naturally talk about their success, which includes you\n- Word of mouth referrals follow\n\n**The Strategic Reality**:\n\nThis approach may seem thankless, but it's strategically sound. Deflecting blame damages relationships and reputation. Hoarding credit prevents others from feeling ownership. The counterintuitive truth is that taking blame and sharing praise actually enhances your standing over time.\n\n**Applications**:\n\n- Consulting and client relationships\n- Team leadership and management\n- Freelancing and client work\n- Any collaborative professional context",
    "tags": [
        "leadership",
        "consulting",
        "management",
        "humility",
        "teamwork"
    ],
    "category": "Principles",
    "icon": "FaHandshake",
    "featured": false,
    "aliases": [
        "Take All The Blame, Distribute All The Praise"
    ],
    "relatedConcepts": [
        "leaders-vs-bosses",
        "radical-ownership"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/33+Permanent+notes/33.02+Content/Take+all+the+blame,+distribute+all+the+praise"
    ],
    "articles": [],
    "references": [
        {
            "title": "Extreme Ownership: How U.S. Navy SEALs Lead and Win - Jocko Willink",
            "url": "https://echelonfront.com/extreme-ownership/",
            "type": "website"
        },
        {
            "title": "Good Leaders Take Blame, Give Credit - Inc.",
            "url": "https://www.inc.com/lolly-daskal/good-leaders-take-blame-and-give-credit.html",
            "type": "website"
        },
        {
            "title": "The Psychology of Giving Credit vs. Taking Credit - Forbes",
            "url": "https://www.forbes.com/sites/forbescoachescouncil/2018/07/23/the-power-of-giving-credit-where-credit-is-due/",
            "type": "website"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-26",
    "dateModified": "2025-12-29"
}
