{
    "id": "technostress",
    "name": "Technostress",
    "summary": "Stress caused by technology use, constant connectivity, and the pressure to keep up with digital demands.",
    "explanation": "Technostress describes the negative psychological and physiological effects of technology use, including anxiety, exhaustion, and reduced job satisfaction related to digital tools. First coined in the 1980s, it's become increasingly relevant in the age of smartphones and remote work. Sources include: techno-overload (too much information and too many tools), techno-invasion (work bleeding into personal time via devices), techno-complexity (difficulty keeping up with changing technology), techno-insecurity (fear of being replaced by technology or those who use it better), and techno-uncertainty (constant platform changes). Symptoms include: anxiety about connectivity, compulsive checking behaviors, difficulty disconnecting, and paradoxically using technology for stress relief from technology-caused stress. For knowledge workers, managing technostress requires: intentional boundaries, digital minimalism practices, and recognizing that constant availability isn't sustainable.",
    "tags": [
        "stress",
        "technology",
        "productivity",
        "mental-health",
        "work"
    ],
    "category": "Concepts",
    "icon": "FaLaptop",
    "featured": false,
    "aliases": [
        "Technology stress",
        "Digital stress",
        "Tech anxiety"
    ],
    "relatedConcepts": [
        "digital-minimalism",
        "information-overload",
        "burnout",
        "work-life-balance",
        "notification-fatigue",
        "continuous-partial-attention"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Digital Minimalism by Cal Newport",
            "url": "https://amzn.to/3ZpQNpo",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
