{
    "id": "ten-percent-target",
    "name": "The 10 Percent Target",
    "summary": "Whatever you want most in life, make 10 attempts - getting comfortable with failing 90% of the time builds resilience and skill.",
    "explanation": "The 10 Percent Target is a simple rule for pursuing goals: whatever you want most in life, make 10 attempts at it.\n\nThis approach serves multiple purposes:\n\n**1. Normalizes failure**: By planning for 10 attempts, you expect to fail most of the time. A 10% success rate becomes acceptable, even expected.\n\n**2. Builds resilience**: Each failed attempt is practice in handling rejection, disappointment, and setback. You develop emotional muscle.\n\n**3. Improves through iteration**: Each attempt teaches something. By attempt #10, you're far more skilled than at attempt #1.\n\n**4. Increases luck surface area**: More attempts mean more chances for something to work. You can't win if you don't play.\n\n**5. Reduces pressure**: When one attempt isn't your only shot, you can be bolder and more creative.\n\n**Practical application:**\n\n- Want to get published? Submit to 10 places\n- Want a new job? Apply to 10 companies\n- Want to start a business? Try 10 ideas\n- Want to learn a skill? Commit to 10 practice sessions before judging yourself\n\nThe 10 Percent Target transforms intimidating goals into manageable experiments. You're not trying to succeed once - you're trying to learn from 10 attempts, knowing success might come on any of them.\n\nIdea attributed to Jennifer Cohen.",
    "tags": ["success", "resilience", "failure", "goals", "mindset"],
    "category": "Techniques",
    "icon": "FaLightbulb",
    "featured": false,
    "aliases": ["10% Rule", "Ten Attempts Rule"],
    "relatedConcepts": ["failing-forward", "luck-surface-area", "pauling-principle", "persistence"],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/32+Literature+notes/32.02+Content/The+10+percent+target"
    ],
    "articles": [],
    "references": [
        {
            "title": "Jennifer Cohen - The 10 Percent Target",
            "url": "https://www.youtube.com/watch?v=wM82hE6oimw",
            "type": "video"
        }
    ],
    "tutorials": []
}
