{
    "id": "thank-you-notes",
    "name": "Thank You Notes",
    "summary": "Brief written expressions of gratitude for specific actions, gifts, or kindnesses.",
    "explanation": "Thank you notes are brief written expressions of gratitude for specific actions, gifts, or kindnesses received. While seemingly old-fashioned, research shows thank you notes significantly impact both writer and recipient. Effective thank you notes include: specific acknowledgment (what you're thanking for), personal impact (how it affected you), and genuine emotion (authentic appreciation). Notes can be: handwritten (most personal), email (faster, still meaningful), or digital (cards, messages). The practice benefits: recipients (feeling valued and seen), relationships (strengthening connection), and writers (practicing gratitude, building relationship capital). Research shows people underestimate how much recipients appreciate thank you notes, leading to under-expression. Notes are appropriate for: gifts received, help provided, hospitality experienced, and mentorship given. For knowledge workers, thank you notes can: strengthen professional relationships, acknowledge colleague contributions, express appreciation to mentors, and build reputation as someone who values others' contributions.",
    "tags": [
        "gratitude",
        "communications",
        "relationships",
        "etiquette",
        "expression"
    ],
    "category": "Techniques",
    "icon": "FaEnvelopeOpenText",
    "featured": false,
    "aliases": [
        "Thank-you cards",
        "Appreciation notes",
        "Written thanks"
    ],
    "relatedConcepts": [
        "expressing-gratitude",
        "gratitude-letters",
        "gratitude-practice",
        "social-capital"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
