{
    "id": "theological-virtues",
    "name": "Theological Virtues",
    "summary": "The three Christian virtues of faith, hope, and charity/love.",
    "explanation": "The Theological Virtues are three virtues in Christian thought that relate directly to God: Faith (fides) - trust in God and acceptance of divine revelation; Hope (spes) - confident expectation of divine blessing and eternal life; Charity/Love (caritas) - love of God and neighbor as primary motivation. Unlike cardinal virtues (achievable through human effort), theological virtues are seen as: divinely infused, relating to supernatural ends, and foundational to Christian life. They complement the cardinal virtues - prudence, justice, temperance, fortitude need to be informed by faith, hope, and love. The three are interconnected: faith grounds hope, hope sustains faith, and love is greatest of all (as Paul wrote, 'the greatest of these is love'). Beyond theological context, the virtues offer: model for trust and commitment, framework for hope amid difficulty, and emphasis on love as primary motivation. For knowledge workers, these virtues suggest: developing trust in values beyond immediate results, maintaining hope in difficult projects, and leading and relating through genuine care.",
    "tags": [
        "philosophies",
        "christianity",
        "virtue",
        "ethics",
        "spirituality"
    ],
    "category": "Frameworks",
    "icon": "FaHeart",
    "featured": false,
    "aliases": [
        "Faith hope and charity",
        "Christian virtues",
        "Infused virtues"
    ],
    "relatedConcepts": [
        "virtue",
        "cardinal-virtues",
        "faith",
        "hope",
        "love",
        "ethics"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
