{
    "id": "this-too-shall-pass",
    "name": "This Too Shall Pass",
    "summary": "Ancient wisdom reminding us of the impermanence of all states, both good and bad.",
    "explanation": "This too shall pass is an ancient adage appearing in Persian, Jewish, and other wisdom traditions, reminding us that all states are temporary - both suffering and joy. The wisdom serves dual purposes: during difficulty, it provides comfort (pain will end); during pleasure, it counsels humility (good times won't last forever). The phrase embodies: recognition of impermanence as fundamental reality, perspective that current states are not permanent, and equanimity arising from this understanding. The teaching helps: in suffering (providing hope), in success (preventing arrogance), in attachment (reminding of transience), and in anxiety (contextualizing current concerns). The wisdom differs from: pessimism (it applies equally to good and bad), dismissiveness (current states still matter), and passivity (action is still appropriate). Understanding impermanence actually increases appreciation - knowing something will end makes it more precious. For knowledge workers, this wisdom helps: maintain perspective during setbacks, stay humble during successes, and maintain equanimity across the inevitable fluctuations of work and career.",
    "tags": [
        "philosophies",
        "wisdom",
        "impermanence",
        "perspectives",
        "resilience"
    ],
    "category": "Concepts",
    "icon": "FaInfinity",
    "featured": false,
    "aliases": [
        "Impermanence of states",
        "All things pass",
        "Transience wisdom"
    ],
    "relatedConcepts": [
        "impermanence",
        "equanimity",
        "resilience",
        "wisdom-of-crowds"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
