{
    "id": "threshold-concepts",
    "name": "Threshold Concepts",
    "summary": "Transformative ideas that open new ways of thinking - once crossed, you can't go back.",
    "explanation": "Threshold concepts are transformative, integrative ideas that, once understood, fundamentally change how you see a subject - like passing through a doorway into a new room. Identified by Meyer and Land, these concepts are: transformative (shift perspective), irreversible (hard to unlearn once grasped), integrative (reveal connections), bounded (define discipline borders), and often troublesome (counterintuitive or alien initially). Examples include: opportunity cost in economics, evolution in biology, object-oriented thinking in programming. Before crossing a threshold, learners often get stuck in 'liminal space' - a state of uncertainty and confusion that's uncomfortable but necessary. For knowledge workers, identifying threshold concepts in their field helps prioritize learning and understand why certain ideas feel like breakthroughs. Recognizing you're in liminal space provides reassurance that confusion is part of the process.",
    "tags": [
        "learning",
        "education",
        "cognition",
        "transformation",
        "understanding"
    ],
    "category": "Concepts",
    "icon": "FaDoorOpen",
    "featured": false,
    "aliases": [
        "Gateway concepts",
        "Portal concepts"
    ],
    "relatedConcepts": [
        "troublesome-knowledge",
        "paradigm-shifts",
        "first-principles",
        "mental-models",
        "aha-moment"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/l/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/l/knowledge-management-for-beginners",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
