{
    "id": "time-freedom",
    "name": "Time Freedom",
    "summary": "The ability to choose how you spend your time without external constraints or demands.",
    "explanation": "Time freedom is the ability to decide how you spend your time based on your values and preferences rather than external requirements. It's about autonomy over schedule - being able to work when you're productive, rest when needed, and pursue what matters without asking permission. Time freedom differs from having free time (empty hours) - it's about control over all your hours, including work time. Elements include: flexible schedules, location independence, minimal mandatory meetings, and the ability to say no without consequence. Time freedom trades off with other values: high income often requires schedule constraints, team collaboration needs some synchronization, and complete freedom can lack structure. Many pursue financial independence precisely for time freedom - the money is means, not end. For knowledge workers, increasing time freedom might mean: negotiating flexibility, building businesses with control, reducing lifestyle to reduce required income, or designing roles with autonomy.",
    "tags": [
        "time",
        "freedom",
        "autonomy",
        "lifestyle",
        "life-design"
    ],
    "category": "Concepts",
    "icon": "FaDove",
    "featured": false,
    "aliases": [
        "Schedule freedom",
        "Temporal autonomy",
        "Time independence"
    ],
    "relatedConcepts": [
        "time-wealth",
        "autonomy",
        "financial-independence",
        "remote-work",
        "lifestyle-design",
        "freedom"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
