{
    "id": "time-boxing",
    "name": "Time Boxing",
    "summary": "Allocating a fixed time period to an activity, then stopping when time expires.",
    "explanation": "Time boxing is the practice of allocating a fixed, maximum time to an activity and stopping when the time expires, regardless of completion status. Unlike estimated duration (which often extends), a time box is a hard constraint. Benefits include: preventing perfectionism and over-engineering, creating urgency that improves focus, forcing prioritization within constraints, and ensuring one activity doesn't consume entire days. Time boxing leverages Parkinson's Law - work expands to fill available time - by limiting that time. It's especially useful for: tasks prone to expansion (research, editing), activities that could go indefinitely (learning, improvement), and when you need to make progress on multiple fronts. The key is treating the time box as a firm commitment, not a suggestion. For knowledge workers, time boxing helps: ship imperfect work rather than perfect nothing, maintain balance across responsibilities, and build accurate time intuition through practice.",
    "tags": [
        "time",
        "productivity",
        "focus",
        "constraints",
        "techniques"
    ],
    "category": "Techniques",
    "icon": "FaStopwatch",
    "featured": false,
    "aliases": [
        "Timeboxing",
        "Fixed time blocks",
        "Constrained time"
    ],
    "relatedConcepts": [
        "parkinsons-law",
        "pomodoro-technique",
        "constraints",
        "deadline-effect",
        "time-blocking",
        "perfectionism"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
