{
    "id": "top-down-attention",
    "name": "Top-Down Attention",
    "summary": "Voluntary attention directed by goals, intentions, and conscious choice.",
    "explanation": "Top-down attention (also called endogenous or goal-directed attention) is the voluntary direction of attention based on goals, intentions, and conscious priorities. Unlike bottom-up attention (captured by stimuli), top-down attention is controlled - you choose what to focus on. It enables: searching for specific items, maintaining focus despite distractions, and directing cognitive resources toward priorities. Top-down attention draws on executive functions and prefrontal cortex activity. It's effortful and depletable - maintaining focus against competing stimuli requires cognitive resources that fatigue over time. Top-down attention is strengthened by: clear goals (knowing what to attend to), practice (trained attention is more stable), and reduced competition (fewer distracting stimuli). For knowledge workers, strengthening top-down attention means: clarifying priorities before starting, reducing environmental distractions, and recognizing that willpower-based focus is limited - environmental design supports what willpower cannot sustain.",
    "tags": [
        "attention",
        "cognition",
        "focus",
        "self-control",
        "psychology"
    ],
    "category": "Concepts",
    "icon": "FaArrowDown",
    "featured": false,
    "aliases": [
        "Endogenous attention",
        "Goal-directed attention",
        "Voluntary attention"
    ],
    "relatedConcepts": [
        "bottom-up-attention",
        "focus",
        "attention-management"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Attention - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Attention",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
