{
    "id": "trigger-routine-reward",
    "name": "Trigger-Routine-Reward",
    "summary": "The three-part structure of habits: cue that triggers behavior, routine performed, and reward received.",
    "explanation": "Trigger-routine-reward (or cue-routine-reward) is the three-part structure underlying all habits, as described by Charles Duhigg. The trigger (cue) prompts the behavior - it can be time, location, emotional state, preceding action, or other people. The routine is the behavior itself - physical, mental, or emotional. The reward is what the brain gets - pleasure, relief, satisfaction, or other benefit. Understanding this structure enables: diagnosing habit loops (what triggers, what's the reward?), changing habits (keep trigger and reward, change routine), and building new habits (design all three components). For habit change: identify the cue (what prompts the behavior?), identify the reward (what craving does it satisfy?), and insert a new routine that delivers the same reward. For new habits: choose a consistent trigger, design the routine, and ensure a satisfying reward. For knowledge workers, understanding habit loops helps: build productive work habits, break unproductive patterns, and design environments that trigger desired behaviors.",
    "tags": [
        "habits",
        "behaviors",
        "psychology",
        "changes",
        "productivity"
    ],
    "category": "Frameworks",
    "icon": "FaRedo",
    "featured": false,
    "aliases": [
        "Habit loop",
        "Cue-routine-reward",
        "Habit structure"
    ],
    "relatedConcepts": [
        "habits",
        "behavior-change",
        "cues",
        "rewards",
        "routines",
        "automation"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "The Power of Habit by Charles Duhigg",
            "url": "https://amzn.to/3Dp09NT",
            "type": "book"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": []
}
