{
    "id": "troublesome-knowledge",
    "name": "Troublesome Knowledge",
    "summary": "Knowledge that is conceptually difficult, counterintuitive, or challenges existing beliefs.",
    "explanation": "Troublesome knowledge refers to ideas that are particularly difficult to learn because they conflict with intuition, prior learning, or cultural beliefs. David Perkins identified several types: ritual knowledge (learned by rote without meaning), inert knowledge (known but not used), conceptually difficult (complex abstract ideas), foreign/alien knowledge (from unfamiliar perspectives), and tacit knowledge (implicit expertise hard to articulate). Troublesome knowledge often accompanies threshold concepts and requires unlearning or restructuring existing mental models. Common responses include: compartmentalizing (treating it separately from 'real' knowledge), rejection, or superficial acceptance. Effective approaches include: acknowledging the discomfort, using analogies and multiple representations, building from familiar to unfamiliar, and allowing time for conceptual change. For knowledge workers, being aware of troublesome knowledge helps explain why some learning is frustrating and requires patience.",
    "tags": [
        "learning",
        "cognition",
        "difficulty",
        "education",
        "understanding"
    ],
    "category": "Concepts",
    "icon": "FaExclamationTriangle",
    "featured": false,
    "aliases": [
        "Difficult knowledge",
        "Counterintuitive knowledge"
    ],
    "relatedConcepts": [
        "threshold-concepts",
        "unlearning",
        "cognitive-dissonance",
        "mental-models",
        "first-principles"
    ],
    "relatedNotes": [],
    "articles": [],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        },
        {
            "title": "Obsidian Starter Course",
            "url": "https://store.dsebastien.net/l/obsidian-starter-course",
            "type": "other"
        },
        {
            "title": "Knowledge Management for Beginners",
            "url": "https://store.dsebastien.net/l/knowledge-management-for-beginners",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
