{
    "id": "ubermensch",
    "name": "Übermensch",
    "summary": "Nietzsche's ideal of the self-overcoming human who creates their own values.",
    "explanation": "The Übermensch (often translated as 'Overman' or 'Superman') is Nietzsche's vision of a higher type of human who overcomes the limitations of conventional humanity. Key characteristics include: creates own values (rather than accepting inherited morality), embraces life fully (including suffering), overcomes the 'human, all too human,' and represents the 'meaning of the earth.' The Übermensch is not: a superhero or biological superior, a cruel dominator, or a racial type. Rather, it's an ideal of: self-creation and self-overcoming, living beyond slave/master morality, and finding meaning through creative expression. The concept responds to nihilism - if traditional values collapse, the Übermensch creates new values. It represents: the potential for human self-transcendence, taking responsibility for meaning-creation, and life affirmation despite suffering. For knowledge workers, the Übermensch suggests: questioning inherited assumptions, taking responsibility for values, creating meaning through work, and continual self-overcoming rather than mere success.",
    "tags": [
        "philosophies",
        "nietzsche",
        "wisdom",
        "self-transcendence",
        "values"
    ],
    "category": "Concepts",
    "icon": "FaArrowUp",
    "featured": false,
    "aliases": [
        "Overman",
        "Superman",
        "Higher human"
    ],
    "relatedConcepts": [
        "will-to-power",
        "self-transcendence",
        "meaningful-pursuits",
        "eternal-recurrence"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Thus Spoke Zarathustra by Friedrich Nietzsche",
            "url": "https://amzn.to/3Dp09NT"
        }
    ],
    "references": [
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
