{
    "id": "unknown-unknowns",
    "name": "Unknown Unknowns",
    "summary": "The category of things we don't know we don't know, representing the most challenging type of uncertainty in decision-making.",
    "explanation": "Unknown unknowns are part of a knowledge classification framework famously articulated by Donald Rumsfeld in 2002. The framework divides knowledge into three categories: known knowns (things we know we know), known unknowns (things we know we don't know), and unknown unknowns (things we don't know we don't know). Unknown unknowns represent the most challenging category because we cannot directly prepare for what we are unaware of.\n\nUnknown unknowns are particularly problematic in planning and decision-making because they represent blind spots that can lead to unexpected failures or missed opportunities. Unlike known unknowns, which we can research and plan for, unknown unknowns require different strategies to uncover and address.\n\nStrategies for dealing with unknown unknowns include: (1) Accepting that you cannot control everything and relaxing about genuinely uncontrollable factors, (2) Conducting thorough research to convert knowable unknown unknowns into known unknowns, (3) Seeking diverse perspectives from people rather than just searching for predetermined answers, and (4) Actively gathering multiple viewpoints to help expose blind spots and hidden assumptions. The key insight is that unknown unknowns often become visible when we expose ourselves to different perspectives and ways of thinking.",
    "tags": [
        "decision-making",
        "uncertainties",
        "risks",
        "planning",
        "critical-thinking",
        "blind-spots"
    ],
    "category": "Principles",
    "icon": "FaQuestion",
    "featured": false,
    "aliases": [
        "Rumsfeld Matrix",
        "Known Unknowns Framework",
        "Johari Window of Knowledge"
    ],
    "relatedConcepts": [
        "first-principles",
        "systems-thinking"
    ],
    "relatedNotes": [
        "https://notes.dsebastien.net/30+Areas/32+Literature+notes/32.02+Content/How+to+deal+with+unknown+unknowns"
    ],
    "articles": [],
    "references": [
        {
            "title": "Knowledge Worker Kit",
            "url": "https://store.dsebastien.net/l/knowledge-worker-kit",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        },
        {
            "title": "Personal Organization 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-personal-organization-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-26",
    "dateModified": "2025-12-28"
}
