{
    "id": "wu-wei",
    "name": "Wu Wei",
    "summary": "The Taoist concept of effortless action - achieving through non-forcing.",
    "explanation": "Wu wei (Chinese for 'non-action' or 'effortless action') is a central concept in Taoist philosophy describing a state of acting in perfect harmony with the natural flow of circumstances. Rather than forcing outcomes, wu wei involves: responding to situations appropriately without excessive effort, allowing things to unfold naturally while participating skillfully, and achieving goals through alignment rather than struggle. The concept doesn't mean passivity or inaction but rather action that arises naturally, like water flowing around obstacles. Examples include: a skilled artist whose brush seems to move by itself, a master negotiator who achieves outcomes without appearing to try, and a leader whose influence operates invisibly. Wu wei requires: deep understanding of the situation, release of rigid expectations, and trust in natural unfolding. The opposite of wu wei is forced action - struggling against circumstances, over-controlling, and exhausting effort. For knowledge workers, wu wei suggests: finding work's natural rhythm, achieving through influence rather than force, and recognizing when effort creates resistance rather than progress.",
    "tags": [
        "philosophies",
        "taoism",
        "wisdom",
        "effortlessness",
        "actions"
    ],
    "category": "Concepts",
    "icon": "FaWater",
    "featured": false,
    "aliases": [
        "Non-action",
        "Effortless action",
        "Acting without forcing"
    ],
    "relatedConcepts": [
        "tao-dao",
        "flow-state",
        "yin-and-yang",
        "mindfulness"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Tao Te Ching by Lao Tzu",
            "url": "https://amzn.to/3Dp09NT"
        }
    ],
    "references": [
        {
            "title": "Wu wei - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Wu_wei",
            "type": "website"
        },
        {
            "title": "Knowii Community",
            "url": "https://store.dsebastien.net/l/knowii",
            "type": "other"
        },
        {
            "title": "DeveloPassion Newsletter",
            "url": "https://dsebastien.net/newsletter",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-28",
    "dateModified": "2025-12-28"
}
