{
    "id": "zazen",
    "name": "Zazen",
    "summary": "The seated meditation practice that forms the core of Zen Buddhist training.",
    "explanation": "Zazen (座禅) literally means \"seated meditation\" in Japanese and is the fundamental practice of Zen Buddhism. Unlike meditation techniques that focus on visualizations, mantras, or specific concentration objects, zazen emphasizes direct, present-moment awareness and simply sitting.\n\nThe practice involves:\n\n**Physical Posture**: Practitioners typically sit in lotus or half-lotus position on a cushion (zafu), with spine erect, hands in cosmic mudra (left hand cradling right, thumbs lightly touching), eyes half-open gazing downward, and chin slightly tucked.\n\n**Mental Approach**: Two main approaches exist:\n- **Shikantaza** (\"just sitting\"): Open awareness without focusing on any particular object. Simply being present with whatever arises, without judgment or manipulation.\n- **Koan practice**: Contemplating paradoxical questions or statements (such as \"What is the sound of one hand clapping?\") to transcend conceptual thinking.\n\n**Breath**: Natural breathing through the nose, often with gentle awareness on the breath but without forcing or controlling it.\n\n**Attitude**: A quality of alert, wakeful presence - neither forcing concentration nor allowing the mind to wander. The practice emphasizes accepting thoughts and sensations as they arise without attachment or rejection.\n\nZazen is not considered a means to an end but rather the direct expression of enlightenment itself. The Zen saying \"Practice and enlightenment are one\" reflects this non-dualistic understanding. Regular zazen practice is said to cultivate insight, equanimity, compassion, and direct experience of one's true nature.\n\nThe practice typically occurs in formal settings (zendos) with specific protocols, but can also be done individually. Many practitioners sit daily, often in periods of 25-40 minutes.",
    "tags": [
        "meditation",
        "buddhism",
        "zen",
        "contemplative-practices",
        "mindfulness",
        "spirituality",
        "practices"
    ],
    "category": "Philosophy & Wisdom",
    "icon": "FaBrain",
    "featured": false,
    "aliases": [
        "Seated Meditation",
        "Zen Meditation",
        "Sitting Meditation"
    ],
    "relatedConcepts": [
        "mindfulness",
        "samadhi",
        "makyou",
        "flow-state"
    ],
    "relatedNotes": [],
    "articles": [],
    "books": [
        {
            "title": "Zen Mind, Beginner's Mind by Shunryu Suzuki",
            "url": "https://www.amazon.com/dp/1590308492?tag=dsebastien00-20"
        },
        {
            "title": "The Three Pillars of Zen by Philip Kapleau",
            "url": "https://www.amazon.com/dp/0385260938?tag=dsebastien00-20"
        },
        {
            "title": "Opening the Hand of Thought by Kosho Uchiyama",
            "url": "https://www.amazon.com/dp/0861713575?tag=dsebastien00-20"
        }
    ],
    "references": [
        {
            "title": "Zazen - Wikipedia",
            "url": "https://en.wikipedia.org/wiki/Zazen",
            "type": "website"
        },
        {
            "title": "Journaling Deep Dive Workshop",
            "url": "https://store.dsebastien.net/l/knowii-journaling-deep-dive",
            "type": "other"
        },
        {
            "title": "Clarity 101 Workshop",
            "url": "https://store.dsebastien.net/l/knowii-clarity-101",
            "type": "other"
        }
    ],
    "tutorials": [],
    "datePublished": "2025-12-30",
    "dateModified": "2025-12-30"
}
